#pragma once

#ifndef _DEF_TEXT_H_
#define _DEF_TEXT_H_
typedef enum _textDef {
	MAXNICKNAMELEN = 8,

	MAXCHARS = 100,

	//스몰폰트
	NUM_FONT_SMALL = 0,
	//중간폰트
	NUM_FONT_NORMAL,
	//큰폰트
	NUM_FONT_LARGE,
	//큰폰트 + 앞에 라이튼
	NUM_FONT_LARGE_FORELIGHTEN,
	//큰폰트 + 뒤에 라이튼
	NUM_FONT_LARGE_BACKLIGHTEN,
	NUM_FONT_LARGE_BACKLIGHTEN2,
	NUM_FONT2,

	FONT_SMALL = 0,
	FONT_LARGE,
	FONT_SMALL2,
	FONT_NORMAL,

	FONT_GOLD_SMALL = 0,
	FONT_GOLD_LARGE,

	FONT_HEIGHT_LINE = 14 * _2X,
	FONT_WIDTH = 9 * _2X,			// 한글 폰트의 가로 길이
	FONT_HEIGHT = 11 * _2X,			// 한글 폰트의 세로 길이
#ifdef TTFFONT
	NEXT_FONT_WIDTH = 9 * _2X,		// 한글일때의 옆문자 띄움 간격
	NEXT_ALPHAFONT_WIDTH = 6 * _2X,	// 영어,숫자,특수문자 옆문자 띄움 간격
#else
	NEXT_FONT_WIDTH = 10 * _2X,		// 한글일때의 옆문자 띄움 간격
	NEXT_ALPHAFONT_WIDTH = 6 * _2X,	// 영어,숫자,특수문자 옆문자 띄움 간격
#endif
	NEXT_LINE_HEIGHT = 15 * _2X,		// 다음줄 간격

	ALPHA_FONT_WIDTH = 7 * _2X,		// 알파벳 폰트 가로 길이
	ALPHA_FONT_HEIGHT = 11 * _2X,		// 알파벳 폰트 세로 길이
	SPECIAL_FONT_WIDTH = 9 * _2X,		// 특수문자 폰트 가로 길이
	SPECIAL_FONT_HEIGHT = 11 * _2X,		// 특수문자 폰트 세로 길이

	CHOSUNG1_1_WIDTH = 7 * _2X,		// 종성없는 한글. 세로형 중성의 초성 WIDTH
	CHOSUNG1_1_HEIGHT = 11 * _2X,		// 종성없는 한글. 세로형 중성의 초성 HEIGHT
	CHOSUNG1_2_WIDTH = 7 * _2X,		// 종성없을 때의 혼합형 중성의 초성 or 종성있는 세로형 초성 WIDTH
	CHOSUNG1_2_HEIGHT = 7 * _2X,		// 종성없을 때의 혼합형 중성의 초성 or 종성있는 세로형 초성 HEIGHT
	CHOSUNG1_2_OFFSET = 209 * _2X,	// 혼합형 초성의 OFFSET 위치

	CHOSUNG2_1_WIDTH = 9 * _2X,		// 종성없는 한글. 가로형 중성의 초성 WIDTH
	CHOSUNG2_1_HEIGHT = 8 * _2X,		// 종성없는 한글. 가로형 중성의 초성 HEIGHT
	CHOSUNG2_2_WIDTH = 9 * _2X,		// 종성있는 한글. 가로형 중성의 초성 WIDTH
	CHOSUNG2_2_HEIGHT = 7 * _2X,		// 종성있는 한글. 가로형 중성의 초성 HEIGHT
	CHOSUNG2_2_OFFSET = 152 * _2X,	// 종성있는 가로형 초성의 OFFSET 위치

	CHOSUNG3_1_WIDTH = 7 * _2X,		// 종성없는 한글. 복합형 중성의 초성 WIDTH
	CHOSUNG3_1_HEIGHT = 8 * _2X,		// 종성없는 한글. 복합형 중성의 초성 HEIGHT
	CHOSUNG3_2_WIDTH = 7 * _2X,		// 종성있는 한글. 복합형 중성의 초성 WIDTH
	CHOSUNG3_2_HEIGHT = 7 * _2X,		// 종성있는 한글. 복합형 중성의 초성 HEIGHT
	CHOSUNG3_2_OFFSET = 16 * _2X,		// 종성있는 복합형 중성의 초성 OFFSET

	JUNGSUNG1_1_WIDTH = 11 * _2X,		// 종성이 없는 한글. 단순 및 혼합형 중성 WIDTH
	JUNGSUNG1_1_HEIGHT = 13 * _2X,		// 종성이 없는 한글. 단순 및 혼합형 중성 HEIGHT
	JUNGSUNG1_2_WIDTH = 11 * _2X,		// 종성있는 한글의 가로형 작은 중성 WIDTH
	JUNGSUNG1_2_HEIGHT = 5 * _2X,		// 종성있는 한글의 가로형 작은 중성 HEIGHT
	JUNGSUNG1_2_OFFSET = 273 * _2X,	// 종성있는 작은 가로형 중성 OFFSET 위치
	JUNGSUNG2_WIDTH = 6 * _2X,		// 종성있는 한글의 세로형 작은 중성 WIDTH
	JUNGSUNG2_HEIGHT = 9 * _2X,		// 종성있는 한글의 세로형 작은 중성 HEIGHT

	JONGSUNG_WIDTH = 11 * _2X,		// 한글 종성 WIDTH
	JONGSUNG_HEIGHT = 7 * _2X,		// 한글 종성 HEIGHT

	TEXT_DOWNLOAD = 0,//게임에 필요한 추가 파일을 |c다운로드|b 하시겠습니까? (네트워크 상태에 따라 수분의 시간이 걸릴 수도 있습니다.)@[*네트워크 접속시 통화료가 부과됩니다.]
	TEXT_DOWNLOAD_END,//1//다운로드가 |c완료|b되었습니다.
	TEXT_USERCHECK_NOW,//2	//사용자 정보 인증중입니다.
	TEXT_USERCHECK_SUCCESS,//3	//100 FGT에 참여해주셔서 감사합니다.@@즐거운 시간 되세요~~!
	TEXT_USERCHECK_FAIL,//4	//등록되지 않은 사용자입니다.
	TEXT_USERCHECK_EXPIRE,//5	//FGT 기간이 만료되었습니다.
	TEXT_USERCHECK_GAMEEND,//6	//확인키를 누르시면 게임이 종료됩니다.
	TEXT_TESTBAN,//7//평가버전에서는 지원되지 않는 기능입니다.
	TEXT_EXIT,//8//게임을 종료하시겠습니까?
	TEXT_EQUIPWARNING,//9//해당 장비를 교체한 뒤 전투력이 감소하며 기존 장비가 분해됩니다. 교체하시겠습니까?

	TEXT_VERSION,//10//버전 00.00.01

	TEXT_NOGOLD,//11	//골드가 부족합니다.
	TEXT_NOCOIN,//12	//코인이 부족합니다.
	TEXT_NOMEDAL,//13	//메달이 부족합니다.
	TEXT_INVENTORYFULL,//14//인벤토리가 가득 찼습니다.
	TEXT_NOSOCKET,//15	//소켓이 없는 장비입니다.
	TEXT_CANNOTSELLITEM,//16	//판매할 수 없는 아이템입니다.
	TEXT_ITEMLIMIT,//17//해당 아이템을 더이상 소지할 수 없습니다.
	TEXT_NOORE,//18	//재료가 부족합니다.
	TEXT_NOMOREENCHANT,//19	//더이상 강화하실 수 없습니다.
	TEXT_NOENCHANTITEM,//20//강화할 수 있는 아이템이 없습니다.
	TEXT_NORECIPE,//21	//조합서를 가지고 있지 않습니다.
	TEXT_NOGEM,//22//장비에 장착할 수 있는 보석이 없습니다.
	TEXT_NOGEMITEM,//23//보석을 장착할 수 있는 장비가 없습니다.
	TEXT_BROKENITEM,//24	//부서진 아이템은 강화하실 수 없습니다.
	TEXT_ENCHANTSUCCESS,//25	//강화에 성공하였습니다.
	TEXT_RECIPESUCCESS,//26	//새로운 아이템이 생성되었습니다.
	TEXT_SOCKETSUCCESS,//27	//새로운 아이템이 생성되었습니다.
	TEXT_NOPROTECT,//28	//평가버전에서는 지원되지 않는 기능입니다.
	TEXT_ENCHANTFAILURE,//29	//강화에 실패하여 장비가 파괴되었습니다.
	TEXT_ENCHANTFAILURE2,//30//강화에 실패하였습니다.
	TEXT_BUYOK,//31	//구입하시겠습니까?
	TEXT_SELLOK,	//판매하시겠습니까?
	TEXT_QUESTSTART,	//퀘스트 진행중
	TEXT_QUESTEND,	//퀘스트 완료
	TEXT_CANNOTBROKEN,	//부서진 아이템은 착용할수 없습니다.
	TEXT_CANNOTLV,	//레벨이 낮아서 착용할 수 없습니다.
	TEXT_CANNOTSTAT,	//아이템 요구치가 높아서 착용할 수 없습니다.
	TEXT_CANNOTEQUIP,	//현재 착용할 수 없는 아이템입니다.
	TEXT_CANNOTSAVE,	//현재 위치에서 저장할 수 없습니다.
	TEXT_CANNOTUSECRAFT,	//아직 숙련이 부족하여 이용할 수 없습니다.
	TEXT_SELECTENCHANT_NPC,	//강화할 장비를 고르게나!
	TEXT_SELECTRECIPE_NPC,	//제작할 조합서를 고르게나!
	TEXT_SELECTEQUIP_NPC,	//장착할 장비를 고르게나!
	TEXT_SELECTGEM_NPC,	//장착할 보석을 고르게나!
	TEXT_SELECTSLOT_NPC,	//장착할 슬롯을 고르게나!
	TEXT_SELECTENCHANT,	//강화할 장비를 선택하세요
	TEXT_CANNOTENCHANT,	//강화할 수 없는 아이템입니다
	TEXT_ENCHANTING,	//강화중...
	TEXT_MAKING,	//제작중...
	TEXT_MAKESUCCESS,	//%s |b제작을 완료하였습니다.
	TEXT_MAKECONFIRM1,	//아이템 제작시 |e재료|b와 |e조합서|b가 사라지며 자동으로 |c저장|b됩니다.@@|k제작하시겠습니까?
	TEXT_MAKECONFIRM2,	//아이템 제작시 |e재료|b가 사라지며 자동으로 |c저장|b됩니다.@@|k제작하시겠습니까?
	TEXT_SOCKETCONFIRM1,	//|j소켓|b에 |l보석|b을 장착하면 수정이 |c불가능|b합니다. 단, 기존에 |l보석|b이 장착된 |j소켓|b에 다시 |l보석|b을 덮어쓰기가 |e가능|b합니다.@|j소켓|b에 |l보석|b을 장착하시겠습니까?
	TEXT_SOCKETCONFIRM2,	//%s 능력치가 %s로 변경됩니다.@|j소켓|b에 |l보석|b을 장착하시겠습니까?
	TEXT_EMPTYSOCKET,	//빈 소켓
	TEXT_EMPTYSLOT,	//장착필요
	TEXT_SAVED,//저장되었습니다.

	TEXT_NET_CONNECT,//접속중
	TEXT_NET_SEND,//전송중
	TEXT_NET_RECEIVE,//수신중
	TEXT_NET_ERROR,//네트워크 접속에 |c실패|b하였습니다. 잠시 후 다시 시도해주세요.
	TEXT_NET_PRESENT,//|r0000|b님의 선물 |h[%d월/%d일]

	TEXT_PROPERTY_PHYSICAL,	//물리 속성
	TEXT_PROPERTY_FLAME,	//화염 속성
	TEXT_PROPERTY_FROST,	//냉기 속성
	TEXT_PROPERTY_THUNDER,	//번개 속성
	TEXT_PROPERTY_HOLY,	//신성 속성
	TEXT_PROPERTY_DARK,	//암흑 속성
	TEXT_SLOW,//슬로우
	TEXT_BLIND,//블라인드
	TEXT_POISON,//독
	TEXT_STUN,//기절
	TEXT_CURSE,//저주

	TEXT_SPECIALSHOP,//스페셜상점
	TEXT_EQUIPMENT,//장비
	TEXT_GAMEMENU2,//서포터
	TEXT_GAMEMENU3,//용병단
	TEXT_GAMEMENU4,//설정
	TEXT_GAMEMENU5,//아르바이트

	TEXT_EQUIPINFO,//장비정보

	TEXT_RECIEVE,//받기
	TEXT_RECIEVEOK,//수령완료
	TEXT_WAITING,//진행대기
	TEXT_DOING,//진행중
	TEXT_DELETE,//삭제
	TEXT_RECIEVEALL,//모두받기

	TEXT_BUFFITEM_USING,
	//대륙명
	TEXT_CONTINENT_START,
	//지역명
	TEXT_AREANAME_START = TEXT_CONTINENT_START + TOTALCONTINENT,//톨렘마을

	//몬스터 이름
	TEXT_MONSTERNAME_START = TEXT_AREANAME_START + TOTALAREATYPE,
	//로빈
	//디아나
	//맥스
	//가시껍질 달팽이
	//늪의 주인
	//아이볼
	//칠흑의 기사
	//사하긴 병사
	//맹독 해파리
	//타락한 기사
	//슬라임
	//평원의 도적
	//거친발 멧돼지
	//분노의 정령
	//마성의 불새
	//결빙의 석상
	//스노우맨
	//아이스마스크
	//스파크
	//다크미스트
	//스파크 플랜트
	//라이트 스피릿
	//딜루전 소울
	//타락한 기사2
	//슬라임2
	//스트라이더
	//주인잃은 골렘
	//그레이트 아머
	//우로보로스
	//탐욕의 살육자
	//드래곤 좀비
	//떠도는 영혼
	//무혼의 기사
	//어둠의 마도사
	//공허한 갑주
	//안드로볼
	//메탈가우스
	//토드뮤턴트
	//아르곤
	//카툼
	//고대의 수호자
	//이프리트
	//프로스트
	//라이오너
	//호루스
	//마도합성수
	//고대의 방주
	//아리만
	//티어맷
	//죽음의 신
	//데브리온
	//엘케인 맨티스
	//테트라쿤쉐도우
	//다크나이트
	//라베스
	//엘케인
	//델피오스

	//잭 스패너//NPC_CAPTAIN//c52
	//선원//NPC_CREW//c53
	//촌장//NPC_GRANDFA//c54
	//아저씨//NPC_UNCLE//c55
	//부녀회 회장//NPC_AUNT//c56
	//자경단 청년//NPC_MAN//c57
	//짜증난 아가씨//NPC_WOMAN//c58
	//심심한 꼬마//NPC_BOY//c59
	//귀여운 아이//NPC_GIRL//c60
	//알마//NPC_ALMA//c61
	//캐러밴 상인//NPC_ITEM//c62
	//뚱뚱이//NPC_FATMAN//c63
	//바니걸//NPC_BUNNYGIRL//c64
	//검사 라즈베릴//NPC_KNIGHT//c65
	//충견 플란다스//NPC_DOG//c66
	//장비상인//NPC_MERCHANT//c67
	//대장장이//NPC_CRAFTMAN//c68
	//지도왕 아벨//NPC_MAP//c69
	//홍보대사//NPC_USERQUEST//c70
	//미지의 탐험가//NPC_TRAVEL//c71
	//할머니//NPC_GRANDMA//c72
	//낚시꾼 라피//NPC_FISHING//c73
	//여관주인//NPC_INN//c74
	//스페셜상인//NPC_NETITEM//c75
	//격투가 마일즈//NPC_MILESE//c76
	//해적 도벨//NPC_DOBEL//c77
	//해적 가젤//NPC_GAGEL//c78
	//모니마 선생님//NPC_MONICA//c79
	//해적선//NPC_SHIP//c80
	//반어인 병사//NPC_SEASOLDIER//c81
	//수중황제 프라우트//NPC_FRAUD//c82
	//수중대신 다리안//NPC_DARIAN//c83
	//루이제 공주//NPC_LUISE//c84
	//반어인 롤란//NPC_SEAUNCLE//c85
	//반어인 꼬마 모시//NPC_SEABOY//c86
	//브루스 미//NPC_DONALD//c87
	//역사학자//NPC_SCHOLAR//c88
	//쉐프 가르니에//NPC_CHEF//c89
	//비스트로//NPC_BISTRO//c90
	//보모 메어리//NPC_MAID//c91
	//근위대장//NPC_ADELKNIGHT//c92
	//대신 세바스찬//NPC_SEBASTIAN//c93
	//몬테오 남작//NPC_NOBLEMAN//c94
	//델피오스 백작//NPC_DELPIOS//c95
	//로라 공주//NPC_LORA//c96
	//마녀//NPC_WITCH//c97
	//할아버지 엘프//NPC_ELFGRANDFA//c98
	//질풍의 검사//NPC_ELFUNCLE//c99
	//엘프 메로의 엄마//NPC_ELFAUNT//c100
	//엘프 정원사//NPC_ELFMAN//c101
	//엘프 루디아//NPC_ELFWOMAN//c102
	//엘프 메로//NPC_ELFBOY//c103
	//엘프 카나리아//NPC_ELFGIRL//c104
	//다크엘프//NPC_ELFDARK//c105
	//사제엘프//NPC_ELFMAGIC//c106
	//무희//NPC_ELFDANCER//c107
	//부엉이//NPC_OWL//c108
	//라베스//NPC_LABETH//c109
	//엘케인//NPC_ELKEIN//c110
	//엘레인//NPC_ELEIN//c111
	//에번//NPC_EVAN//c112
	//이상한 테이블//NPC_TABLE//c113
	//태양의 샘물//NPC_FOUNTAIN//c114
	//네자르//NPC_NEZAR//c115
	//갈란드//NPC_GALLAND//c116
	//듀라크//NPC_DURAK,//c117
	//에드몬드 왕//NPC_KING//c118
	//여자유령 캐서린//NPC_WOMANGHOST//c119
	//남자유령 버틀러//NPC_MANGHOST//c120
	//유령 오스틴//NPC_AUSTIN//c121
	//마왕의 심장//NPC_HEART//c122

	//아이템 이름
	TEXT_ITEMNAME_START = TEXT_MONSTERNAME_START + CAP_ENEMY,

	TEXT_ITEMNAME_SWORD = TEXT_ITEMNAME_START,
	//연습용 몽둥이
	//롱소드
	//처형자의 검
	//파멸의 참마도
	//추적자의 검
	//격노의 양날검
	//수호자의 검
	//왕가의 수호자
	//나찰의 검
	//소울 크래셔
	//차원의 검
	//천공의 검
	//스타더스트
	//드래곤 클로우
	//황룡의 어금니
	//신룡강마검

	TEXT_ITEMNAME_GUN = TEXT_ITEMNAME_SWORD + TOTAL_SWORD,

	//발화식 총
	//리볼버 파이슨
	//45구경 오토건
	//사일런트 킬러
	//고져스 건
	//럭셔리 캐논
	//회천마도총
	//마도머신건
	//태양의 총
	//슈퍼노바
	//헬파이어 건
	//인페르노 캐논
	//마룡열화포
	//크로스 파이어
	//테스타먼트
	//라그나로크

	TEXT_ITEMNAME_BOOMERANG = TEXT_ITEMNAME_GUN + TOTAL_GUN,

	//사냥용 부메랑
	//슬라이서
	//강철 부메랑
	//윈드 슬래셔
	//트라이 엣지
	//헬 트라이앵글
	//라이트닝 엣지
	//한탄의 부메랑
	//소울 체이서
	//둠 슬레이어
	//그리폰 윙
	//윙 오브 데스
	//드래곤 윙
	//로커스트 헌트
	//제노사이드 윙
	//디재스터 엣지

	TEXT_ITEMNAME_HELM = TEXT_ITEMNAME_BOOMERANG + TOTAL_BOOMERANG,

	//헤드 가드
	//바시넷
	//솔저 헬름
	//센츄리온 헬멧
	//검투사의 투구
	//블러디 헬멧
	//스파이크 헤드
	//귀신의 투구
	//그랜드 헬름
	//성기사의 투구
	//고대의 투구
	//환영의 투구
	//미라주 헬름
	//용자의 투구
	//져지먼트 헬멧
	//오시리스 헬멧

	TEXT_ITEMNAME_HAT = TEXT_ITEMNAME_HELM + TOTAL_HELM,

	//카우보이 모자
	//산책용 보닛
	//레인저 햇
	//무법자의 모자
	//서클릿
	//골드 블레스
	//올드 윌로우
	//엘븐 햇
	//스나이퍼 고글
	//어쌔신 스코프
	//혼란의 모자
	//카오스 솔져
	//나이트메어 햇
	//프리에스테스
	//발키리 서클릿
	//오딘 크라운

	TEXT_ITEMNAME_CAP = TEXT_ITEMNAME_HAT + TOTAL_HAT,

	//공작깃털 모자
	//귀족의 머리띠
	//거상의 모자
	//캐러벤 리더
	//사냥꾼 모자
	//로빈훗 캡
	//투우사의 모자
	//미노타우르스
	//해적의 모자
	//졸리로져 캡
	//에이스 캡
	//브레이브 캡
	//다이너스티 캡
	//드래곤 레어캡
	//히드라 헤드
	//리바이어선 캡

	TEXT_ITEMNAME_ARMOR = TEXT_ITEMNAME_CAP + TOTAL_CAP,

	//헌터 튜닉
	//미늘 갑옷
	//하프 플레이트
	//밴디트 메일
	//스컬 메일
	//마검사의 흉갑
	//황금세공 갑옷
	//드워븐 아머
	//미스릴 아머
	//요정의 갑주
	//고대의 갑옷
	//불멸의 갑주
	//브리건딘
	//용비늘 갑옷
	//황룡의 갑옷
	//바하무트 아머

	TEXT_ITEMNAME_VEST = TEXT_ITEMNAME_ARMOR + TOTAL_ARMOR,

	//카우보이 조끼
	//실크 조끼
	//방랑자의 조끼
	//서바이벌 조끼
	//도적의 조끼
	//어쌔신 베스트
	//벨벳 셔츠
	//고딕 셔츠
	//귀족의 조끼
	//은사슬 조끼
	//진홍빛 셔츠
	//불사의 셔츠
	//뱀파이어 로드
	//신관의 로브
	//세라핌 로브
	//루시펠 로브

	TEXT_ITEMNAME_COAT = TEXT_ITEMNAME_VEST + TOTAL_VEST,

	//수수한 코트
	//패딩 아머
	//털가죽 코트
	//그리즐리 스킨
	//큐어 보일
	//코아틀 스케일
	//귀족의 코트
	//흑까마귀 코트
	//극지의 코트
	//블리자드 가드
	//윙 코트
	//가고일 코트
	//페가수스 코트
	//바이스 코트
	//종말의 코트
	//카오스 엠페러

	TEXT_ITEMNAME_GUNTLET = TEXT_ITEMNAME_COAT + TOTAL_COAT,

	//핸드 가드
	//청동 장갑
	//체인 건틀렛
	//모험자의 장갑
	//나이트 글로브
	//명성의 장갑
	//비스트 핸드
	//오우거 건틀렛
	//라이징 건틀렛
	//무쌍의 장갑
	//광전사의 장갑
	//뇌격파수
	//시바의 손톱
	//드래곤 핸드
	//백룡의 장갑
	//바하무트 핸드

	TEXT_ITEMNAME_ARMLET = TEXT_ITEMNAME_GUNTLET + TOTAL_GUNTLET,

	//사제의 묵주
	//여행자의 팔찌
	//백금 브레스렛
	//연인의 팔찌
	//전사의 암렛
	//임프 암렛
	//에메랄드 팔찌
	//노블레스 암렛
	//이블 암렛
	//몽마의 팔찌
	//위엄의 팔찌
	//지배자의 팔찌
	//엠프레스 암렛
	//영웅의 팔찌
	//소울 브레스렛
	//갓 핸드

	TEXT_ITEMNAME_GLOVE = TEXT_ITEMNAME_ARMLET + TOTAL_ARMLET,

	//여행자의 장갑
	//이중매듭 장갑
	//소매치기 장갑
	//섀도우 핸드
	//실크 글로브
	//귀공자의 장갑
	//세공사의 장갑
	//마스터 글러브
	//마법문양 장갑
	//커스드 글로브
	//심판의 손
	//구원의 손
	//이터널 져지
	//성자의 장갑
	//팔라딘 글로브
	//홀리 핸드

	TEXT_ITEMNAME_KILT = TEXT_ITEMNAME_GLOVE + TOTAL_GLOVE,

	//밴딩 킬트
	//체인 킬트
	//나이트 킬트
	//배틀 킬트
	//스컬 킬트
	//사령의 바지
	//수령의 바지
	//토르의 바지
	//미스릴 킬트
	//페어리 킬트
	//에인션트 킬트
	//이터널 킬트
	//언리밋 킬트
	//용수염 킬트
	//청룡의 킬트
	//용기사 바지

	TEXT_ITEMNAME_SKIRT = TEXT_ITEMNAME_KILT + TOTAL_KILT,

	//양단 스커트
	//빈티지 스커트
	//단풍염색 치마
	//홍련의 스커트
	//벨벳 스커트
	//소공녀의 치마
	//폭풍의 스커트
	//무지개빛 치마
	//금실의 치마
	//여제의 스커트
	//영광의 치마
	//현자의 치마
	//성령의 치마
	//사제의 스커트
	//비슈누 스커트
	//태양의 스커트

	TEXT_ITEMNAME_PANTS = TEXT_ITEMNAME_SKIRT + TOTAL_SKIRT,

	//승마용 바지
	//카프스킨 팬츠
	//망령의 팬츠
	//머미 밴디지
	//흑단의 바지
	//어쌔신 팬츠
	//세일러 팬츠
	//제독의 바지
	//데저트 팬츠
	//캐러밴 팬츠
	//카오틱 팬츠
	//침묵의 바지
	//아비스 팬츠
	//가디안 팬츠
	//켈베로스 레더
	//아누비스 바지

	TEXT_ITEMNAME_GREAVES = TEXT_ITEMNAME_PANTS + TOTAL_PANTS,

	//코퍼 그리브
	//밴디트 그리브
	//체인 그리브
	//나이트 그리브
	//프로즌 그리브
	//만년설의 신발
	//플레이트 부츠
	//드워븐 그리브
	//빅풋 그리브
	//골렘 그리브
	//마검사의 신발
	//사령의 신발
	//종말의 발소리
	//드래곤 그리브
	//마룡의 발자국
	//가이아 그리브

	TEXT_ITEMNAME_SHOES = TEXT_ITEMNAME_GREAVES + TOTAL_GREAVES,

	//웨스턴 슈즈
	//스웨이드 슈즈
	//라이딩 슈즈
	//밀리터리 워커
	//칠흑의 슈즈
	//마녀의 슈즈
	//귀부인의 신발
	//로얄 셀레브
	//리치 슈즈
	//팬텀 테일즈
	//프리즘 슈즈
	//미라클 슈즈
	//그라비티 슈즈
	//베이그란트
	//페이트 슈즈
	//데스티니 슈즈

	TEXT_ITEMNAME_BOOTS = TEXT_ITEMNAME_SHOES + TOTAL_SHOES,

	//스니커즈
	//스캐빈저 부츠
	//천둥가죽 신발
	//낙뢰의 자국
	//가드너 부츠
	//토렌트 루트
	//세일러 부츠
	//캡틴 부츠
	//저승의 신발
	//헬 스트라이더
	//엘레멘탈 부츠
	//브리징 윈드
	//템페스트 부츠
	//에어워커
	//클라우드 부츠
	//헤븐리 부츠

	TEXT_ITEMNAME_NECK = TEXT_ITEMNAME_BOOTS + TOTAL_BOOTS,

	//명예의 펜던트
	//연옥의 브로치
	//찰나의 팔찌
	//황금 바늘
	//파열의 팔찌
	//메피스토 피리
	//사멸의 하프
	//인어의 머리핀
	//찬트의 펜던트
	//미래의 거울
	//피의 모래시계
	//지옥의 만화경
	//전능의 브로치
	//생명의 보옥
	//증식의 목걸이
	//천공의 목걸이
	//현자의 돌
	//꿈의 오카리나
	//무한의 나침반
	//기억의 오르골
	//난쟁이의 공
	//탐욕의 항아리
	//팬더인형
	//스마일 브로치
	//토르테 악보
	//용자의 시계
	//악마의 뿔피리
	//아만디움 달걀
	TEXT_ITEMNAME_RING = TEXT_ITEMNAME_NECK + TOTAL_NECK,//28
	//사신의 반지
	//통찰의 반지
	//시공의 반지
	//해방의 반지
	//산호석 반지
	//생환의 반지
	//희생의 반지
	//폭주의 반지
	//골렘의 반지
	//광대의 반지
	//원한의 반지
	//신념의 반지
	//광포의 반지
	//승자의 반지
	//궁극의 반지
	//차원의 반지
	//영화의 반지
	//행운의 반지
	TEXT_ITEMNAME_GEM = TEXT_ITEMNAME_RING + TOTAL_RING,//18
	//루비
	//사파이어
	//자수정
	//다이아몬드
	//진주
	//에메랄드
	TEXT_ITEMNAME_WASTES = TEXT_ITEMNAME_GEM + TOTAL_GEM,
	//귀환서
	//별의 씨앗
	//달의 씨앗
	//태양의 씨앗
	//은빛 허브
	//금빛 허브
	//진홍빛 허브
	//세계수의 물
	//풀피리
	//안약
	//해독제
	//릴의 날개
	//성수
	//불의 정령석
	//물의 정령석
	//번개의 정령석
	//빛의 정령석
	//어둠의 정령석
	//화염의 정령석
	//얼음의 정령석
	//천둥의 정령석
	//섬광의 정령석
	//칠흑의 정령석
	//|e강화의 비약
	//|e인내의 비약
	//|e치유의 비약
	//|e마법의 비약
	TEXT_ITEMNAME_IRON = TEXT_ITEMNAME_WASTES + TOTAL_WASTE,
	//철광석
	//은괴
	//토륨 파편
	//다마스커스
	//아다만티움
	//미스릴 결정
	//오리하르콘
	//이터늄 원석
	TEXT_ITEMNAME_LEAHTER = TEXT_ITEMNAME_IRON + TOTAL_IRON,
	//얇은 가죽
	//반짝이는 비늘
	//무쇠 가죽
	//돌연변이 비늘
	//달빛 가죽
	//바실리스크 비늘
	//지옥사자 가죽
	//붉은 용비늘
	TEXT_ITEMNAME_CLOTH = TEXT_ITEMNAME_LEAHTER + TOTAL_LEATHER,
	//감색 실타래
	//거미줄 옷감
	//비단 실타래
	//심연의 실타래
	//은하수 옷감
	//천고의 옷감
	//공허의 실타래
	//룬문자 옷감
	TEXT_ITEMNAME_WOOD = TEXT_ITEMNAME_CLOTH + TOTAL_CLOTH,
	//벼락맞은 가지
	//얼어붙은 가지
	//맨드레이 뿌리
	//거인의 뿌리
	//저주받은 뿌리
	//고대의 가지
	//지옥의 뿌리
	//세계수의 가지
	TEXT_ITEMNAME_ESSENCE = TEXT_ITEMNAME_WOOD + TOTAL_WOOD,
	//단단한 껍질
	//오염된 넝쿨
	//심연의 눈동자
	//저주받은 해골
	//푸른 비늘
	//반짝이는 심장
	//야생의 돌
	//갈라진 어금니
	//염의 증류수
	//빛의 깃털
	//질풍의 조각
	//눈의 결정
	//결빙의 옥루
	//우레 가루
	//뇌문의 쐐기
	//마력의 구슬
	//요정의 눈물
	//광휘의 염료
	//용맹의 증표
	//슬라임 윤활액
	//혼미의 영석
	//월석 파편
	//영혼의 꼬리
	//농염의 십자가
	//황천의 보주
	//유혹의 향료
	//만고의 뿔
	//전능의 수정
	//은하수 날개
	//뫼비우스의 띠
	//영원의 상
	//노스 제왕석
	//포비든 스톤
	//묘지의 반딧불
	//지배의 삼지창
	//엠페러 스톤
	//볼케이노 잼
	//프로즌 셸
	//인피니티 볼트
	//다즐링 램프
	//가공된 마석
	//황천의 닻
	//금단의 과실
	//적룡의 숨결
	//원혼의 결정
	TEXT_ITEMNAME_RECIPE = TEXT_ITEMNAME_ESSENCE + TOTAL_ESSENCE,
	TEXT_ITEMNAME_QUEST = TEXT_ITEMNAME_RECIPE + 1,
	//조합서
	TEXT_ITEMNAME_NETITEM = TEXT_ITEMNAME_QUEST + TOTAL_QUESTITEM,
	//쿠폰
	//|d투기장 입장권
	//|e강화석
	//|e보호석
	//|e조합석
	//|e분해석
	//|e소켓석
	//|g영혼의 변화
	//|e부활약
	//|g고급무기상자
	//|d중급무기상자
	//|e하급무기상자
	//|g고급방어구상자
	//|d중급방어구상자
	//|e하급방어구상자
	//|g고급악세사리상자
	//|d중급악세사리상자
	//|e하급악세사리상자
	//|e랜덤아이템상자
	//|d고급보석상자
	//|e가방
	//|d창고가방
	//|dAP초기화
	//|dSP초기화
	//|i초심자 패키지
	//|i슈퍼강화 패키지
	//|i스톤 패키지
	//|i투기장 패키지
	//|i행운 패키지
	//|h경험치 상자
	TEXT_ITEMNAME_GOLD = TEXT_ITEMNAME_NETITEM + TOTAL_NETITEM,
	//|k%d000 골드
	TEXT_ITEMNAME_KEY,
	//금단의 계곡 열쇠
	//어둠의 열쇠
	//푸른비늘 열쇠
	//차원의 열쇠
	//결빙의 열쇠
	//전격의 열쇠
	//위광의 열쇠
	//지하도의 열쇠
	//골렘의 협곡의 열쇠
	//칠흑의 열쇠
	//드래곤의 열쇠
	//금지된 땅의 열쇠
	//마왕성의 열쇠
	//왕가의 펜던트
	//근성의 허리띠
	//신기루의 목걸이
	//거인의 장갑
	TEXT_ITEMNAME_STATUE = TEXT_ITEMNAME_KEY + TOTAL_KEYITEM,
	//질풍의 상
	//파괴의 상
	//완력의 상
	//인어의 상
	//불꽃의 상
	//펭귄의 상
	//얼음의 상
	//번개의 상
	//태양의 상
	//토끼의 상
	//골렘의 상
	//차원의 상
	//독수리의 상
	//다람쥐의 상
	//드래곤의 상
	//진공의 상
	TEXT_ITEMNAME_HEART = TEXT_ITEMNAME_STATUE + TOTAL_STATUE,
	TEXT_ITEMNAME_MEDAL,
	TEXT_ITEMNAME_STAR,
	TEXT_ITEMNAME_HAMMER,
	TEXT_ITEMNAME_BOX,
	//아이템 설명
	TEXT_ITEMDESC_START = TEXT_ITEMNAME_BOX + TOTAL_BOX,
	TEXT_ITEMDESC_SWORD = TEXT_ITEMDESC_START,
	//잘 부러지지않는 튼튼한 몽둥이
	//기사들이 애용하는 다루기 쉬운 검
	//강철도 가른다는 날카로운 검
	//거대하여 다루기 힘들지만 대단한 파괴력의 검
	//나라를 배신한 자를 추격하는 기사단의 검
	//갑옷을 파괴하기 위해 만들어진 강력한 장검
	//고대왕국의 명예로운 기사들이 사용했던 검
	//왕을 지키는 최강의 기사들에게 수여된 검
	//지옥의 죄인을 벌하는 귀신의 검
	//육체와 함께 영혼까지 소멸시키는 파멸의 검
	//그 날카로움이 시간과 공간마저 베어버린다는 검
	//해석불가능한 다른 세계의 물질로 만들어진 검
	//별을 파괴하는 힘을 가졌다고 전해지는 검
	//드래곤의 발톱으로 만들어진 검
	//금빛으로 빛나는 황룡의 어금니로 만든 검
	//용족을 다스리는 신룡의 힘이 깃든 검

	TEXT_ITEMDESC_GUN = TEXT_ITEMDESC_SWORD + TOTAL_SWORD,

	//화약에 불을 붙여서 사용하는 간단한 총
	//한 번에 6발의 총탄을 장착할 수 있는 연발식 총
	//45인치 탄약을 사용하여 공격력을 강화한 총
	//소음기가 장착된 암살자의 총
	//황금과 보석으로 화려하게 장식된 총
	//고대왕국의 귀족들이 사용했다는 신비한 총
	//공격받은 자의 영혼을 하늘로 돌려보낸다는 총
	//마력이 깃든 보석으로 위력을 강화한 마도총
	//태양빛을 이용하는 잊혀진 기술이 활용된 총
	//마치 초신성과 같은 강력한 힘을 발휘하는 총
	//뜨거운 불꽃을 분사하는 마법의 총
	//연옥의 불꽃으로 적을 공격하는 강력한 총
	//사악한 마룡의 숨결을 불러일으키는 총
	//잊혀진 고대 성직자의 십자가를 본뜬 총
	//신의 권능으로 성스러운 기적을 행하는 총
	//신들의 전쟁에 사용되었다고 전해지는 전설의 총

	TEXT_ITEMDESC_BOOMERANG = TEXT_ITEMDESC_GUN + TOTAL_GUN,

	//사냥꾼을 위한 가벼운 부메랑
	//예리한 날이 장비된 부메랑
	//강철로 만들어져 무겁지만 강력한 부메랑
	//바람마저 가르는 날카로운 부메랑
	//세개의 날을 장비하여 위력이 향상된 부메랑
	//연옥의 불꽃으로 담금질한 세날 부메랑
	//번개처럼 빠르게 날아가는 부메랑
	//원한을 품은 영혼이 봉인된 부메랑
	//영혼을 먹어치운다는 악령의 부메랑
	//운명을 거역한 죄인들의 뼈로 만든 저주받은 부메랑
	//그리폰의 형상을 띈 정교한 부메랑
	//사신의 날개라는 별명이 붙은 고대의 부메랑
	//폭풍을 부르는 드래곤의 날개로 만들어진 부메랑
	//공격당한 자의 모든것을 빼앗는다는 부메랑
	//나라를 멸망시킬 정도의 힘을 가진 부메랑
	//타락한 천사에 신을 대신한 재앙을 내린 부메랑

	TEXT_ITEMDESC_HELM = TEXT_ITEMDESC_BOOMERANG + TOTAL_BOOMERANG,

	//머리를 보호하는 간편한 투구
	//강철로 만들어진 튼튼한 투구
	//전사들의 생명을 지켜주는 투구
	//백명의 군대를 지휘하는 장군이 착용하는 투구
	//고대왕국의 노예검투사들이 사용했다는 투구
	//피로 색칠된 붉은 문양이 적을 압도하는 투구
	//예리한 뿔들로 장식된 투구
	//식인귀의 뿔로 만들어진 귀신형상의 투구
	//왕국을 지키는 그랜드 나이트들에게 주어진 투구
	//구세주를 따른 12명의 성기사들이 사용한 투구
	//마력이 깃든 룬문자가 새겨진 고대왕국의 투구
	//보는 이를 혼란시켜 전투 불능으로 만드는 투구
	//보는 이를 환상에 빠지게 해 자멸하도록 만드는 투구
	//나라를 지킨 용사에게 선사된 투구
	//정의를 심판하는 자의 위엄을 기리는 투구
	//위대한 심판의 신, 오시리스의 투구

	TEXT_ITEMDESC_HAT = TEXT_ITEMDESC_HELM + TOTAL_HELM,

	//카우보이들이 즐겨쓰는 튼튼한 모자
	//산책용으로 햇빛을 가려주는 가벼운 모자
	//숲속을 누비는 레인저들이 애용하는 모자
	//전설의 무법자 벨스타의 마지막 유품
	//약점을 보호해주는 마법의 머리띠
	//축복이 깃든 황금으로 만들어진 서클렛
	//나무요정들이 사용한다는 신비한 모자
	//전설의 종족 엘프가 만들었다고 전해지는 모자
	//정교한 사격이 가능하도록 눈금이 표시된 고글
	//암살자들을 위해 만들어진 고급 고글
	//적을 혼란시키는 현란한 무늬의 모자
	//혼돈의 왕을 따르는 병사들의 모자
	//악몽의 지배자 나이트메어의 모자
	//여교황을 상징하는 화려한 왕관
	//인간계의 영웅을 추모하는 여신의 왕관
	//이계의 신 오딘의 권위를 상징하는 왕관

	TEXT_ITEMDESC_CAP = TEXT_ITEMDESC_HAT + TOTAL_HAT,

	//공작새의 깃털로 장식된 품위있는 모자
	//귀족들의 주문으로 만들어진 고급 머리띠
	//대륙을 오가며 장사하는 거상들의 모자
	//사막 캐러밴의 지휘자들이 사용하는 모자
	//숙련된 사냥꾼들이 애용하는 모자
	//숲의 정령들이 영웅 로빈훗에게 선물한 모자
	//죽음을 두려워하지 않는 투우사들의 모자
	//인간의 몸을 가진 황소 괴물의 뿔이 장식된 모자
	//해골문양이 장식된 해적들의 모자
	//공포의 상징인 해적왕 졸리로져의 모자
	//최고의 사냥꾼에게 주어지는 모자
	//용감한 전사에게 경의를 표하기 위한 모자
	//전쟁을 승리로 이끈 패왕의 위업을 기리는 모자
	//드래곤의 비늘로 만들어진 튼튼한 가죽 모자
	//마룡 히드라의 비늘로 만들어진 모자
	//바다의 지배자 리바이어선의 비늘로 만들어진 모자

	TEXT_ITEMDESC_ARMOR = TEXT_ITEMDESC_CAP + TOTAL_CAP,

	//효율적으로 몸을 보호하는 갑옷
	//비늘 모양의 철판을 엮어 만들어진 갑옷
	//가죽 위에 철판을 덧댄 튼튼한 흉갑
	//무게를 줄이기 위해 가슴 부분만 남긴 돌격용 흉갑
	//해골 기사의 가슴뼈로 만들어진 갑옷
	//마법으로 방어력을 강화시킨 신비한 갑옷
	//정교한 황금세공이 돋보이는 갑옷
	//금속 세공에 뛰어난 기술을 가진 난쟁이가 만든 갑옷
	//진귀한 금속 미스릴로 만들어진 갑옷
	//요정의 마력이 깃든 신비한 갑옷
	//유적에서 발굴된 고대기사의 갑옷
	//특별히 보존상태가 좋은 고대용자의 갑옷
	//전쟁의 신이 인간의 영웅에게 하사했다는 갑옷
	//용의 비늘을 엮어 만들어진 튼튼한 갑옷
	//황룡의 비늘로 만들어진 갑옷
	//성룡 바하무트의 비늘을 엮어 만들어진 최강의 갑옷

	TEXT_ITEMDESC_VEST = TEXT_ITEMDESC_ARMOR + TOTAL_ARMOR,

	//카우보이들이 즐겨입는 조끼
	//부드러운 비단을 덧대어 만들어진 조끼
	//대륙을 떠도는 방랑자들이 입는 조끼
	//험난한 여행에 적합하도록 고안된 다목적 조끼
	//도적들이 입는 가벼우면서 튼튼한 조끼
	//입은 자의 모습을 감춰준다는 신비한 조끼
	//고급스러운 벨벳 소재로 만들어진 셔츠
	//고딕 양식을 적용한 품격있는 셔츠
	//귀족들이 입는 화려한 조끼
	//은으로 만든 사슬을 엮어 화려함을 강조한 조끼
	//마치 피와 같은 붉은 빛이 인상적인 셔츠
	//죽은 자를 되살리기 위한 주문이 담긴 셔츠
	//사람의 피를 마시며 영원히 사는 뱀파이어의 셔츠
	//신관의 기품이 느껴지는 로브
	//천사의 가호가 담긴 로브
	//전설의 대천사 루시펠의 깃털로 만들어진 로브

	TEXT_ITEMDESC_COAT = TEXT_ITEMDESC_VEST + TOTAL_VEST,

	//높은 방어력은 기대할 수 없는 가벼운 코트
	//가죽을 덧댄 두꺼운 코트
	//지놈의 가죽으로 만들었다고 전해지는 코트
	//강철보다 단단한 그리즐리의 가죽으로 만들어진 코트
	//가죽 위에 납을 씌워 방어력을 강화시킨 코트
	//날개가 달린 뱀 코아틀의 비늘로 만들어진 코트
	//귀족들이 애용하는 고풍스러운 코트
	//저주받은 흑까마귀의 깃털로 만들어진 코트
	//추운 극지대를 탐험하기 위한 코트
	//눈보라를 견뎌낼 정도로 두텁고 튼튼한 코트
	//사람을 잡아먹는 괴조의 날개가 장식된 코트
	//달빛을 받으면 괴물로 변하는 수호신 가고일의 코트
	//천계의 페가수스의 날개가 장식된 코트
	//인간의 사악함을 이끌어내는 악마의 코트
	//세계의 종말을 원하는 악마가 만들어낸 코트
	//혼돈의 왕이 입었다고 전해지는 고대의 코트

	TEXT_ITEMDESC_GUNTLET = TEXT_ITEMDESC_COAT + TOTAL_COAT,

	//가죽과 금속으로 만들어진 보호장갑
	//청동으로 만들어진 장갑
	//사슬로 만들어진 튼튼한 건틀렛
	//극한의 환경에서도 부서지지 않도록 만들어진 장갑
	//왕국의 기사들이 애용하는 건틀렛
	//고대왕국에서 내려오는 기법으로 만들어진 건틀렛
	//야수의 뼈와 발톱을 가공하여 만들어진 장갑
	//오우거와 같은 강력한 힘을 솟아나게 하는 건틀렛
	//고위 성기사들이 사용한다는 고급 건틀렛
	//위대한 전사를 기리기 위해 만들어진 건틀렛
	//전사의 광폭함을 이끌어내는 저주받은 장갑
	//번개의 힘으로 모든 것을 파괴시키는 장갑
	//이계의 파괴신 시바의 손톱으로 장식된 장갑
	//드래곤의 비늘로 만들어진 건틀렛
	//백룡의 비늘로 만들어진 건틀렛
	//성룡 바하무트의 비늘로 만들어진 최강의 건틀렛

	TEXT_ITEMDESC_ARMLET = TEXT_ITEMDESC_GUNTLET + TOTAL_GUNTLET,

	//신에게 기도를 올릴 때 사용하는 묵주
	//황야의 거친 바람을 막아주는 가호가 깃든 팔찌
	//아름다운 빛을 발하는 백금으로 만들어진 팔찌
	//연인들의 사랑을 축복하기 위한 팔찌
	//방패 대용으로 쓸 수 있을정도로 튼튼한 팔찌
	//지옥의 악마 임프의 모양이 조각된 팔찌
	//에메랄드로 장식된 화려한 팔찌
	//보석으로 장식된 귀족들의 팔찌
	//어쩐지 사악한 기운이 느껴지는 팔찌
	//꿈을 먹는 몽마를 봉인한 팔찌
	//여교황의 위엄을 상징하는 팔찌
	//황제의 업적을 기리는 고귀한 팔찌
	//패왕을 낳은 여황제가 사용했다는 팔찌
	//전설의 칠영웅이 사용했다는 팔찌
	//신의 사자에게 부여된 팔찌
	//신의 기적을 일으킨다고 전해지는 팔찌

	TEXT_ITEMDESC_GLOVE = TEXT_ITEMDESC_ARMLET + TOTAL_ARMLET,

	//리넨 옷감으로 만들어진 가벼운 장갑
	//매듭을 두 번 엮어 만들어진 튼튼한 장갑
	//착용후에도 정밀한 손동작을 할 수 있는 장갑
	//어둠을 잡을 수 있다고 전해지는 장갑
	//비단으로 만들어진 고급장갑
	//벨벳소재로 만들어진 품격있는 장갑
	//보석세공사가 사용하는 정교한 장갑
	//무기의 달인이 사용하는 실용적인 장갑
	//마법문양이 새겨져 저항력이 향상된 장갑
	//강력한 저주의 문양이 새겨진 마법의 장갑
	//죄인을 심판하는 심판자에게 주어지는 장갑
	//죄를 사하여 삶을 되돌려주는 장갑
	//죄지은 자를 영원히 멸하는 힘을 가진 장갑
	//성령의 힘이 담긴 수정이 박힌 장갑
	//신의 사명을 받아 악을 물리친 성기사들의 장갑
	//신의 가호로 기적을 일으킨다고 전해지는 장갑

	TEXT_ITEMDESC_KILT = TEXT_ITEMDESC_GLOVE + TOTAL_GLOVE,

	//가죽과 금속으로 만들어진 수수한 킬트
	//사슬을 엮어 만들어진 튼튼한 킬트
	//기동력과 방어력을 겸비한 킬트
	//전사들이 애용하는 실용적인 킬트
	//해골 기사의 뼈로 만들어진 킬트
	//망자들의 저주가 깃든 킬트
	//사막의 정복왕이 착용했다는 바지
	//대장장이의 신 토르가 만들었다고 전해지는 바지
	//진귀한 금속 미스릴로 만들어진 킬트
	//요정의 축복이 깃든 신비한 킬트
	//유적에서 발굴된 고대 기사의 킬트
	//유구한 세월을 견뎌온 고대 왕족의 킬트
	//착용한 자의 한계를 넘어서게 한다는 전설의 킬트
	//용의 수염을 엮어 만들어진 킬트
	//청룡의 비늘과 수염을 엮어낸 킬트
	//드래곤 슬레이어가 입었다는 전설의 바지

	TEXT_ITEMDESC_SKIRT = TEXT_ITEMDESC_KILT + TOTAL_KILT,

	//안감에 양털을 덧대어 보온성을 높힌 치마
	//낡아 보이지만 매우 튼튼한 치마
	//단풍잎으로 염색한 아름다운 치마
	//타오르는 불꽃무늬가 새겨진 치마
	//벨벳소재로 만들어진 품격있는 치마
	//금빛이 감도는 고급스러운 귀족의 치마
	//바람의 보호를 받게 해주는 마법의 치마
	//일곱 가지 마법으로 부터 보호받는 마법의 치마
	//금실로 만들어진 화려하면서도 튼튼한 치마
	//패왕을 낳은 여황제가 입었다는 치마
	//안쪽에 영광의 축언이 수놓인 왕족의 치마
	//어질고 총명한 현자를 위해 만들어진 치마
	//성령을 따르는 이들에게 주어진 천계의 치마
	//사제의 기품이 느껴지는 치마
	//세상의 질서를 유지하는 비슈누의 치마
	//만물의 생명을 관장하는 태양신의 치마

	TEXT_ITEMDESC_PANTS = TEXT_ITEMDESC_SKIRT + TOTAL_SKIRT,

	//얇고 튼튼한 승마용 바지
	//가죽을 덧대어 만든 튼튼한 바지
	//죽은 자의 원한이 담긴 바지
	//저주받은 악령을 봉인한 붕대로 만든 바지
	//어두운 곳에서 몸을 숨겨주는 바지
	//암살자가 입는 기동성이 뛰어난 바지
	//선원들이 입는 튼튼한 바지
	//제독의 권위를 표현한 품격있는 바지
	//사막의 거친 환경 속에서 몸을 지켜주는 바지
	//사막의 캐러밴의 부호들이 입는 바지
	//혼돈을 다스리는 마력이 깃든 바지
	//침묵의 성자들의 힘이 깃든 강력한 마력의 바지
	//한을 품은 망령들의 힘이 깃든 저주의 바지
	//고대왕국의 수호자들이 입었다는 바지
	//지옥의 문지기 켈베로스의 가죽으로 만들어진 바지
	//죽은 자를 다스리는 신 아누비스의 바지

	TEXT_ITEMDESC_GREAVES = TEXT_ITEMDESC_PANTS + TOTAL_PANTS,

	//청동으로 만들어진 가벼운 신발
	//가죽을 덧대어 방어력을 향상시킨 신발
	//쇠사슬을 엮어 만들어진 신발
	//왕국의 기사들이 애용하는 신발
	//냉기의 마력이 깃든 마법의 신발
	//강철보다 단단한 얼음으로 감싸인 신발
	//정교하고 튼튼하게 설계된 금속 신발
	//난장이들의 기술력으로 만들어진 신비한 신발
	//거대한 몬스터 빅풋의 가죽으로 만들어진 신발
	//철벽의 괴물, 골렘의 파편으로 만들어진 신발
	//고대의 마력이 깃든 마법신발
	//마계의 악마가 신는다는 저주받은 신발
	//그 소리를 들은 자에겐 죽음이 찾아온다고 한다
	//용을 잡은 전사가 사용했다는 신발
	//마룡의 발을 모방하여 만들어진 고대의 그리브
	//대지의 창조신 가이아의 힘이 깃든 신발

	TEXT_ITEMDESC_SHOES = TEXT_ITEMDESC_GREAVES + TOTAL_GREAVES,

	//카우보이들이 애용하는 신발
	//양털로 만들어 따뜻한 신발
	//여행을 위해 튼튼하게 만들어진 신발
	//혹독한 상황에서도 빠르게 움직일 수 있게 고안된 신발
	//끝없는 어둠을 걷는 자의 신발
	//마녀의 저주가 담긴 신발
	//귀부인을 위해 만들어진 품위있는 신발
	//왕족을 위해 최고의 장인이 만든 신발
	//죽음을 먹어치우는 리치의 신발
	//죽은 자의 영혼을 엮어 만든 신발
	//빛을 굴절시키는 힘으로 적을 혼란시키는 신발
	//적에게 환영을 보게 하여 전의를 잃게하는 신발
	//착용한 자에게 중력을 다루는 힘이 주어진다는 신발
	//생명과 운명을 관리하는 신의 신발
	//변질된 시간을 걸어갈 수 있다고 전해지는 신발
	//엇갈린 운명을 바꿀 수 있다는 전설의 신발

	TEXT_ITEMDESC_BOOTS = TEXT_ITEMDESC_SHOES + TOTAL_SHOES,

	//간편하면서 실용적인 신발
	//닥치는대로 먹어치우는 괴물의 가죽으로 만든 신발
	//번개의 힘이 깃든 마수의 가죽으로 만든 신발
	//벼락이 내려친 땅에서 자란 나무를 깍아 장식한 신발
	//위대한 장인이 고대의 정원사에게 바친 신발
	//지성을 가진 거대한 나무 토렌트의 뿌리로 만든 신발
	//바다를 여행하는 숙련된 선원들의 신발
	//일곱개의 바다를 누빈 위대한 선장의 신발
	//지옥의 사자들이 사용한다는 신발
	//지옥을 다스리는 다섯 악마의 뼈로 만든 신발
	//정령들의 힘이 깃든 마법의 신발
	//바람의 힘으로 걷는 속도를 빠르게 해주는 신발
	//폭풍을 부르는 힘이 깃들었다는 전설의 신발
	//착용한 자의 몸을 가볍게 해주는 신발
	//구름을 밟을 수 있을 정도로 몸을 가볍게 해주는 신발
	//천상의 길을 들어갈 수 있다고 전해지는 전설의 신발

	TEXT_ITEMDESC_NECK = TEXT_ITEMDESC_BOOTS + TOTAL_BOOTS,

	//나라를 위해 목숨을 희생한 전사의 유품
	//강렬한 빛에 흽싸인 브로치
	//번뜩이는 광택의 팔찌
	//무엇이든 뚫어버리는 황금 바늘
	//전사의 힘을 강화시키는 팔찌
	//아름다운 음으로 사람의 마음으로 현혹시키는 피리
	//지옥의 노래를 연주하는 하프
	//인어가 만든 아름다운 머리핀
	//찬트의 가호가 깃든 펜던트
	//보는 자의 미래를 비춘다는 거울
	//붉은 모래가 담긴 마법의 모래 시계
	//지옥을 보여주는 악마의 만화경
	//신의 가호가 깃든 브로치
	//대지의 생명이 숨쉬는 구슬
	//착용한 자의 기력을 높혀주는 목걸이
	//천사의 숨결로 만들어진 귀중한 목걸이
	//전설의 마법사가 창조한 신비한 힘을 가진 돌
	//연주한 자의 꿈을 이루어 준다는 오카리나
	//강력한 마력을 찾아내는 나침반
	//잊혀진 기억을 되돌리는 오르골
	//반짝이는 물건을 좋아하는 난쟁이의 공
	//무엇이든 집어 삼키는 저주받은 항아리
	//정성스럽게 재봉된 귀여운 인형
	//착용하면 기분이 좋아지는 브로치
	//마녀들이 장난삼아 만든 주술이 걸린 악보
	//왕에게 하사받은 고급 시계
	//악마의 뿔로 만든 피리
	//회복의 기원이 깃든 마법의 달걀
	TEXT_ITEMDESC_RING = TEXT_ITEMDESC_NECK + TOTAL_NECK,
	//죽음을 다스리는 사신의 반지%s
	//진실과 거짓을 가려내는 통찰력을 부여하는 반지%s
	//시간의 흐름이 응축되어있는 반지%s
	//억압의 힘을 해방시키는 반지%s
	//영롱한 빛의 고급 산호로 만든 반지%s
	//죽음의 골짜기에서 살아온 영웅의 반지%s
	//파괴를 통해 생명을 만들어내는 반지%s
	//육체의 한계를 뛰어넘는 힘을 해방시키는 반지%s
	//강철 골렘의 파편으로 만들어진 반지%s
	//광대의 익살스러움이 묻어 있는 반지%s
	//죽은 자의 원한을 담은 반지%s
	//죽음도 불사하는 신념을 가진 자의 반지%s
	//곰을 뛰어넘는 힘을 봉인한 반지%s
	//전쟁을 승리로 이끈 장군에게 주어지는 반지%s
	//인간의 힘을 초월하기를 원하는 검사의 반지%s
	//시간과 공간의 사이를 찾아낸다고 전해지는 반지%s
	//나라를 재건 시킨 영웅을 기리기 위한 반지%s
	//행운의 여신이 만든 반지, 착용한 자에게 행운이 깃든다%s
	TEXT_ITEMDESC_GEM = TEXT_ITEMDESC_RING + TOTAL_RING,
	//태양의 빛과 가장 가까운 붉은색을 띠는 보석
	//연마하면 여섯 줄의 별빛을 띠는 보석
	//신과 인간을 의미하는 고귀한 보라색을 띠는 보석
	//색이 없어 순수함을 상징하는 보석
	//진한 어둠이 감도는 바다의 보석
	//선명한 녹색 빛을 발하는 아름다운 보석
	TEXT_ITEMDESC_WASTES = TEXT_ITEMDESC_GEM + TOTAL_GEM,
	//사용하면 가까운 마을로 이동한다.
	//HP를 50 회복
	//HP를 200 회복
	//HP를 400 회복
	//MP를 30 회복
	//MP를 100 회복
	//MP를 300 회복
	//HP, MP를 모두 대량 회복
	//슬로우 상태를 치료
	//블라인드상태를 치료
	//중독 상태를 치료
	//기절 상태를 치료
	//저주 상태를 치료
	//적에 화염속성 소량 데미지
	//적에 냉기속성 소량 데미지
	//적에 번개속성 소량 데미지
	//적에 신성속성 소량 데미지
	//적에 어둠속성 소량 데미지
	//적에 화염속성 중간 데미지
	//적에 냉기속성 중간 데미지
	//적에 번개속성 중간 데미지
	//적에 신성속성 중간 데미지
	//적에 어둠속성 중간 데미지
	//투기장/던전에서 사용되며 공격력이 30% 상승합니다.
	//투기장/던전에서 사용되며 방어력이 30% 상승합니다.
	//투기장/던전에서 사용되며 상태 이상에 걸리지 않습니다.
	//투기장/던전에서 사용되며 스킬 공격력이 50% 상승합니다.
	TEXT_ITEMDESC_IRON = TEXT_ITEMDESC_WASTES + TOTAL_WASTE,
	//철을 함유하고 있는 광석
	//회백색의 광택을 가진 은 덩어리
	//뇌신 토르의 망치를 만들었다고 전해지는 금속
	//표면에 소용돌이 물결 무늬를 띠고 있는 아름다운 금속
	//마법을 무력화시키는 힘을 가진 신비한 금속
	//무게가 느껴지지 않을 정도로 가볍다고 전해지는 광석
	//영롱한 무지개빛을 띄며 매우 단단한 광석
	//영원히 녹슬지 않으며 깨지지 않는다는 전설의 광석
	TEXT_ITEMDESC_LEAHTER = TEXT_ITEMDESC_IRON + TOTAL_IRON,
	//가볍고 튼튼한 가죽
	//검으로 내리쳐도 깨지지 않는 비늘
	//무쇠처럼 딱딱하고 튼튼한 가죽
	//일그러진 형태의 거대한 비늘
	//100일간 달빛을 받아 세공한 가죽
	//100년간 썩지 않는 바실리스크의 비늘
	//지옥의 입구를 지키는 사자의 가죽
	//화염을 삼키는 용의 비늘
	TEXT_ITEMDESC_CLOTH = TEXT_ITEMDESC_LEAHTER + TOTAL_LEATHER,
	//감색 빛을 발하는 실타래
	//반짝이는 거미줄로 만든 가볍고 질긴 옷감
	//가볍고 빛깔이 우아하며 촉감이 부드럽다.
	//바닥 없는 골짜기의 어둠으로 만든 실타래
	//어둠 속에서 은하수처럼 빛나는 특수한 옷감
	//유적에서 발견되는 고대인이 만든 옷감
	//차원을 연결해주는 힘이 있는 실타래
	//룬문자가 새겨져 마법의 힘을 발하는 옷감
	TEXT_ITEMDESC_WOOD = TEXT_ITEMDESC_CLOTH + TOTAL_CLOTH,
	//악마를 쫓아낸다고 전해지는 나무 가지
	//새벽 서리에 의해 얼어 단단해진 나무 가지
	//맨드레이의 비명소리를 들으면 죽는다고 전해진다.
	//거인의 형상을 한 나무의 뿌리
	//생명을 소멸시키는 힘을 가진 나무 뿌리
	//태초의 기억을 간직한 나무 가지
	//지옥의 불꽃을 먹고 자라는 나무의 뿌리
	//생명의 근원이라 일컬어지는 나무의 뿌리
	TEXT_ITEMDESC_ESSENCE = TEXT_ITEMDESC_WOOD + TOTAL_WOOD,
	//뾰족한 가시가 솟아난 단단한 달팽이 껍질//TEXT_ITEMDESC_ESSENCE
	//악취가 심하지만 매우 단단한 넝쿨
	//깊은 어둠을 주시하는 눈동자
	//어둠 속에서 붉은 빛을 발하는 신비한 해골
	//바다 깊은 곳에 사는 사하긴들의 비늘
	//붉은 빛과 푸른 빛으로 빛나는 심장
	//오랜 세월 사냥꾼들에게 전해지는 지혜를 써넣은 돌
	//야생 멧돼지의 두꺼운 어금니
	//부정한 것을 제거한 불의 정기를 모아놓은 물
	//영원한 삶을 기원하는 깃털
	//태풍을 견디어낸 돌을 조각하여 만든 상
	//푸른 빛을 띄는 순수한 얼음 결정
	//민담속에 등장하는 얼음의 눈물
	//천둥의 기가 감도는 마법의 가루
	//번개의 문양의 돌로 만들어진 쐐기
	//번개의 근원이 되는 힘을 담아놓은 핵
	//마시면 모든 병을 고칠 수 있다고 하는 요정의 눈물
	//따사로운 빛이 감도는 특수 염료
	//아델라인 기사 시험을 통과한 자에게 주어지는 증표
	//끈적하지만 갑옷이 맞닿는 부분을 부드럽게 해주는 윤활액
	//영혼의 정신을 흐리게 하는 돌
	//달의 돌이라고 불리우며 강철보다 단단한 돌
	//사신이 죽은 자의 영혼을 육체에서 떼어 갈 때 남은 꼬리
	//황색으로 빛나는 아름다운 십자가
	//지옥의 보석으로 만든 아름다운 구슬
	//감미로운 향기로 사람을 유혹하는
	//오랜 세월의 지혜가 담긴 뿔
	//소원을 이루어준다고 전해지는 전설의 수정
	//찬란한 별빛을 담은 날개
	//무한을 뜻하는 신비한 고리
	//영원히 빛을 잃지 않는 신비한 상
	//노스 유적에서 출토된 특수한 힘의 돌
	//금지된 힘에 의해 오염된 저주받은 돌
	//죽은 자의 원혼을 위로하는 반딧불
	//바다를 지배하는 포세이돈의 삼지창
	//무엇보다 단단하고 무거워 파괴할 수 없는 돌
	//지하 깊은 곳의 뜨거운 불길이 굳어 만들어진 화성암
	//불길조차 얼리는 눈보라에 의해 얼어붙은 등껍질
	//모든 것을 파괴하는 번개를 담은 유리병
	//램프에서 뿜어져 나오는 빛은 보는 이의 눈을 멀게 한다.
	//끊임없이 힘을 내뿜는 신비한 마석
	//죽음의 강에 정박한 유령선의 닻
	//세상의 모든 이치를 담은 과일
	//바하무트의 뜨거운 숨결을 담은 보석
	//억울하게 죽은 자의 영혼을 가두어 두는 보석
	TEXT_ITEMDESC_RECIPE = TEXT_ITEMDESC_ESSENCE + TOTAL_ESSENCE,//의 제작을 위한 조합서
	TEXT_ITEMDESC_NETITEM,
	//스페셜상점에서 유료아이템을 |k무료|s로 구매할 수 있는 쿠폰.
	//투기장/던전 이용시간에 상관없이 투기장/던전에 입장할 수 있습니다
	//강화비용만 있다면 어디에서나 장비를 강화할 수 있습니다.
	//강화에 실패해도 장비의 강화단계를 유지해줍니다.
	//재료,비용이 없어도 조합서를 통해 어디에서나 장비를 조합합니다.
	//장비의 소켓에 박힌 모든 보석을 빼내어 인벤토리에 되돌립니다.
	//장비의 소켓갯수를 재배치합니다.(주의:장착된 보석은 사라짐)
	//현재 진행 중인 주인공을 다른 캐릭터로 변경합니다.
	//게임오버시 부활(전체상태 회복)
	//최대 전설등급의 무기가 랜덤하게 출현
	//최대 영웅등급의 무기가 랜덤하게 출현
	//최대 영웅등급의 무기가 랜덤하게 출현
	//최대 전설등급의 방어구가 랜덤하게 출현
	//최대 영웅등급의 방어구가 랜덤하게 출현
	//최대 영웅등급의 방어구가 랜덤하게 출현
	//최대 영웅등급의 악세사리가 랜덤하게 출현
	//최대 영웅등급의 악세사리가 랜덤하게 출현
	//최대 영웅등급의 악세사리가 랜덤하게 출현
	//무엇이 나올지 모를 아이템상자
	//최대 영웅등급의 보석이 랜덤하게 출현
	//인벤토리의 최대치를 12개 늘림
	//창고의 최대치를 8개 늘림
	//현재 분배된 AP를 모두 초기화
	//현재 분배된 SP를 모두 초기화
	//10000골+부활약X3+별의씨앗X20+강화석X2+보호석X2+조합석X2
	//1000000골드+강화석X3+보호석X3
	//강화석X3+보호석X3+분해석X3+소켓석X3+조합석X3
	//강화의비약X17+인내의비약X17+치유의비약X17+마법의비약X17
	//고급무기상자X1+고급방어구상자X1+고급악세사리상자X1
	//사용시 1부터 |e%d|s레벨만큼의 경험치를 획득한다.
	TEXT_ITEMDESC_GOLD = TEXT_ITEMDESC_NETITEM + TOTAL_NETITEM,//황금으로 만들어진 화폐
	TEXT_ITEMDESC_KEY,
	//금단의 계곡 열쇠. 맥스가 몰래 복제해 둔 모양이다.
	//어둠의 파편으로 만들어진 열쇠. 불길한 기운이 느껴진다.
	//푸른 비늘로 아름답게 장식된 열쇠.
	//차원의 문으로 가는 길목의 열쇠.
	//유구한 빙원의 문을 여는 열쇠. 얼음으로 만들어져있다.
	//뇌전의 공방의 문을 여는 열쇠. 약한 전류가 흐르고 있다.
	//황혼의 성역의 문을 여는 열쇠. 빛을 뿜어내고 있다.
	//아델라인 성의 지하도의 열쇠. 많이 더럽혀져 있다.
	//골렘의 협곡의 문을 여는 열쇠. 고급스러운 석재 재질이다.
	//칠흑의 심연의 문을 여는 열쇠. 검은 빛을 뿜는다.
	//드래곤의 무덤의 문을 여는 열쇠. 뼈로 만들어진 듯 하다.
	//금지된 땅으로 들어가는 문의 열쇠. 금지된 땅이란?
	//마왕성의 문을 여는 열쇠.
	//루이제가 로빈에게 선물한 아틀란티스 왕가의 펜던트.
	//두꺼운 가죽으로 만들어진 허리띠. 사자 동상의 바람을 돌파
	//보라색 보석의 목걸이. 총 그려진 블록 위에 오르면 발판생성
	//거인족의 힘이 깃든 장갑. 금이 간 바위를 파괴
	TEXT_ITEMDESC_STATUE = TEXT_ITEMDESC_KEY + TOTAL_KEYITEM,
	//대쉬 및 먼거리 점프 가능(조작:좌,우 이동키 연속입력
	//점프 중 하단공격으로 블록 파괴(조작:높이 점프 후 아래)
	//방향 표시가 된 블록을 표시된 방향으로 밀 수 있다.
	//수중에서 호흡이 가능해지며 수중 이동속도도 빨라진다.
	//용암 위를 걸을 수 있게 되며 용암기둥을 솟아오르게 한다.
	//썰매를 밀어 올라탈 수 있게 된다. 썰매로 얼음장벽 파괴
	//얼음의 미끄러짐을 방지하며, 물 위를 걸을 수 있다.
	//자기장을 발생시켜 리프트 블록에 달라붙을 수 있게 된다.
	//보이지 않는 발판을 볼 수 있고, 태양의 블록 파괴가능
	//2단 점프를 할 수 있게 된다.(조작:점프 중 점프)
	//뾰족한 스파이크에 데미지를 입지않게 된다.
	//각지의 WARP 블록 위로 이동하는 순간이동 마법을 사용한다.
	//점프 후 천천히 활강(조작:점프버튼 누르고 있기)
	//작은 다람쥐로 변신하여 좁은 통로를 지나갈 수 있다.
	//수직으로 높이 점프(조작: 발판이 아닌 땅에서 아래 위)
	//공기로 몸을 감싸 우주공간에서 숨을 쉴 수 있게 된다.

	TEXT_ITEMDESC_HEART = TEXT_ITEMDESC_STATUE + TOTAL_STATUE,
	TEXT_ITEMDESC_MEDAL,
	TEXT_ITEMDESC_STAR,
	TEXT_ITEMDESC_HAMMER,
	TEXT_ITEMDESC_BOX,

	TEXT_SETNAME_START = TEXT_ITEMDESC_BOX + TOTAL_BOX,//세트 이름
	//견습 기사
	//왕가의 수호자
	//시공의 균열
	//푸른매의 눈
	//마도총술사
	//태양의 탄흔
	//현상금 사냥꾼
	//소울 헌터
	//뫼비우스의 띠
	//무사수행
	//떠돌이 총잡이
	//사냥꾼
	//도전자
	//헌터
	//용병
	//심판의 손
	//캐러밴 상인
	//단풍염색
	//잊혀진 영웅
	//몽환의 감시자
	//예의범절
	//브론즈 나이트
	//음유시인
	//불멸의 수호자
	//무한의 마력
	//해방의 군주
	//사멸의 추적자
	//세공사의 유품
	//위대한 도적
	//피크닉
	//위대한 유산
	//잔혹한 투우사
	//사신의 저주
	//왕실 기사
	//황야의 무법자
	//원한의 해골기사
	//보물섬
	//지옥의 묵시록
	//사악한 약탈자
	//베가본드
	//정령의 가호
	//정예 스나이퍼
	//혼돈의 제단
	//가장무도회
	//천공의 날개
	//태양의 귀족
	//스마일 라이더
	//승자의 영광
	//이국의 모험가
	//길로틴
	//고대의 유물
	//원탁의 기사
	//드래곤의 무덤
	//신의 사자
	//기사의 서약//여기부터 robin
	//바룩의 방패
	//죽음의 그림자
	//총명의 나무
	//하늘의 심판
	//아래스의 의지
	//악마의 유혹
	//몰렉의 제단
	//전장의 나팔//diana
	//여신의 신발
	//망각의 눈물
	//지혜의 샘물
	//신들의 황혼
	//아테네의 축복
	//마녀의 입술
	//레판의 별
	//전사의 노래//max
	//마드룩의 갑옷
	//사바의 감시자
	//명철의 바위
	//영웅의 분노
	//파리스의 전의
	//지옥의 메아리
	//바알의 제물

	TEXT_NORMAL = TEXT_SETNAME_START + TOTALSET,//일반
	TEXT_SUPERIOR,//고급
	TEXT_RARE,//희귀
	TEXT_SET,//세트
	TEXT_EPIC,//영웅
	TEXT_LEGEND,//전설

	TEXT_OPTION_PREFIX,

	TEXT_OPTION_SUFFIX = TEXT_OPTION_PREFIX + TOTALPREFIXTEXT * 3,

	TEXT_PREFIX_DESC = TEXT_OPTION_SUFFIX + TOTALSUFFIXTEXT * 3,
	//"|j공격력 |i+%d%%//",			//PREFIX_WEAPON_DMG
	//"|j검 공격력 |i+%d%%//",		//PREFIX_SWORD_DMG
	//"|j총기 공격력 |i+%d%%//",	//PREFIX_GUN_DMG
	//"|j부메랑 공격력 |i+%d%%//",	//PREFIX_BOOMERANG_DMG
	//"|j크리티컬 확률 |i+%d%%//",	//PREFIX_CRITICAL
	//"|j관통공격 확률 |i+%d%%//",	//PREFIX_PIERCE
	//"|j추가타격 확률 |i+%d%%//",	//PREFIX_EXTRA
	//"|jSTR |i+%d//",				//PREFIX_STR
	//"|jAGI |i+%d//",				//PREFIX_AGI
	//"|jVIT |i+%d//",				//PREFIX_VIT
	//"|jINT |i+%d//",				//PREFIX_INT
	//"|j스킬 공격력 |i+%d%%//",	//PREFIX_SKILLDMG
	//"|j적 방어도 감소 |i-%d//",	//PREFIX_DEFENSE
	//"|jqk |i+%d%%//",			//PREFIX_ARMOR
	//"|j물리피해 감소 |i+%d%%//",	//PREFIX_ABSORB
	//"|j화염저항력 |i+%d//",		//PREFIX_FIRE_REGIST
	//"|j냉기저항력 |i+%d//",		//PREFIX_FROST_REGIST
	//"|j번개저항력 |i+%d//",		//PREFIX_THUNDER_REGIST
	//"|j신성저항력 |i+%d//",		//PREFIX_HOLY_REGIST
	//"|j암흑저항력 |i+%d//",		//PREFIX_DARK_REGIST
	//"|j행운 증가 |i+%d%%//",		//PREFIX_LUCK
	//"|j골드 획득 |i+%d%%//",		//PREFIX_GOLD
	//"|j경험치 획득 |i+%d%%//",	//PREFIX_EXP
	//"|jHP 10초당 |i%d |j회복//",	//PREFIX_HPRESTORE
	//"|jMP 10초당 |i%d |j회복//",	//PREFIX_MPRESTORE
	//"|j물약류 효과 |i+%d%%//",	//PREFIX_POTION
	//"|j강화스킬 지속시간 |i+%d%%//",//PREFIX_BUFF
	//"//",							//PREFIX_MAGIC_REGIST
	//"//",							//PREFIX_RESERVED2
	//"//",							//PREFIX_RESERVED3

	//"|j공격력 추가 |i+%d//",		//SUFFIX_WEAPON_DMG
	//"|j검 공격력 추가 |i+%d//",	//SUFFIX_SWORD_DMG
	//"|j총기 공격력 추가 |i+%d//",	//SUFFIX_GUN_DMG
	//"|j부메랑 공격력 추가 |i+%d%%//",//SUFFIX_BOOMERANG_DMG
	//"|j화염속성 공격 확률 |i+%d%%//",//SUFFIX_FIRE_ATTACK
	//"|j냉기속성 공격 확률 |i+%d%%//",//SUFFIX_FROST_ATTACK
	//"|j번개속성 공격 확률 |i+%d%%//",//SUFFIX_THUNDER_ATTACK
	//"|j신성속성 공격 확률 |i+%d%%//",//SUFFIX_HOLY_ATTACK
	//"|j암흑속성 공격 확률 |i+%d%%//",//SUFFIX_DARK_ATTACK
	//"|j명중률 |i+%d%%//",			//SUFFIX_HIT
	//"|j방어도 무시 공격 |i+%d%%//",//SUFFIX_IGNORE
	//"|j스킬 재사용 시간 |i-%d%%//",//SUFFIX_DELAY
	//"|j크리티컬 피해량 |i+%d%%//",//SUFFIX_CRITICAL
	//"|j회피 |i+%d%%//",			//SUFFIX_EVASION
	//"|j모든 능력치 |i+%d//",		//SUFFIX_STAT
	//"|jHP |i+%d//",				//SUFFIX_HP
	//"|jMP |i+%d//",				//SUFFIX_MP
	//"|j공격시 HP 흡수 |i+%d%%//",	//SUFFIX_HPDRAIN
	//"|j공격시 MP 흡수 |i+%d%%//",	//SUFFIX_MPDRAIN
	//"|j모든 저항력 |i+%d//",		//SUFFIX_ALLREGIST
	//"|j방어력 추가 |i+%d//",		//SUFFIX_ARMOR
	//"|j행운 증가 |i+%d%%//",		//SUFFIX_LUCK
	//"|j골드 획득 |i+%d%%//",		//SUFFIX_GOLD
	//"|j경험치 획득 |i+%d%%//",	//SUFFIX_EXP
	//"|j요구치 감소 |i-%d%%//",	//SUFFIX_REQUIRE
	//"|j상태이상 지속시간 |i-%d%%//",	//SUFFIX_DEBUF
	//"|j기절공격 확률 |i+%d%%//",	//SUFFIX_STUN
	//"|j모든 스킬레벨 |i+%d//",	//SUFFIX_SKILL
	//"//",							//SUFFIX_RESERVED1
	//"//",							//SUFFIX_RESERVED2
	//"//",							//SUFFIX_RESERVED3

	//"|j적 재생성 시간 감소//",	//SUFFIX_ENEMYREGEN
	//"|j독 면역//",				//SUFFIX_POISON_IMMUNE
	//"|j블라인드 면역//",			//SUFFIX_BLIND_IMMUNE
	//"|j슬로우 면역//",			//SUFFIX_SLOW_IMMUNE
	//"|j저주 면역//",				//SUFFIX_CURSE_IMMUNE
	//"|j기절 면역//",				//SUFFIX_STUN_IMMUNE
	//"|j착용시 저주(제거 불가)//",	//SUFFIX_ALWAYSCURSE
	//"|jHP 10초당 |i%d |j감소//",	//SUFFIX_HPDECREASE
	//"|jDEF 감소 |i-%d//",			//SUFFIX_MINUSARMOR
	//"|j공격시 HP 감소 |i-%d%%//",	//SUFFIX_MINUSDRAIN
	//"|jHP 감소 |i-%d//",			//SUFFIX_MINUSHP
	//"|jMP 감소 |i-%d//",			//SUFFIX_MINUSMP
	//"|j회피율 감소 |i-%d%%//",	//SUFFIX_MINUSEVASION
	//"|j명중률 감소 |i-%d%%//",	//SUFFIX_MINUSHIT
	//"|j모든 저항력 감소 |i-%d//",	//SUFFIX_MINUSREGIST
	//"|jINT |i-%d//",				//SUFFIX_MINUSINT
	//"|jSTR |i-%d//",				//SUFFIX_MINUSSTR
	//"|jAGI |i-%d//",				//SUFFIX_MINUSAGI
	//"|j상태이상 지속시간 |i+%d%%//",	//SUFFIX_PLUSDEBUF
	//"|j모든 스킬레벨 |i-%d//",	//SUFFIX_MINUSSKILL
	//"|j스킬 공격력 |i-%d%%//",	//SUFFIX_MINUSSKILLDMG

	TEXT_RING_OPTION = TEXT_PREFIX_DESC + TOTALITEMOPTION,
	//|e사용시 |i%d%%|j확률로 저주 제거
	//|e사용시 |i%d%%|j확률로 블라인드 제거
	//|e사용시 |i%d%%|j확률로 기절 제거
	//|e사용시 |i%d%%|j확률로 슬로우 제거
	//|e사용시 |i%d%%|j확률로 독 제거
	//|e사용시 |jHP |i%d |j회복
	//|e사용시 |jMP |i%d |j회복
	//|e사용시 |j공격력 |i%d%%|j추가
	//|e사용시 |jDEF |i%d 증가
	//|e사용시 |j회피 |i%d%%|j증가
	//|e사용시 |j관통공격 확률 |i%d%%|j증가
	//|e사용시 |j명중률 |i%d%%|j증가
	//|e사용시 |j기절공격 확률 |i%d%%|j증가
	//|e사용시 |j크리티컬 확률 |i%d%%|j증가
	//|e사용시 |j크리티컬 피해량 |i%d%%|j증가
	//|e사용시 |j적 방어도 감소 -|i%d
	//|e사용시 |j스킬 재사용 시간 초기화
	//|e사용시 |j경험치 획득 |i%d%%|j증가
	TEXT_RING_OPTION_EFFECT = TEXT_RING_OPTION + TOTAL_RING,
	TEXT_COOLTIME = TEXT_RING_OPTION_EFFECT + TOTAL_RING,//(|j쿨타임:|i%d|j초)

	TEXT_PREFIX_DESC_SEP,

	TEXT_RING_OPTION_EFFECT_SEP = TEXT_PREFIX_DESC_SEP + TOTALITEMOPTION * 2,
	TEXT_PREFIX_DESC_COMPARE = TEXT_RING_OPTION_EFFECT_SEP + TOTAL_RING * 2,//강화재료
	TEXT_ENCHANT_STUFF = TEXT_PREFIX_DESC_COMPARE + TOTALITEMOPTION,
	TEXT_ENCHANT_PROB,//강화성공확률
	TEXT_RECIPE_STUFF,//제작재료

	TEXT_IMGNAME_START,
	//"logo",
	//"touch",
	//"t",
	//"c",
	//"f",
	//"i0",
	//"i1",
	//"i2",
	//"i3",
	//"i4",
	//"i5",
	//"face0",
	//"face1",
	//"face2",
	//"face3",
	//"face4",
	//"face5",
	//"face6",
	//"face7",
	//"face8",
	//"face9",
	//"face10",
	//"face11",
	//"char0",
	//"char1",
	//"char2",
	//"sIcon",
	//"ef",
	//"attr",
	//"shine",
	//"house",
	//"water",
	//"gate",
	//"cc",
	//"we",
	//"hit",
	//"door",
	//"w0_0",
	//"h0_0",
	//"a0",
	//"p0",
	//"d0",
	//"l0",
	//"w1_0",
	//"h1_0",
	//"a1",
	//"p1",
	//"d1",
	//"l1",
	//"w2_0",
	//"h2_0",
	//"a2",
	//"p0",
	//"d2",
	//"l2",
	//"w0_0",
	//"h0_0",
	//"a0",
	//"p0",
	//"d0",
	//"l0",
	//"t0",
	//"t1",
	//"t2",
	//"t3",
	//"t4",
	//"t5",
	//"t6",
	//"t7",
	//"t8",
	//"t9",
	//"t10",
	//"t11",
	//"t12",
	//"t13",
	//"t14",
	//"t15",
	//"t16",
	//"t17",
	//"t18",
	//"b0",
	//"b1",
	//"b2",
	//"b3",
	//"b4",
	//"b5",
	//"b6",
	//"b7",
	//"b8",
	//"b9",
	//"b10",
	//"b11",
	//"b12",
	//"b13",
	//"b14",
	//"b15",
	//"b16",
	//"b17",
	//"b18",
	//"bg0",
	//"bg1",
	//"bg2",
	//"bg3",
	//"bg4",
	//"bg5",
	//"bg6",
	//"bg7",
	//"bg8",
	//"bg9",
	//"bg10",
	//"bg11",
	//"bg12",
	//"bg13",
	//"bg14",
	//"bg15",
	//"bg16",
	//"bg17",
	//"bg18",
	//"c0",
	//"c1",
	//"c2",
	//"c3",
	//"c4",
	//"c5",
	//"c6",
	//"c7",
	//"c8",
	//"c9",
	//"c10",
	//"c11",
	//"c12",
	//"c13",
	//"c14",
	//"c15",
	//"c16",
	//"c17",
	//"c18",
	//"c19",
	//"c20",
	//"c21",
	//"c22",
	//"c23",
	//"c24",
	//"c25",
	//"c26",
	//"c27",
	//"c28",
	//"c29",
	//"c30",
	//"c31",
	//"c32",
	//"c33",
	//"c34",
	//"c35",
	//"c36",
	//"c37",
	//"c38",
	//"c39",
	//"c40",
	//"c41",
	//"c42",
	//"c43",
	//"c44",
	//"c45",
	//"c46",
	//"c47",
	//"c48",
	//"c49",
	//"c50",
	//"c51",
	//"c52",
	//"c53",
	//"c54",
	//"c55",
	//"c56",
	//"c57",
	//"c58",
	//"c59",
	//"c60",
	//"c61",
	//"c62",
	//"c63",
	//"c64",
	//"c65",
	//"c66",
	//"c67",
	//"c68",
	//"c69",
	//"c70",
	//"c71",
	//"c72",
	//"c73",
	//"c74",
	//"c75",
	//"c76",
	//"c77",
	//"c78",
	//"c79",
	//"c80",
	//"c81",
	//"c82",
	//"c83",
	//"c84",
	//"c85",
	//"c86",
	//"c87",
	//"c88",
	//"c89",
	//"c90",
	//"c91",
	//"c92",
	//"c93",
	//"c94",
	//"c95",
	//"c96",
	//"c97",
	//"c98",
	//"c99",
	//"c100",
	//"c101",
	//"c102",
	//"c103",
	//"c104",
	//"c105",
	//"c106",
	//"c107",
	//"c108",
	//"c109",
	//"c110",
	//"c111",
	//"c112",
	//"c113",
	//"c114",
	//"c115",
	//"c116",
	//"c117",
	//"c118",
	//"c119",
	//"c120",
	//"c121",
	//"c122",
	//"w0_0",
	//"w0_1",
	//"w0_2",
	//"w0_3",
	//"w0_4",
	//"w0_5",
	//"w0_6",
	//"w0_7",
	//"w1_0",
	//"w1_1",
	//"w1_2",
	//"w1_3",
	//"w1_4",
	//"w1_5",
	//"w1_6",
	//"w1_7",
	//"w2_0",
	//"w2_1",
	//"w2_2",
	//"w2_3",
	//"w2_4",
	//"w2_5",
	//"w2_6",
	//"w2_7",
	//"h0_0",
	//"h0_1",
	//"h0_2",
	//"h0_3",
	//"h0_4",
	//"h0_5",
	//"h0_6",
	//"h0_7",
	//"h1_0",
	//"h1_1",
	//"h1_2",
	//"h1_3",
	//"h1_4",
	//"h1_5",
	//"h1_6",
	//"h1_7",
	//"h2_0",
	//"h2_1",
	//"h2_2",
	//"h2_3",
	//"h2_4",
	//"h2_5",
	//"h2_6",
	//"h2_7",
	//"h2_8",

	//"a0_0",
	//"a0_1",
	//"a0_2",
	//"a0_3",
	//"a0_4",
	//"a0_5",
	//"a0_6",
	//"a0_7",
	//"a0_8",
	//"a1_0",
	//"a1_1",
	//"a1_2",
	//"a1_3",
	//"a1_4",
	//"a1_5",
	//"a1_6",
	//"a1_7",
	//"a1_8",
	//"a2_0",
	//"a2_1",
	//"a2_2",
	//"a2_3",
	//"a2_4",
	//"a2_5",
	//"a2_6",
	//"a2_7",
	//"a2_8",

	//"p0_0",
	//"p0_1",
	//"p0_2",
	//"p0_3",
	//"p0_4",
	//"p0_5",
	//"p0_6",
	//"p0_7",
	//"p0_8",
	//"p1_0",
	//"p1_1",
	//"p1_2",
	//"p1_3",
	//"p1_4",
	//"p1_5",
	//"p1_6",
	//"p1_7",
	//"p1_8",
	//"p2_0",
	//"p2_1",
	//"p2_2",
	//"p2_3",
	//"p2_4",
	//"p2_5",
	//"p2_6",
	//"p2_7",
	//"p2_8",

	//"d0_0",
	//"d0_1",
	//"d0_2",
	//"d0_3",
	//"d0_4",
	//"d0_5",
	//"d0_6",
	//"d0_7",
	//"d0_8",
	//"d1_0",
	//"d1_1",
	//"d1_2",
	//"d1_3",
	//"d1_4",
	//"d1_5",
	//"d1_6",
	//"d1_7",
	//"d1_8",
	//"d2_0",
	//"d2_1",
	//"d2_2",
	//"d2_3",
	//"d2_4",
	//"d2_5",
	//"d2_6",
	//"d2_7",
	//"d2_8",

	//"l0_0",
	//"l0_1",
	//"l0_2",
	//"l0_3",
	//"l0_4",
	//"l0_5",
	//"l0_6",
	//"l0_7",
	//"l0_8",
	//"l1_0",
	//"l1_1",
	//"l1_2",
	//"l1_3",
	//"l1_4",
	//"l1_5",
	//"l1_6",
	//"l1_7",
	//"l1_8",
	//"l2_0",
	//"l2_1",
	//"l2_2",
	//"l2_3",
	//"l2_4",
	//"l2_5",
	//"l2_6",
	//"l2_7",
	//"l2_8",

	//"etc",
	//"awards",
	//"window",
	//"splash",

	//"t0",
	//"bg0",
	//"dot",

	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",

	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",

	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",

	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",

	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",
	//"f",

	//"profile0",
	//"profile1",
	//"profile2",
	//"profile3",
	//"profile4",
	//"profile5",
	//"profile6",
	//"profile7",
	//"profile8",
	//"profile9",

	TEXT_GAMEMENU_SINGLEINVEN = TEXT_IMGNAME_START + TOTALIMG,//인벤토리

	TEXT_NEWGAME,//"새로하기"
	TEXT_CONTINUE,//"이어하기"

	TEXT_NEWS,//"뉴스"
	TEXT_RANKING,//"랭킹"
	TEXT_MAIL,//"메일"
	TEXT_SETTING,//"설정

	TEXT_BGM,//"음악"
	TEXT_SE,//"효과음"
	TEXT_VIBRATION,//"진동"
	TEXT_LANGUAGE,//"언어"
	TEXT_NAME,//"이름"

	TEXT_FACEBOOK,//"Facebook"
	TEXT_GOOGLEPLAY,//"Google Play"
	TEXT_GAMECENTER,//"Game Center"
	TEXT_GUEST,//"Guest"

	TEXT_HELP,//"도움말 및 지원"
	TEXT_PRIVACY,//"개인정보 보호정책"
	TEXT_TERMOFSERVICE,//"이용 약관"
	TEXT_STAFF,//"제작진"

	TEXT_ON,//"켬"
	TEXT_OFF,//"끔"

	TEXT_KOREAN,//"한국어"
	TEXT_ENGLISH,//"영어"
	TEXT_JAPANESE,//"일어"

	TEXT_CONNECTED,//"연동됨"
	TEXT_DISCONNECTED,//"연동되지 않음"

	TEXT_EQUIPREQUIREMENT,//장비요구치
	TEXT_REQUIREDLV,//요구레벨 : |e플레이어 레벨 %d이상
	TEXT_REQUIREDSKILLLV,//|d[%s] 레벨 %d이상
	TEXT_CURRENTLV0,//현재 등급 : 없음
	TEXT_CURRENTLV,//현재 등급 : |e%d레벨
	TEXT_NEXTLV0,//다음 등급 : 없음
	TEXT_NEXTLV,//다음 등급 : |e%d레벨
	TEXT_ENCHANT,//장비강화
	TEXT_MAKE,//장비제작
	TEXT_GEM,//보석장착
	TEXT_QUIT,//나가기
	TEXT_DOYOUENCHANT,//강화하시겠습니까?
	TEXT_DOYOURECIPE,//제작하시겠습니까?
	TEXT_SOCKETDISABLE,//소켓을 장착할 수 없는 아이템입니다.
	TEXT_ITEM_EMERGRESTORE,//긴급 재생의 망치
	TEXT_ITEM_RESTORE,//|b재생의 망치
	TEXT_CONFIRM,//확인
	TEXT_CANCEL,//취소
	TEXT_REPAIRSUCCEED,//복구에 성공하였습니다.
	TEXT_CHARINTRO_ROBIN,//근접형, 검
	TEXT_CHARINTRO_DIANA,//중거리형, 권총
	TEXT_CHARINTRO_MAXX,//기교형, 부메랑
	TEXT_SLOTRESET,//|c[경고] |b게임초기화를 하면 저장되어 있던 |e데이터|b와 |e아이템|b이 |h사라집니다!\n |c게임을 초기화하시겠습니까?
	TEXT_CANNOTUSE,//지금 사용하실 수 없습니다.
	TEXT_CANNOTMP,//MP가 부족합니다.
	TEXT_RESCUESUCCESS,//서포터를 구출하였습니다!
	TEXT_USERLEVEL,//유저레벨이
	TEXT_REACH,//에 도달하였습니다!
	TEXT_REWARDGET,//보상을 획득했습니다!
	TEXT_COMBATPOWER,//전투력
	TEXT_CHALLENGE,//도전

	TEXT_SKILLNAME_COMMON_ROBIN1,//힘단련 : STR 상승
	TEXT_SKILLNAME_COMMON_ROBIN2,//체력단련 : VIT 상승
	TEXT_SKILLNAME_COMMON_ROBIN3,//민첩단련 : AGI 상승
	TEXT_SKILLNAME_COMMON_ROBIN4,//정신단련 : INT 상승
	TEXT_SKILLNAME_COMMON_ROBIN5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLNAME_COMMON_ROBIN6,//기력강화 : MP 최대치 상승
	TEXT_SKILLNAME_COMMON_ROBIN7,//무기숙련 : 공격력 증가
	TEXT_SKILLNAME_COMMON_ROBIN8,//방어구숙련: 방어력 증가
	TEXT_SKILLNAME_COMMON_ROBIN9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLNAME_COMMON_ROBIN10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLNAME_COMMON_ROBIN11,//뚝심 : 데미지 경감
	TEXT_SKILLNAME_COMMON_ROBIN12,//정조준 : 명중 증가
	TEXT_SKILLNAME_COMMON_ROBIN13,//신속회피 : 회피 증가

	TEXT_SKILLNAME_ROBIN1,//검술숙련 : 관통 발생 확률 상승
	TEXT_SKILLNAME_ROBIN2,//긴급방어 : 방어 발동 확률이 올라감(1레벨이면 방어 발동이 시작, 점점 확률 상승)
	TEXT_SKILLNAME_ROBIN3,//방어숙련 : 방어 발동시 경감되는 데미지 퍼센트 상승
	TEXT_SKILLNAME_ROBIN4,//면역력 : 상태이상에 대한 저항력 상승
	TEXT_SKILLNAME_ROBIN5,//지구전 : INT가 높을수록 VIT 상승
	TEXT_SKILLNAME_ROBIN6,//에어크래쉬 : 몹 뛰우기
	TEXT_SKILLNAME_ROBIN7,//마구찌르기 : 난타
	TEXT_SKILLNAME_ROBIN8,//부스트슬래쉬 : 가로로 크게 배기, 기절공격
	TEXT_SKILLNAME_ROBIN9,//하이퍼차지 : 돌격공격, 적을 뒤로 날려버림
	TEXT_SKILLNAME_ROBIN10,//소울크래쉬 : 기절
	TEXT_SKILLNAME_ROBIN11,//앱솔루트피어스 : 찔러서회전
	TEXT_SKILLNAME_ROBIN12,//멸살연참 : 연속기
	TEXT_SKILLNAME_ROBIN13,//방어태세 : 일정시간 VIT 상승
	TEXT_SKILLNAME_ROBIN14,//정신소모 : MP 소모하여 데미지 경감
	TEXT_SKILLNAME_ROBIN15,//여유포착 : 적 공격 회피시 HP 상승
	TEXT_SKILLNAME_ROBIN16,//냉정침착 : 데미지 입으면 MP 회복
	TEXT_SKILLNAME_ROBIN17,//리플렉터 : 확률로데미지 반사

	TEXT_SKILLNAME_COMMON_DIANA1,//힘단련 : STR 상승
	TEXT_SKILLNAME_COMMON_DIANA2,//체력단련 : VIT 상승
	TEXT_SKILLNAME_COMMON_DIANA3,//민첩단련 : AGI 상승
	TEXT_SKILLNAME_COMMON_DIANA4,//정신단련 : INT 상승
	TEXT_SKILLNAME_COMMON_DIANA5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLNAME_COMMON_DIANA6,//기력강화 : MP 최대치 상승
	TEXT_SKILLNAME_COMMON_DIANA7,//무기숙련 : 공격력 증가
	TEXT_SKILLNAME_COMMON_DIANA8,//방어구숙련: 방어력 증가
	TEXT_SKILLNAME_COMMON_DIANA9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLNAME_COMMON_DIANA10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLNAME_COMMON_DIANA11,//뚝심 : 데미지 경감
	TEXT_SKILLNAME_COMMON_DIANA12,//정조준 : 명중 증가
	TEXT_SKILLNAME_COMMON_DIANA13,//신속회피 : 회피 증가

	TEXT_SKILLNAME_DIANA1,//매의눈 : 공격 거리 상승
	TEXT_SKILLNAME_DIANA2,//사격숙련 : 기절공격이 발생할 확률이 상승
	TEXT_SKILLNAME_DIANA3,//아드레날린 : 기절공격 성공시 MP 회복량 상승
	TEXT_SKILLNAME_DIANA4,//활성화 : 스킬 재사용 시간 감소
	TEXT_SKILLNAME_DIANA5,//집중력유지 : STR이 높을수록 INT 상승
	TEXT_SKILLNAME_DIANA6,//3way : 3방향으로 총 발사
	TEXT_SKILLNAME_DIANA7,//리플렉션빔 : 레이져가 벽에 튕김
	TEXT_SKILLNAME_DIANA8,//헬파이어 : 화염 방사기
	TEXT_SKILLNAME_DIANA9,//로켓런쳐 : 로켓 발사되어 폭발
	TEXT_SKILLNAME_DIANA10,//호밍미사일 : 유도탄 3개
	TEXT_SKILLNAME_DIANA11,//킬링존 : 난사
	TEXT_SKILLNAME_DIANA12,//오비탈레이져 : 인공위성
	TEXT_SKILLNAME_DIANA13,//리커버리 : 회복탄
	TEXT_SKILLNAME_DIANA14,//흥분고조 : 방어력 저하 공격력 상승
	TEXT_SKILLNAME_DIANA15,//흡마의마탄 : 공격시 MP 흡수
	TEXT_SKILLNAME_DIANA16,//필살집중 : 크리 상승
	TEXT_SKILLNAME_DIANA17,//파마의직격 : 일정시간 적 방어 무시

	TEXT_SKILLNAME_COMMON_MAXX1,//힘단련 : STR 상승
	TEXT_SKILLNAME_COMMON_MAXX2,//체력단련 : VIT 상승
	TEXT_SKILLNAME_COMMON_MAXX3,//민첩단련 : AGI 상승
	TEXT_SKILLNAME_COMMON_MAXX4,//정신단련 : INT 상승
	TEXT_SKILLNAME_COMMON_MAXX5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLNAME_COMMON_MAXX6,//기력강화 : MP 최대치 상승
	TEXT_SKILLNAME_COMMON_MAXX7,//무기숙련 : 공격력 증가
	TEXT_SKILLNAME_COMMON_MAXX8,//방어구숙련: 방어력 증가
	TEXT_SKILLNAME_COMMON_MAXX9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLNAME_COMMON_MAXX10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLNAME_COMMON_MAXX11,//뚝심 : 데미지 경감
	TEXT_SKILLNAME_COMMON_MAXX12,//정조준 : 명중 증가
	TEXT_SKILLNAME_COMMON_MAXX13,//신속회피 : 회피 증가

	TEXT_SKILLNAME_MAXX1,//관통력숙련 : 적을 공격했을 때 부메랑의 판정이 남아있을 확률이 상승한다.
	TEXT_SKILLNAME_MAXX2,//투척숙련 : 부메랑 속도 상승
	TEXT_SKILLNAME_MAXX3,//연속공격 : 추가 공격 확률 증가
	TEXT_SKILLNAME_MAXX4,//회전력상승 : 추가 공격 성공시 해당 공격에 대해서 데미지 상승
	TEXT_SKILLNAME_MAXX5,//탄력성 : VIT 높을수록 AGI 상승
	TEXT_SKILLNAME_MAXX6,//효율적사고 : INT가 높을수록 AGI가 올라감
	TEXT_SKILLNAME_MAXX7,//돌려차기 : 회전, 기절공격
	TEXT_SKILLNAME_MAXX8,//숏헌트 : 관통, 사거리 짧음
	TEXT_SKILLNAME_MAXX9,//에어헌트 : 수직 상승 공격
	TEXT_SKILLNAME_MAXX10,//캠핑헌트 : 앞으로 날라가서 제자리회전
	TEXT_SKILLNAME_MAXX11,//호밍헌트 : 가장 가까운 적 때리고 되돌아옴
	TEXT_SKILLNAME_MAXX12,//써클헌트 : 주인공 주변 보호
	TEXT_SKILLNAME_MAXX13,//메가헌트 : 관통후 뒤에서 돌아옴
	TEXT_SKILLNAME_MAXX14,//블러드헌트 : 적 공격시 HP 회복
	TEXT_SKILLNAME_MAXX15,//현란무도 : 일정시간 회피율 증가
	TEXT_SKILLNAME_MAXX16,//안도의한숨 : 적 공격 회피시 HP 회복
	TEXT_SKILLNAME_MAXX17,//혼신분리 : 기절 확률 상승

	TEXT_SKILLNAME_ENEMYSNAIL_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_SKILL1,	//스파크18//
	TEXT_SKILLNAME_ENEMYLIGHTNING_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_SKILL1,	//라이트 스피릿21
	TEXT_SKILLNAME_ENEMYFAIRY_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_SKILL1,	//스트라이더23
	TEXT_SKILLNAME_ENEMYSPIDER_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLNAME_ENEMYGOLEM_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_SKILL1,	//그레이트 아머25
	TEXT_SKILLNAME_ENEMYDARKGIANT_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_SKILL1,	//우로보로스26(x 예는 그냥 안됨)
	TEXT_SKILLNAME_ENEMYDARKDRAGON_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLNAME_ENEMYDRAGON1_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_SKILL1,	//드래곤 좀비28
	TEXT_SKILLNAME_ENEMYDRAGON2_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_SKILL1,	//떠도는 영혼29
	TEXT_SKILLNAME_ENEMYGHOST_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_SKILL1,	//무혼의 기사30
	TEXT_SKILLNAME_ENEMYPUMPKIN_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴(?)
	TEXT_SKILLNAME_ENEMYCASTLE1_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLNAME_ENEMYCASTLE2_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_SKILL1,	//안드로볼33
	TEXT_SKILLNAME_ENEMYSPACE1_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_SKILL1,	//메탈가우스34
	TEXT_SKILLNAME_ENEMYSPACE2_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_SKILL1,	//토드뮤턴트35
	TEXT_SKILLNAME_ENEMYFROG_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_SKILL1,	//아르곤36
	TEXT_SKILLNAME_ENEMYLARVA_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_SKILL1,	//카툼37
	TEXT_SKILLNAME_ENEMYSALAMANDER_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_SKILL1,	//고대의 수호자38
	TEXT_SKILLNAME_ENEMYGIANT_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_SKILL1,	//이프리트39
	TEXT_SKILLNAME_ENEMYIFRIT_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_SKILL1,	//프로스트40
	TEXT_SKILLNAME_ENEMYMAMMOTH_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_SKILL1,	//라이오너41		(x)			//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_SKILL1,	//호루스42
	TEXT_SKILLNAME_ENEMYANGEL_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_SKILL1,	//마도합성수43
	TEXT_SKILLNAME_ENEMYKIMERA_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_SKILL1,	//고대의 방주44 (x)
	TEXT_SKILLNAME_ENEMYSHIP_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_SKILL1,	//아리만45
	TEXT_SKILLNAME_ENEMYFOGRA_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_SKILL1,	//티어맷46 (x)
	TEXT_SKILLNAME_ENEMYBAHAMUT_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_SKILL1,	//사신47
	TEXT_SKILLNAME_ENEMYDEATH_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_SKILL1,	//데브리온48 (x)
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_SKILL1,	//엘케인맨티스49
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_SKILL1,	//쉐도우 테트라쿤50 -> 제외 (x)
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_SKILL1,	//라베스 보스52 (x)
	TEXT_SKILLNAME_ENEMYLABETH_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_SKILL3,

	TEXT_SKILLNAME_ENEMYSNAIL_RED_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_RED_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_RED_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_RED_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_RED_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_RED_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_RED_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_RED_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_RED_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_RED_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_RED_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_RED_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_RED_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_RED_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_RED_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_RED_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_RED_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_RED_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_RED_SKILL1,	//라이트 스피릿21
	TEXT_SKILLNAME_ENEMYFAIRY_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_RED_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_RED_SKILL1,	//스트라이더23
	TEXT_SKILLNAME_ENEMYSPIDER_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_RED_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLNAME_ENEMYGOLEM_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_RED_SKILL1,	//그레이트 아머25
	TEXT_SKILLNAME_ENEMYDARKGIANT_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_RED_SKILL1,	//우로보로스26
	TEXT_SKILLNAME_ENEMYDARKDRAGON_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_RED_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLNAME_ENEMYDRAGON1_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_RED_SKILL1,	//드래곤 좀비28
	TEXT_SKILLNAME_ENEMYDRAGON2_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_RED_SKILL1,	//떠도는 영혼29
	TEXT_SKILLNAME_ENEMYGHOST_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_RED_SKILL1,	//무혼의 기사30
	TEXT_SKILLNAME_ENEMYPUMPKIN_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_RED_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_RED_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLNAME_ENEMYCASTLE2_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_RED_SKILL1,	//안드로볼33
	TEXT_SKILLNAME_ENEMYSPACE1_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_RED_SKILL1,	//메탈가우스34
	TEXT_SKILLNAME_ENEMYSPACE2_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_RED_SKILL1,	//토드뮤턴트35
	TEXT_SKILLNAME_ENEMYFROG_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_RED_SKILL1,	//아르곤36
	TEXT_SKILLNAME_ENEMYLARVA_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_RED_SKILL1,	//카툼37
	TEXT_SKILLNAME_ENEMYSALAMANDER_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_RED_SKILL1,	//고대의 수호자38
	TEXT_SKILLNAME_ENEMYGIANT_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_RED_SKILL1,	//이프리트39
	TEXT_SKILLNAME_ENEMYIFRIT_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_RED_SKILL1,	//프로스트40
	TEXT_SKILLNAME_ENEMYMAMMOTH_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_RED_SKILL1,	//라이오너41					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_RED_SKILL1,	//호루스42
	TEXT_SKILLNAME_ENEMYANGEL_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_RED_SKILL1,	//마도합성수43
	TEXT_SKILLNAME_ENEMYKIMERA_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_RED_SKILL1,	//고대의 방주44
	TEXT_SKILLNAME_ENEMYSHIP_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_RED_SKILL1,	//아리만45
	TEXT_SKILLNAME_ENEMYFOGRA_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_RED_SKILL1,	//티어맷46
	TEXT_SKILLNAME_ENEMYBAHAMUT_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_RED_SKILL1,	//사신47
	TEXT_SKILLNAME_ENEMYDEATH_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_RED_SKILL1,	//데브리온48
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_RED_SKILL1,	//엘케인맨티스49
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_RED_SKILL1,	//쉐도우 테트라쿤50 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_RED_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_RED_SKILL1,	//라베스 보스52
	TEXT_SKILLNAME_ENEMYLABETH_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_RED_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_RED_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_RED_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_RED_SKILL3,

	TEXT_SKILLNAME_ENEMYSNAIL_BLUE_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_BLUE_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_BLUE_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_BLUE_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_BLUE_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLUE_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_BLUE_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_BLUE_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_BLUE_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_BLUE_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_BLUE_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_BLUE_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_BLUE_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLUE_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_BLUE_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLUE_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_BLUE_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLUE_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_BLUE_SKILL1,	//라이트 스피릿21
	TEXT_SKILLNAME_ENEMYFAIRY_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_BLUE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_BLUE_SKILL1,	//스트라이더23
	TEXT_SKILLNAME_ENEMYSPIDER_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_BLUE_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLNAME_ENEMYGOLEM_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLUE_SKILL1,	//그레이트 아머25
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLUE_SKILL1,	//우로보로스26
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_BLUE_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLNAME_ENEMYDRAGON1_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_BLUE_SKILL1,	//드래곤 좀비28
	TEXT_SKILLNAME_ENEMYDRAGON2_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_BLUE_SKILL1,	//떠도는 영혼29
	TEXT_SKILLNAME_ENEMYGHOST_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLUE_SKILL1,	//무혼의 기사30
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_BLUE_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_BLUE_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLNAME_ENEMYCASTLE2_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_BLUE_SKILL1,	//안드로볼33
	TEXT_SKILLNAME_ENEMYSPACE1_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_BLUE_SKILL1,	//메탈가우스34
	TEXT_SKILLNAME_ENEMYSPACE2_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_BLUE_SKILL1,	//토드뮤턴트35
	TEXT_SKILLNAME_ENEMYFROG_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_BLUE_SKILL1,	//아르곤36
	TEXT_SKILLNAME_ENEMYLARVA_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLUE_SKILL1,	//카툼37
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_BLUE_SKILL1,	//고대의 수호자38
	TEXT_SKILLNAME_ENEMYGIANT_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_BLUE_SKILL1,	//이프리트39
	TEXT_SKILLNAME_ENEMYIFRIT_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLUE_SKILL1,	//프로스트40
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_BLUE_SKILL1,	//라이오너41					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_BLUE_SKILL1,	//호루스42
	TEXT_SKILLNAME_ENEMYANGEL_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_BLUE_SKILL1,	//마도합성수43
	TEXT_SKILLNAME_ENEMYKIMERA_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_BLUE_SKILL1,	//고대의 방주44
	TEXT_SKILLNAME_ENEMYSHIP_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_BLUE_SKILL1,	//아리만45
	TEXT_SKILLNAME_ENEMYFOGRA_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLUE_SKILL1,	//티어맷46
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_BLUE_SKILL1,	//사신47
	TEXT_SKILLNAME_ENEMYDEATH_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLUE_SKILL1,	//데브리온48
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLUE_SKILL1,	//엘케인맨티스49
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLUE_SKILL1,	//쉐도우 테트라쿤50 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLUE_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_BLUE_SKILL1,	//라베스 보스52
	TEXT_SKILLNAME_ENEMYLABETH_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_BLUE_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_BLUE_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_BLUE_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_BLUE_SKILL3,

	TEXT_SKILLNAME_ENEMYSNAIL_PURPLE_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_PURPLE_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_PURPLE_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_PURPLE_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_PURPLE_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_PURPLE_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_PURPLE_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_PURPLE_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_PURPLE_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_PURPLE_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_PURPLE_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_PURPLE_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_PURPLE_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_PURPLE_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_PURPLE_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_PURPLE_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_PURPLE_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_PURPLE_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_PURPLE_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLNAME_ENEMYFAIRY_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_PURPLE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_PURPLE_SKILL1,	//스트라이더25
	TEXT_SKILLNAME_ENEMYSPIDER_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_PURPLE_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLNAME_ENEMYGOLEM_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_PURPLE_SKILL1,	//그레이트 아머27
	TEXT_SKILLNAME_ENEMYDARKGIANT_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_PURPLE_SKILL1,	//우로보로스28
	TEXT_SKILLNAME_ENEMYDARKDRAGON_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_PURPLE_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLNAME_ENEMYDRAGON1_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_PURPLE_SKILL1,	//드래곤 좀비30
	TEXT_SKILLNAME_ENEMYDRAGON2_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_PURPLE_SKILL1,	//떠도는 영혼31
	TEXT_SKILLNAME_ENEMYGHOST_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_PURPLE_SKILL1,	//무혼의 기사32
	TEXT_SKILLNAME_ENEMYPUMPKIN_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_PURPLE_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_PURPLE_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLNAME_ENEMYCASTLE2_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_PURPLE_SKILL1,	//안드로볼35
	TEXT_SKILLNAME_ENEMYSPACE1_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_PURPLE_SKILL1,	//메탈가우스36
	TEXT_SKILLNAME_ENEMYSPACE2_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_PURPLE_SKILL1,	//토드뮤턴트37
	TEXT_SKILLNAME_ENEMYFROG_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_PURPLE_SKILL1,	//아르곤38
	TEXT_SKILLNAME_ENEMYLARVA_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_PURPLE_SKILL1,	//카툼39
	TEXT_SKILLNAME_ENEMYSALAMANDER_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_PURPLE_SKILL1,	//고대의 수호자40
	TEXT_SKILLNAME_ENEMYGIANT_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_PURPLE_SKILL1,	//이프리트41
	TEXT_SKILLNAME_ENEMYIFRIT_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_PURPLE_SKILL1,	//프로스트42
	TEXT_SKILLNAME_ENEMYMAMMOTH_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_PURPLE_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_PURPLE_SKILL1,	//호루스44
	TEXT_SKILLNAME_ENEMYANGEL_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_PURPLE_SKILL1,	//마도합성수45
	TEXT_SKILLNAME_ENEMYKIMERA_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_PURPLE_SKILL1,	//고대의 방주46
	TEXT_SKILLNAME_ENEMYSHIP_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_PURPLE_SKILL1,	//아리만47
	TEXT_SKILLNAME_ENEMYFOGRA_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_PURPLE_SKILL1,	//티어맷48
	TEXT_SKILLNAME_ENEMYBAHAMUT_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_PURPLE_SKILL1,	//사신49
	TEXT_SKILLNAME_ENEMYDEATH_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_PURPLE_SKILL1,	//데브리온50
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_PURPLE_SKILL1,	//엘케인맨티스51
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_PURPLE_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_PURPLE_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_PURPLE_SKILL1,	//라베스 보스54
	TEXT_SKILLNAME_ENEMYLABETH_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_PURPLE_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_PURPLE_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_PURPLE_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_PURPLE_SKILL3,

	TEXT_SKILLNAME_ENEMYSNAIL_GREEN_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_GREEN_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_GREEN_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_GREEN_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_GREEN_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_GREEN_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_GREEN_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_GREEN_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_GREEN_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_GREEN_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_GREEN_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_GREEN_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_GREEN_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_GREEN_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_GREEN_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_GREEN_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_GREEN_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_GREEN_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_GREEN_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLNAME_ENEMYFAIRY_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_GREEN_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_GREEN_SKILL1,	//스트라이더25
	TEXT_SKILLNAME_ENEMYSPIDER_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_GREEN_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLNAME_ENEMYGOLEM_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_GREEN_SKILL1,	//그레이트 아머27
	TEXT_SKILLNAME_ENEMYDARKGIANT_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GREEN_SKILL1,	//우로보로스28
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_GREEN_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLNAME_ENEMYDRAGON1_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_GREEN_SKILL1,	//드래곤 좀비30
	TEXT_SKILLNAME_ENEMYDRAGON2_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_GREEN_SKILL1,	//떠도는 영혼31
	TEXT_SKILLNAME_ENEMYGHOST_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_GREEN_SKILL1,	//무혼의 기사32
	TEXT_SKILLNAME_ENEMYPUMPKIN_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_GREEN_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_GREEN_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLNAME_ENEMYCASTLE2_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_GREEN_SKILL1,	//안드로볼35
	TEXT_SKILLNAME_ENEMYSPACE1_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_GREEN_SKILL1,	//메탈가우스36
	TEXT_SKILLNAME_ENEMYSPACE2_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_GREEN_SKILL1,	//토드뮤턴트37
	TEXT_SKILLNAME_ENEMYFROG_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_GREEN_SKILL1,	//아르곤38
	TEXT_SKILLNAME_ENEMYLARVA_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_GREEN_SKILL1,	//카툼39
	TEXT_SKILLNAME_ENEMYSALAMANDER_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_GREEN_SKILL1,	//고대의 수호자40
	TEXT_SKILLNAME_ENEMYGIANT_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_GREEN_SKILL1,	//이프리트41
	TEXT_SKILLNAME_ENEMYIFRIT_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_GREEN_SKILL1,	//프로스트42
	TEXT_SKILLNAME_ENEMYMAMMOTH_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_GREEN_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_GREEN_SKILL1,	//호루스44
	TEXT_SKILLNAME_ENEMYANGEL_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_GREEN_SKILL1,	//마도합성수45
	TEXT_SKILLNAME_ENEMYKIMERA_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_GREEN_SKILL1,	//고대의 방주46
	TEXT_SKILLNAME_ENEMYSHIP_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_GREEN_SKILL1,	//아리만47
	TEXT_SKILLNAME_ENEMYFOGRA_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_GREEN_SKILL1,	//티어맷48
	TEXT_SKILLNAME_ENEMYBAHAMUT_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_GREEN_SKILL1,	//사신49
	TEXT_SKILLNAME_ENEMYDEATH_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GREEN_SKILL1,	//데브리온50
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GREEN_SKILL1,	//엘케인맨티스51
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GREEN_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GREEN_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_GREEN_SKILL1,	//라베스 보스54
	TEXT_SKILLNAME_ENEMYLABETH_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_GREEN_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_GREEN_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_GREEN_SKILL3,
	TEXT_SKILLNAME_ENEMYSNAIL_GOLD_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_GOLD_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_GOLD_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_GOLD_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_GOLD_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_GOLD_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_GOLD_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_GOLD_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_GOLD_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_GOLD_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_GOLD_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_GOLD_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_GOLD_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_GOLD_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_GOLD_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_GOLD_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_GOLD_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_GOLD_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_GOLD_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLNAME_ENEMYFAIRY_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_GOLD_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_GOLD_SKILL1,	//스트라이더25
	TEXT_SKILLNAME_ENEMYSPIDER_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_GOLD_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLNAME_ENEMYGOLEM_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_GOLD_SKILL1,	//그레이트 아머27
	TEXT_SKILLNAME_ENEMYDARKGIANT_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GOLD_SKILL1,	//우로보로스28
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_GOLD_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLNAME_ENEMYDRAGON1_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_GOLD_SKILL1,	//드래곤 좀비30
	TEXT_SKILLNAME_ENEMYDRAGON2_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_GOLD_SKILL1,	//떠도는 영혼31
	TEXT_SKILLNAME_ENEMYGHOST_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_GOLD_SKILL1,	//무혼의 기사32
	TEXT_SKILLNAME_ENEMYPUMPKIN_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_GOLD_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_GOLD_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLNAME_ENEMYCASTLE2_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_GOLD_SKILL1,	//안드로볼35
	TEXT_SKILLNAME_ENEMYSPACE1_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_GOLD_SKILL1,	//메탈가우스36
	TEXT_SKILLNAME_ENEMYSPACE2_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_GOLD_SKILL1,	//토드뮤턴트37
	TEXT_SKILLNAME_ENEMYFROG_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_GOLD_SKILL1,	//아르곤38
	TEXT_SKILLNAME_ENEMYLARVA_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_GOLD_SKILL1,	//카툼39
	TEXT_SKILLNAME_ENEMYSALAMANDER_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_GOLD_SKILL1,	//고대의 수호자40
	TEXT_SKILLNAME_ENEMYGIANT_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_GOLD_SKILL1,	//이프리트41
	TEXT_SKILLNAME_ENEMYIFRIT_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_GOLD_SKILL1,	//프로스트42
	TEXT_SKILLNAME_ENEMYMAMMOTH_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_GOLD_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_GOLD_SKILL1,	//호루스44
	TEXT_SKILLNAME_ENEMYANGEL_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_GOLD_SKILL1,	//마도합성수45
	TEXT_SKILLNAME_ENEMYKIMERA_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_GOLD_SKILL1,	//고대의 방주46
	TEXT_SKILLNAME_ENEMYSHIP_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_GOLD_SKILL1,	//아리만47
	TEXT_SKILLNAME_ENEMYFOGRA_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_GOLD_SKILL1,	//티어맷48
	TEXT_SKILLNAME_ENEMYBAHAMUT_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_GOLD_SKILL1,	//사신49
	TEXT_SKILLNAME_ENEMYDEATH_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GOLD_SKILL1,	//데브리온50
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GOLD_SKILL1,	//엘케인맨티스51
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GOLD_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GOLD_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_GOLD_SKILL1,	//라베스 보스54
	TEXT_SKILLNAME_ENEMYLABETH_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_GOLD_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_GOLD_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLNAME_ENEMYELKEIN_GOLD_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_GOLD_SKILL3,

	TEXT_SKILLNAME_ENEMYSNAIL_BLACK_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLNAME_ENEMYSNAIL_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSNAIL_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYTREE_BLACK_SKILL1,	//늪의 주인 4
	TEXT_SKILLNAME_ENEMYTREE_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYTREE_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYONEEYE_BLACK_SKILL1,	//아이볼 5
	TEXT_SKILLNAME_ENEMYONEEYE_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYONEEYE_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSKELETON_BLACK_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLNAME_ENEMYSKELETON_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSKELETON_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYLIZARD_BLACK_SKILL1,	//사하긴 병사 7
	TEXT_SKILLNAME_ENEMYLIZARD_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYLIZARD_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLACK_SKILL1,	//맹독 해파리8
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYJELLYFISH_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYKNIGHT_BLACK_SKILL1,	//타락한 기사 9
	TEXT_SKILLNAME_ENEMYKNIGHT_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYKNIGHT_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSLIME_BLACK_SKILL1,	//슬라임 10
	TEXT_SKILLNAME_ENEMYSLIME_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSLIME_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSLING_BLACK_SKILL1,	//평원의 도적 11
	TEXT_SKILLNAME_ENEMYSLING_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSLING_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYBOAR_BLACK_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLNAME_ENEMYBOAR_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYBOAR_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYFLAME_BLACK_SKILL1,	//분노의 정령 13
	TEXT_SKILLNAME_ENEMYFLAME_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYFLAME_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYPHOENIX_BLACK_SKILL1,	//마성의 불새14
	TEXT_SKILLNAME_ENEMYPHOENIX_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYPHOENIX_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYFACE_BLACK_SKILL1,	//결빙의 석상15
	TEXT_SKILLNAME_ENEMYFACE_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYFACE_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLACK_SKILL1,	//스노우맨16
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSNOWMAN_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYICESUN_BLACK_SKILL1,	//아이스마스크17
	TEXT_SKILLNAME_ENEMYICESUN_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYICESUN_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLACK_SKILL1,	//스파크18
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYLIGHTNING_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYTHUNDER_BLACK_SKILL1,	//다크미스트19
	TEXT_SKILLNAME_ENEMYTHUNDER_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYTHUNDER_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLACK_SKILL1,	//스파크 플랜트20
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCRYSTAL_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYFAIRY_BLACK_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLNAME_ENEMYFAIRY_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYFAIRY_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCIRCLE_BLACK_SKILL1,	//딜루젼 소울22
	TEXT_SKILLNAME_ENEMYCIRCLE_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCIRCLE_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSPIDER_BLACK_SKILL1,	//스트라이더25
	TEXT_SKILLNAME_ENEMYSPIDER_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSPIDER_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYGOLEM_BLACK_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLNAME_ENEMYGOLEM_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYGOLEM_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLACK_SKILL1,	//그레이트 아머27
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKGIANT_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLACK_SKILL1,	//우로보로스28
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYDARKDRAGON_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON1_BLACK_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLNAME_ENEMYDRAGON1_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON1_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYDRAGON2_BLACK_SKILL1,	//드래곤 좀비30
	TEXT_SKILLNAME_ENEMYDRAGON2_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYDRAGON2_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYGHOST_BLACK_SKILL1,	//떠도는 영혼31
	TEXT_SKILLNAME_ENEMYGHOST_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYGHOST_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLACK_SKILL1,	//무혼의 기사32
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYPUMPKIN_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE1_BLACK_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLNAME_ENEMYCASTLE1_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE1_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE2_BLACK_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLNAME_ENEMYCASTLE2_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE2_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE1_BLACK_SKILL1,	//안드로볼35
	TEXT_SKILLNAME_ENEMYSPACE1_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE1_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSPACE2_BLACK_SKILL1,	//메탈가우스36
	TEXT_SKILLNAME_ENEMYSPACE2_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSPACE2_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYFROG_BLACK_SKILL1,	//토드뮤턴트37
	TEXT_SKILLNAME_ENEMYFROG_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYFROG_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYLARVA_BLACK_SKILL1,	//아르곤38
	TEXT_SKILLNAME_ENEMYLARVA_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYLARVA_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLACK_SKILL1,	//카툼39
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSALAMANDER_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYGIANT_BLACK_SKILL1,	//고대의 수호자40
	TEXT_SKILLNAME_ENEMYGIANT_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYGIANT_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYIFRIT_BLACK_SKILL1,	//이프리트41
	TEXT_SKILLNAME_ENEMYIFRIT_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYIFRIT_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLACK_SKILL1,	//프로스트42
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYMAMMOTH_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYMACHINE_BLACK_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLNAME_ENEMYMACHINE_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYMACHINE_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYANGEL_BLACK_SKILL1,	//호루스44
	TEXT_SKILLNAME_ENEMYANGEL_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYANGEL_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYKIMERA_BLACK_SKILL1,	//마도합성수45
	TEXT_SKILLNAME_ENEMYKIMERA_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYKIMERA_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYSHIP_BLACK_SKILL1,	//고대의 방주46
	TEXT_SKILLNAME_ENEMYSHIP_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYSHIP_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYFOGRA_BLACK_SKILL1,	//아리만47
	TEXT_SKILLNAME_ENEMYFOGRA_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYFOGRA_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLACK_SKILL1,	//티어맷48
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYBAHAMUT_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYDEATH_BLACK_SKILL1,	//사신49
	TEXT_SKILLNAME_ENEMYDEATH_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYDEATH_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLACK_SKILL1,	//데브리온50
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS1_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLACK_SKILL1,	//엘케인맨티스51
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS2_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLACK_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS3_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLACK_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYCASTLE_BOSS4_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYLABETH_BLACK_SKILL1,	//라베스 보스54
	TEXT_SKILLNAME_ENEMYLABETH_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYLABETH_BLACK_SKILL3,
	TEXT_SKILLNAME_ENEMYELKEIN_BLACK_SKILL1,	//엘케인 보스55
	TEXT_SKILLNAME_ENEMYELKEIN_BLACK_SKILL2,
	TEXT_SKILLNAME_ENEMYELKEIN_BLACK_SKILL3,

	TEXT_SKILLNAME_NPC_CAPTAIN_SKILL1,//c52//잭스패너//x
	TEXT_SKILLNAME_NPC_CAPTAIN_SKILL2,
	TEXT_SKILLNAME_NPC_CAPTAIN_SKILL3,
	TEXT_SKILLNAME_NPC_CREW_SKILL1,//c53//선원//x
	TEXT_SKILLNAME_NPC_CREW_SKILL2,
	TEXT_SKILLNAME_NPC_CREW_SKILL3,
	TEXT_SKILLNAME_NPC_GRANDFA_SKILL1,//c54//촌장//x
	TEXT_SKILLNAME_NPC_GRANDFA_SKILL2,
	TEXT_SKILLNAME_NPC_GRANDFA_SKILL3,
	TEXT_SKILLNAME_NPC_UNCLE_SKILL1,//c55//아저씨
	TEXT_SKILLNAME_NPC_UNCLE_SKILL2,
	TEXT_SKILLNAME_NPC_UNCLE_SKILL3,
	TEXT_SKILLNAME_NPC_AUNT_SKILL1,//c56//아줌마//x
	TEXT_SKILLNAME_NPC_AUNT_SKILL2,
	TEXT_SKILLNAME_NPC_AUNT_SKILL3,
	TEXT_SKILLNAME_NPC_MAN_SKILL1,//c57//자경단청년//x
	TEXT_SKILLNAME_NPC_MAN_SKILL2,
	TEXT_SKILLNAME_NPC_MAN_SKILL3,
	TEXT_SKILLNAME_NPC_WOMAN_SKILL1,//c58//처녀//x
	TEXT_SKILLNAME_NPC_WOMAN_SKILL2,
	TEXT_SKILLNAME_NPC_WOMAN_SKILL3,
	TEXT_SKILLNAME_NPC_BOY_SKILL1,//c59//꼬마남//x
	TEXT_SKILLNAME_NPC_BOY_SKILL2,
	TEXT_SKILLNAME_NPC_BOY_SKILL3,
	TEXT_SKILLNAME_NPC_GIRL_SKILL1,//c60//꼬마녀//x
	TEXT_SKILLNAME_NPC_GIRL_SKILL2,
	TEXT_SKILLNAME_NPC_GIRL_SKILL3,
	TEXT_SKILLNAME_NPC_ALMA_SKILL1,//c61//알마//x
	TEXT_SKILLNAME_NPC_ALMA_SKILL2,
	TEXT_SKILLNAME_NPC_ALMA_SKILL3,
	TEXT_SKILLNAME_NPC_ITEM_SKILL1,//c62//터번//x
	TEXT_SKILLNAME_NPC_ITEM_SKILL2,
	TEXT_SKILLNAME_NPC_ITEM_SKILL3,
	TEXT_SKILLNAME_NPC_FATMAN_SKILL1,//c63//x
	TEXT_SKILLNAME_NPC_FATMAN_SKILL2,
	TEXT_SKILLNAME_NPC_FATMAN_SKILL3,
	TEXT_SKILLNAME_NPC_BUNNYGIRL_SKILL1,//c64//x
	TEXT_SKILLNAME_NPC_BUNNYGIRL_SKILL2,
	TEXT_SKILLNAME_NPC_BUNNYGIRL_SKILL3,
	TEXT_SKILLNAME_NPC_KNIGHT_SKILL1,//c65//플레타//x
	TEXT_SKILLNAME_NPC_KNIGHT_SKILL2,
	TEXT_SKILLNAME_NPC_KNIGHT_SKILL3,
	TEXT_SKILLNAME_NPC_DOG_SKILL1,//c66//x
	TEXT_SKILLNAME_NPC_DOG_SKILL2,
	TEXT_SKILLNAME_NPC_DOG_SKILL3,
	TEXT_SKILLNAME_NPC_MERCHANT_SKILL1,//c67
	TEXT_SKILLNAME_NPC_MERCHANT_SKILL2,
	TEXT_SKILLNAME_NPC_MERCHANT_SKILL3,
	TEXT_SKILLNAME_NPC_CRAFTMAN_SKILL1,//c68//x
	TEXT_SKILLNAME_NPC_CRAFTMAN_SKILL2,
	TEXT_SKILLNAME_NPC_CRAFTMAN_SKILL3,
	TEXT_SKILLNAME_NPC_MAP_SKILL1,//c69//x
	TEXT_SKILLNAME_NPC_MAP_SKILL2,
	TEXT_SKILLNAME_NPC_MAP_SKILL3,
	TEXT_SKILLNAME_NPC_USERQUEST_SKILL1,//c70//스튜어디스//x
	TEXT_SKILLNAME_NPC_USERQUEST_SKILL2,
	TEXT_SKILLNAME_NPC_USERQUEST_SKILL3,
	TEXT_SKILLNAME_NPC_TRAVEL_SKILL1,//c71//이국의여행자//x
	TEXT_SKILLNAME_NPC_TRAVEL_SKILL2,
	TEXT_SKILLNAME_NPC_TRAVEL_SKILL3,
	TEXT_SKILLNAME_NPC_GRANDMA_SKILL1,//c72//할머니//x
	TEXT_SKILLNAME_NPC_GRANDMA_SKILL2,
	TEXT_SKILLNAME_NPC_GRANDMA_SKILL3,
	TEXT_SKILLNAME_NPC_FISHING_SKILL1,//c73//라피//x
	TEXT_SKILLNAME_NPC_FISHING_SKILL2,
	TEXT_SKILLNAME_NPC_FISHING_SKILL3,
	TEXT_SKILLNAME_NPC_INN_SKILL1,//c74
	TEXT_SKILLNAME_NPC_INN_SKILL2,
	TEXT_SKILLNAME_NPC_INN_SKILL3,
	TEXT_SKILLNAME_NPC_NETITEM_SKILL1,//c75//x
	TEXT_SKILLNAME_NPC_NETITEM_SKILL2,
	TEXT_SKILLNAME_NPC_NETITEM_SKILL3,
	TEXT_SKILLNAME_NPC_MILESE_SKILL1,//c76//x
	TEXT_SKILLNAME_NPC_MILESE_SKILL2,
	TEXT_SKILLNAME_NPC_MILESE_SKILL3,
	TEXT_SKILLNAME_NPC_DOBEL_SKILL1,//c77//x
	TEXT_SKILLNAME_NPC_DOBEL_SKILL2,
	TEXT_SKILLNAME_NPC_DOBEL_SKILL3,
	TEXT_SKILLNAME_NPC_GAGEL_SKILL1,//c78//x
	TEXT_SKILLNAME_NPC_GAGEL_SKILL2,
	TEXT_SKILLNAME_NPC_GAGEL_SKILL3,
	TEXT_SKILLNAME_NPC_MONICA_SKILL1,//c79//x
	TEXT_SKILLNAME_NPC_MONICA_SKILL2,
	TEXT_SKILLNAME_NPC_MONICA_SKILL3,
	TEXT_SKILLNAME_NPC_SHIP_SKILL1,//c80
	TEXT_SKILLNAME_NPC_SHIP_SKILL2,
	TEXT_SKILLNAME_NPC_SHIP_SKILL3,
	TEXT_SKILLNAME_NPC_SEASOLDIER_SKILL1,//c81//아틀란병사//x
	TEXT_SKILLNAME_NPC_SEASOLDIER_SKILL2,
	TEXT_SKILLNAME_NPC_SEASOLDIER_SKILL3,
	TEXT_SKILLNAME_NPC_FRAUD_SKILL1,//c82//x
	TEXT_SKILLNAME_NPC_FRAUD_SKILL2,
	TEXT_SKILLNAME_NPC_FRAUD_SKILL3,
	TEXT_SKILLNAME_NPC_DARIAN_SKILL1,//c83//x
	TEXT_SKILLNAME_NPC_DARIAN_SKILL2,
	TEXT_SKILLNAME_NPC_DARIAN_SKILL3,
	TEXT_SKILLNAME_NPC_LUISE_SKILL1,//c84//x
	TEXT_SKILLNAME_NPC_LUISE_SKILL2,
	TEXT_SKILLNAME_NPC_LUISE_SKILL3,
	TEXT_SKILLNAME_NPC_SEAUNCLE_SKILL1,//c85//아틀란아저씨//x
	TEXT_SKILLNAME_NPC_SEAUNCLE_SKILL2,
	TEXT_SKILLNAME_NPC_SEAUNCLE_SKILL3,
	TEXT_SKILLNAME_NPC_SEABOY_SKILL1,//c86//아틀란소년//x
	TEXT_SKILLNAME_NPC_SEABOY_SKILL2,
	TEXT_SKILLNAME_NPC_SEABOY_SKILL3,
	TEXT_SKILLNAME_NPC_DONALD_SKILL1,//c87//이소룡//x
	TEXT_SKILLNAME_NPC_DONALD_SKILL2,
	TEXT_SKILLNAME_NPC_DONALD_SKILL3,
	TEXT_SKILLNAME_NPC_SCHOLAR_SKILL1,//c88//학자//x
	TEXT_SKILLNAME_NPC_SCHOLAR_SKILL2,
	TEXT_SKILLNAME_NPC_SCHOLAR_SKILL3,
	TEXT_SKILLNAME_NPC_CHEF_SKILL1,//c89//요리대가//x
	TEXT_SKILLNAME_NPC_CHEF_SKILL2,
	TEXT_SKILLNAME_NPC_CHEF_SKILL3,
	TEXT_SKILLNAME_NPC_BISTRO_SKILL1,//c90//비스트로//x
	TEXT_SKILLNAME_NPC_BISTRO_SKILL2,
	TEXT_SKILLNAME_NPC_BISTRO_SKILL3,
	TEXT_SKILLNAME_NPC_MAID_SKILL1,//c91//시녀//x
	TEXT_SKILLNAME_NPC_MAID_SKILL2,
	TEXT_SKILLNAME_NPC_MAID_SKILL3,
	TEXT_SKILLNAME_NPC_ADELKNIGHT_SKILL1,//c92//기사//x
	TEXT_SKILLNAME_NPC_ADELKNIGHT_SKILL2,
	TEXT_SKILLNAME_NPC_ADELKNIGHT_SKILL3,
	TEXT_SKILLNAME_NPC_SEBASTIAN_SKILL1,//c93//세바스찬//x
	TEXT_SKILLNAME_NPC_SEBASTIAN_SKILL2,
	TEXT_SKILLNAME_NPC_SEBASTIAN_SKILL3,
	TEXT_SKILLNAME_NPC_NOBLEMAN_SKILL1,//c94//귀족아저씨//x
	TEXT_SKILLNAME_NPC_NOBLEMAN_SKILL2,
	TEXT_SKILLNAME_NPC_NOBLEMAN_SKILL3,
	TEXT_SKILLNAME_NPC_DELPIOS_SKILL1,//c95//델피오스//x
	TEXT_SKILLNAME_NPC_DELPIOS_SKILL2,
	TEXT_SKILLNAME_NPC_DELPIOS_SKILL3,
	TEXT_SKILLNAME_NPC_LORA_SKILL1,//c96//로라//x
	TEXT_SKILLNAME_NPC_LORA_SKILL2,
	TEXT_SKILLNAME_NPC_LORA_SKILL3,
	TEXT_SKILLNAME_NPC_WITCH_SKILL1,//c97//마녀//x
	TEXT_SKILLNAME_NPC_WITCH_SKILL2,
	TEXT_SKILLNAME_NPC_WITCH_SKILL3,
	TEXT_SKILLNAME_NPC_ELFGRANDFA_SKILL1,//c98//엘프할아버지//x
	TEXT_SKILLNAME_NPC_ELFGRANDFA_SKILL2,
	TEXT_SKILLNAME_NPC_ELFGRANDFA_SKILL3,
	TEXT_SKILLNAME_NPC_ELFUNCLE_SKILL1,//c99//엘프아저씨//x
	TEXT_SKILLNAME_NPC_ELFUNCLE_SKILL2,
	TEXT_SKILLNAME_NPC_ELFUNCLE_SKILL3,
	TEXT_SKILLNAME_NPC_ELFAUNT_SKILL1,//c100//엘프아줌마//x
	TEXT_SKILLNAME_NPC_ELFAUNT_SKILL2,
	TEXT_SKILLNAME_NPC_ELFAUNT_SKILL3,
	TEXT_SKILLNAME_NPC_ELFMAN_SKILL1,//c101//엘프청년//x
	TEXT_SKILLNAME_NPC_ELFMAN_SKILL2,
	TEXT_SKILLNAME_NPC_ELFMAN_SKILL3,
	TEXT_SKILLNAME_NPC_ELFWOMAN_SKILL1,//c102//엘프처녀//x
	TEXT_SKILLNAME_NPC_ELFWOMAN_SKILL2,
	TEXT_SKILLNAME_NPC_ELFWOMAN_SKILL3,
	TEXT_SKILLNAME_NPC_ELFBOY_SKILL1,//c103//엘프꼬마남//x
	TEXT_SKILLNAME_NPC_ELFBOY_SKILL2,
	TEXT_SKILLNAME_NPC_ELFBOY_SKILL3,
	TEXT_SKILLNAME_NPC_ELFGIRL_SKILL1,//c104//엘프꼬마녀//x
	TEXT_SKILLNAME_NPC_ELFGIRL_SKILL2,
	TEXT_SKILLNAME_NPC_ELFGIRL_SKILL3,
	TEXT_SKILLNAME_NPC_ELFDARK_SKILL1,//c105//엘프다크//x
	TEXT_SKILLNAME_NPC_ELFDARK_SKILL2,
	TEXT_SKILLNAME_NPC_ELFDARK_SKILL3,
	TEXT_SKILLNAME_NPC_ELFMAGIC_SKILL1,//c106//엘프마법사//x
	TEXT_SKILLNAME_NPC_ELFMAGIC_SKILL2,
	TEXT_SKILLNAME_NPC_ELFMAGIC_SKILL3,
	TEXT_SKILLNAME_NPC_ELFDANCER_SKILL1,//c107//엘프무희//x
	TEXT_SKILLNAME_NPC_ELFDANCER_SKILL2,
	TEXT_SKILLNAME_NPC_ELFDANCER_SKILL3,
	TEXT_SKILLNAME_NPC_OWL_SKILL1,//c108//부엉이//x
	TEXT_SKILLNAME_NPC_OWL_SKILL2,
	TEXT_SKILLNAME_NPC_OWL_SKILL3,
	TEXT_SKILLNAME_NPC_LABETH_SKILL1,//c109//라베스//x
	TEXT_SKILLNAME_NPC_LABETH_SKILL2,
	TEXT_SKILLNAME_NPC_LABETH_SKILL3,
	TEXT_SKILLNAME_NPC_ELKEIN_SKILL1,//c110//엘케인//x
	TEXT_SKILLNAME_NPC_ELKEIN_SKILL2,
	TEXT_SKILLNAME_NPC_ELKEIN_SKILL3,
	TEXT_SKILLNAME_NPC_ELEIN_SKILL1,//c111//엘레인//x
	TEXT_SKILLNAME_NPC_ELEIN_SKILL2,
	TEXT_SKILLNAME_NPC_ELEIN_SKILL3,
	TEXT_SKILLNAME_NPC_EVAN_SKILL1,//c112//에번//x
	TEXT_SKILLNAME_NPC_EVAN_SKILL2,
	TEXT_SKILLNAME_NPC_EVAN_SKILL3,
	TEXT_SKILLNAME_NPC_BEAD_SKILL1,//c113//테이블//x
	TEXT_SKILLNAME_NPC_BEAD_SKILL2,
	TEXT_SKILLNAME_NPC_BEAD_SKILL3,
	TEXT_SKILLNAME_NPC_FOUNTAIN_SKILL1,//c114//샘물//x
	TEXT_SKILLNAME_NPC_FOUNTAIN_SKILL2,
	TEXT_SKILLNAME_NPC_FOUNTAIN_SKILL3,
	TEXT_SKILLNAME_NPC_NEZAR_SKILL1,//c115//네자르//x
	TEXT_SKILLNAME_NPC_NEZAR_SKILL2,
	TEXT_SKILLNAME_NPC_NEZAR_SKILL3,
	TEXT_SKILLNAME_NPC_GALLAND_SKILL1,//c116//갈란드//x
	TEXT_SKILLNAME_NPC_GALLAND_SKILL2,
	TEXT_SKILLNAME_NPC_GALLAND_SKILL3,
	TEXT_SKILLNAME_NPC_DURAK_SKILL1,//c117//듀라크//x
	TEXT_SKILLNAME_NPC_DURAK_SKILL2,
	TEXT_SKILLNAME_NPC_DURAK_SKILL3,
	TEXT_SKILLNAME_NPC_KING_SKILL1,//c118//에드몬드//x
	TEXT_SKILLNAME_NPC_KING_SKILL2,
	TEXT_SKILLNAME_NPC_KING_SKILL3,
	TEXT_SKILLNAME_NPC_WOMANGHOST_SKILL1,//c119//여자유령//x
	TEXT_SKILLNAME_NPC_WOMANGHOST_SKILL2,
	TEXT_SKILLNAME_NPC_WOMANGHOST_SKILL3,
	TEXT_SKILLNAME_NPC_MANGHOST_SKILL1,//c120//남자유령//x
	TEXT_SKILLNAME_NPC_MANGHOST_SKILL2,
	TEXT_SKILLNAME_NPC_MANGHOST_SKILL3,
	TEXT_SKILLNAME_NPC_AUSTIN_SKILL1,//c121//오스틴(유령)//x
	TEXT_SKILLNAME_NPC_AUSTIN_SKILL2,
	TEXT_SKILLNAME_NPC_AUSTIN_SKILL3,
	TEXT_SKILLNAME_NPC_SOUL_SKILL1,//c122//마왕의 심장//x
	TEXT_SKILLNAME_NPC_SOUL_SKILL2,
	TEXT_SKILLNAME_NPC_SOUL_SKILL3,

	TEXT_SKILLDESC_COMMON_ROBIN1,//힘단련 : STR 상승
	TEXT_SKILLDESC_COMMON_ROBIN2,//체력단련 : VIT 상승
	TEXT_SKILLDESC_COMMON_ROBIN3,//민첩단련 : AGI 상승
	TEXT_SKILLDESC_COMMON_ROBIN4,//정신단련 : INT 상승
	TEXT_SKILLDESC_COMMON_ROBIN5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLDESC_COMMON_ROBIN6,//기력강화 : MP 최대치 상승
	TEXT_SKILLDESC_COMMON_ROBIN7,//무기숙련 : 공격력 증가
	TEXT_SKILLDESC_COMMON_ROBIN8,//방어구숙련: 방어력 증가
	TEXT_SKILLDESC_COMMON_ROBIN9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLDESC_COMMON_ROBIN10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLDESC_COMMON_ROBIN11,//뚝심 : 데미지 경감
	TEXT_SKILLDESC_COMMON_ROBIN12,//정조준 : 명중 증가
	TEXT_SKILLDESC_COMMON_ROBIN13,//신속회피 : 회피 증가

	TEXT_SKILLDESC_ROBIN1,//검술숙련 : 관통 발생 확률 상승
	TEXT_SKILLDESC_ROBIN2,//긴급방어 : 방어 발동 확률이 올라감(1레벨이면 방어 발동이 시작, 점점 확률 상승)
	TEXT_SKILLDESC_ROBIN3,//방어숙련 : 방어 발동시 경감되는 데미지 퍼센트 상승
	TEXT_SKILLDESC_ROBIN4,//면역력 : 상태이상에 대한 저항력 상승
	TEXT_SKILLDESC_ROBIN5,//지구전 : INT가 높을수록 VIT 상승
	TEXT_SKILLDESC_ROBIN6,//에어크래쉬 : 몹 뛰우기
	TEXT_SKILLDESC_ROBIN7,//마구찌르기 : 난타
	TEXT_SKILLDESC_ROBIN8,//부스트슬래쉬 : 가로로 크게 배기, 기절공격
	TEXT_SKILLDESC_ROBIN9,//하이퍼차지 : 돌격공격, 적을 뒤로 날려버림
	TEXT_SKILLDESC_ROBIN10,//소울크래쉬 : 기절
	TEXT_SKILLDESC_ROBIN11,//앱솔루트피어스 : 찔러서회전
	TEXT_SKILLDESC_ROBIN12,//멸살연참 : 연속기
	TEXT_SKILLDESC_ROBIN13,//방어태세 : 일정시간 VIT 상승
	TEXT_SKILLDESC_ROBIN14,//정신소모 : MP 소모하여 데미지 경감
	TEXT_SKILLDESC_ROBIN15,//여유포착 : 적 공격 회피시 HP 상승
	TEXT_SKILLDESC_ROBIN16,//냉정침착 : 데미지 입으면 HP 회복
	TEXT_SKILLDESC_ROBIN17,//리플렉터 : 확률로데미지 반사

	TEXT_SKILLDESC_COMMON_DIANA1,//힘단련 : STR 상승
	TEXT_SKILLDESC_COMMON_DIANA2,//체력단련 : VIT 상승
	TEXT_SKILLDESC_COMMON_DIANA3,//민첩단련 : AGI 상승
	TEXT_SKILLDESC_COMMON_DIANA4,//정신단련 : INT 상승
	TEXT_SKILLDESC_COMMON_DIANA5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLDESC_COMMON_DIANA6,//기력강화 : MP 최대치 상승
	TEXT_SKILLDESC_COMMON_DIANA7,//무기숙련 : 공격력 증가
	TEXT_SKILLDESC_COMMON_DIANA8,//방어구숙련: 방어력 증가
	TEXT_SKILLDESC_COMMON_DIANA9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLDESC_COMMON_DIANA10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLDESC_COMMON_DIANA11,//뚝심 : 데미지 경감
	TEXT_SKILLDESC_COMMON_DIANA12,//정조준 : 명중 증가
	TEXT_SKILLDESC_COMMON_DIANA13,//신속회피 : 회피 증가

	TEXT_SKILLDESC_DIANA1,//매의눈 : 공격 거리 상승
	TEXT_SKILLDESC_DIANA2,//사격숙련 : 기절공격이 발생할 확률이 상승
	TEXT_SKILLDESC_DIANA3,//아드레날린 : 기절공격 성공시 MP 회복량 상승
	TEXT_SKILLDESC_DIANA4,//활성화 : 스킬 재사용 시간 감소
	TEXT_SKILLDESC_DIANA5,//집중력유지 : STR이 높을수록 INT 상승
	TEXT_SKILLDESC_DIANA6,//3way : 3방향으로 총 발사
	TEXT_SKILLDESC_DIANA7,//리플렉션빔 : 레이져가 벽에 튕김
	TEXT_SKILLDESC_DIANA8,//헬파이어 : 화염 방사기
	TEXT_SKILLDESC_DIANA9,//로켓런쳐 : 로켓 발사되어 폭발
	TEXT_SKILLDESC_DIANA10,//호밍미사일 : 유도탄 3개
	TEXT_SKILLDESC_DIANA11,//킬링존 : 난사
	TEXT_SKILLDESC_DIANA12,//오비탈레이져 : 인공위성
	TEXT_SKILLDESC_DIANA13,//리커버리 : 회복탄
	TEXT_SKILLDESC_DIANA14,//흥분고조 : 방어력 저하 공격력 상승
	TEXT_SKILLDESC_DIANA15,//흡마의마탄 : 공격시 MP 흡수
	TEXT_SKILLDESC_DIANA16,//필살집중 : 크리 상승
	TEXT_SKILLDESC_DIANA17,//파마의직격 : 일정시간 적 방어 무시

	TEXT_SKILLDESC_COMMON_MAXX1,//힘단련 : STR 상승
	TEXT_SKILLDESC_COMMON_MAXX2,//체력단련 : VIT 상승
	TEXT_SKILLDESC_COMMON_MAXX3,//민첩단련 : AGI 상승
	TEXT_SKILLDESC_COMMON_MAXX4,//정신단련 : INT 상승
	TEXT_SKILLDESC_COMMON_MAXX5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLDESC_COMMON_MAXX6,//기력강화 : MP 최대치 상승
	TEXT_SKILLDESC_COMMON_MAXX7,//무기숙련 : 공격력 증가
	TEXT_SKILLDESC_COMMON_MAXX8,//방어구숙련: 방어력 증가
	TEXT_SKILLDESC_COMMON_MAXX9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLDESC_COMMON_MAXX10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLDESC_COMMON_MAXX11,//뚝심 : 데미지 경감
	TEXT_SKILLDESC_COMMON_MAXX12,//정조준 : 명중 증가
	TEXT_SKILLDESC_COMMON_MAXX13,//신속회피 : 회피 증가

	TEXT_SKILLDESC_MAXX1,//관통력숙련 : 적을 공격했을 때 부메랑의 판정이 남아있을 확률이 상승한다.
	TEXT_SKILLDESC_MAXX2,//투척숙련 : 부메랑 속도 상승
	TEXT_SKILLDESC_MAXX3,//연속공격 : 추가 공격 확률 증가
	TEXT_SKILLDESC_MAXX4,//회전력상승 : 추가 공격 성공시 해당 공격에 대해서 데미지 상승
	TEXT_SKILLDESC_MAXX5,//탄력성 : VIT 높을수록 AGI 상승
	TEXT_SKILLDESC_MAXX6,//효율적사고 : INT가 높을수록 AGI가 올라감
	TEXT_SKILLDESC_MAXX7,//돌려차기 : 회전, 기절공격
	TEXT_SKILLDESC_MAXX8,//숏헌트 : 관통, 사거리 짧음
	TEXT_SKILLDESC_MAXX9,//에어헌트 : 수직 상승 공격
	TEXT_SKILLDESC_MAXX10,//캠핑헌트 : 앞으로 날라가서 제자리회전
	TEXT_SKILLDESC_MAXX11,//호밍헌트 : 가장 가까운 적 때리고 되돌아옴
	TEXT_SKILLDESC_MAXX12,//써클헌트 : 주인공 주변 보호
	TEXT_SKILLDESC_MAXX13,//메가헌트 : 관통후 뒤에서 돌아옴
	TEXT_SKILLDESC_MAXX14,//블러드헌트 : 적 공격시 HP 회복
	TEXT_SKILLDESC_MAXX15,//현란무도 : 일정시간 회피율 증가
	TEXT_SKILLDESC_MAXX16,//안도의한숨 : 적 공격 회피시 MP 회복
	TEXT_SKILLDESC_MAXX17,//혼신분리 : 기절 확률 상승

	TEXT_SKILLDESC_ENEMYSNAIL_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_SKILL1,	//스파크18//
	TEXT_SKILLDESC_ENEMYLIGHTNING_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_SKILL1,	//라이트 스피릿21
	TEXT_SKILLDESC_ENEMYFAIRY_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_SKILL1,	//스트라이더23
	TEXT_SKILLDESC_ENEMYSPIDER_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLDESC_ENEMYGOLEM_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_SKILL1,	//그레이트 아머25
	TEXT_SKILLDESC_ENEMYDARKGIANT_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_SKILL1,	//우로보로스26(x 예는 그냥 안됨)
	TEXT_SKILLDESC_ENEMYDARKDRAGON_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLDESC_ENEMYDRAGON1_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_SKILL1,	//드래곤 좀비28
	TEXT_SKILLDESC_ENEMYDRAGON2_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_SKILL1,	//떠도는 영혼29
	TEXT_SKILLDESC_ENEMYGHOST_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_SKILL1,	//무혼의 기사30
	TEXT_SKILLDESC_ENEMYPUMPKIN_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴(?)
	TEXT_SKILLDESC_ENEMYCASTLE1_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLDESC_ENEMYCASTLE2_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_SKILL1,	//안드로볼33
	TEXT_SKILLDESC_ENEMYSPACE1_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_SKILL1,	//메탈가우스34
	TEXT_SKILLDESC_ENEMYSPACE2_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_SKILL1,	//토드뮤턴트35
	TEXT_SKILLDESC_ENEMYFROG_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_SKILL1,	//아르곤36
	TEXT_SKILLDESC_ENEMYLARVA_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_SKILL1,	//카툼37
	TEXT_SKILLDESC_ENEMYSALAMANDER_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_SKILL1,	//고대의 수호자38
	TEXT_SKILLDESC_ENEMYGIANT_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_SKILL1,	//이프리트39
	TEXT_SKILLDESC_ENEMYIFRIT_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_SKILL1,	//프로스트40
	TEXT_SKILLDESC_ENEMYMAMMOTH_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_SKILL1,	//라이오너41		(x)			//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_SKILL1,	//호루스42
	TEXT_SKILLDESC_ENEMYANGEL_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_SKILL1,	//마도합성수43
	TEXT_SKILLDESC_ENEMYKIMERA_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_SKILL1,	//고대의 방주44 (x)
	TEXT_SKILLDESC_ENEMYSHIP_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_SKILL1,	//아리만45
	TEXT_SKILLDESC_ENEMYFOGRA_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_SKILL1,	//티어맷46 (x)
	TEXT_SKILLDESC_ENEMYBAHAMUT_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_SKILL1,	//사신47
	TEXT_SKILLDESC_ENEMYDEATH_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_SKILL1,	//데브리온48 (x)
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_SKILL1,	//엘케인맨티스49
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_SKILL1,	//쉐도우 테트라쿤50 -> 제외 (x)
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_SKILL1,	//라베스 보스52 (x)
	TEXT_SKILLDESC_ENEMYLABETH_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_SKILL3,

	TEXT_SKILLDESC_ENEMYSNAIL_RED_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_RED_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_RED_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_RED_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_RED_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_RED_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_RED_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_RED_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_RED_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_RED_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_RED_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_RED_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_RED_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_RED_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_RED_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_RED_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_RED_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_RED_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_RED_SKILL1,	//라이트 스피릿21
	TEXT_SKILLDESC_ENEMYFAIRY_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_RED_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_RED_SKILL1,	//스트라이더23
	TEXT_SKILLDESC_ENEMYSPIDER_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_RED_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLDESC_ENEMYGOLEM_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_RED_SKILL1,	//그레이트 아머25
	TEXT_SKILLDESC_ENEMYDARKGIANT_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_RED_SKILL1,	//우로보로스26
	TEXT_SKILLDESC_ENEMYDARKDRAGON_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_RED_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLDESC_ENEMYDRAGON1_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_RED_SKILL1,	//드래곤 좀비28
	TEXT_SKILLDESC_ENEMYDRAGON2_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_RED_SKILL1,	//떠도는 영혼29
	TEXT_SKILLDESC_ENEMYGHOST_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_RED_SKILL1,	//무혼의 기사30
	TEXT_SKILLDESC_ENEMYPUMPKIN_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_RED_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_RED_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLDESC_ENEMYCASTLE2_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_RED_SKILL1,	//안드로볼33
	TEXT_SKILLDESC_ENEMYSPACE1_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_RED_SKILL1,	//메탈가우스34
	TEXT_SKILLDESC_ENEMYSPACE2_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_RED_SKILL1,	//토드뮤턴트35
	TEXT_SKILLDESC_ENEMYFROG_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_RED_SKILL1,	//아르곤36
	TEXT_SKILLDESC_ENEMYLARVA_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_RED_SKILL1,	//카툼37
	TEXT_SKILLDESC_ENEMYSALAMANDER_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_RED_SKILL1,	//고대의 수호자38
	TEXT_SKILLDESC_ENEMYGIANT_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_RED_SKILL1,	//이프리트39
	TEXT_SKILLDESC_ENEMYIFRIT_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_RED_SKILL1,	//프로스트40
	TEXT_SKILLDESC_ENEMYMAMMOTH_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_RED_SKILL1,	//라이오너41					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_RED_SKILL1,	//호루스42
	TEXT_SKILLDESC_ENEMYANGEL_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_RED_SKILL1,	//마도합성수43
	TEXT_SKILLDESC_ENEMYKIMERA_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_RED_SKILL1,	//고대의 방주44
	TEXT_SKILLDESC_ENEMYSHIP_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_RED_SKILL1,	//아리만45
	TEXT_SKILLDESC_ENEMYFOGRA_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_RED_SKILL1,	//티어맷46
	TEXT_SKILLDESC_ENEMYBAHAMUT_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_RED_SKILL1,	//사신47
	TEXT_SKILLDESC_ENEMYDEATH_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_RED_SKILL1,	//데브리온48
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_RED_SKILL1,	//엘케인맨티스49
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_RED_SKILL1,	//쉐도우 테트라쿤50 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_RED_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_RED_SKILL1,	//라베스 보스52
	TEXT_SKILLDESC_ENEMYLABETH_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_RED_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_RED_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_RED_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_RED_SKILL3,

	TEXT_SKILLDESC_ENEMYSNAIL_BLUE_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_BLUE_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_BLUE_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_BLUE_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_BLUE_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLUE_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_BLUE_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_BLUE_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_BLUE_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_BLUE_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_BLUE_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_BLUE_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_BLUE_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLUE_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_BLUE_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLUE_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_BLUE_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLUE_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_BLUE_SKILL1,	//라이트 스피릿21
	TEXT_SKILLDESC_ENEMYFAIRY_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_BLUE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_BLUE_SKILL1,	//스트라이더23
	TEXT_SKILLDESC_ENEMYSPIDER_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_BLUE_SKILL1,	//주인잃은 골렘24
	TEXT_SKILLDESC_ENEMYGOLEM_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLUE_SKILL1,	//그레이트 아머25
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLUE_SKILL1,	//우로보로스26
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_BLUE_SKILL1,	//탐욕의 살육자27
	TEXT_SKILLDESC_ENEMYDRAGON1_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_BLUE_SKILL1,	//드래곤 좀비28
	TEXT_SKILLDESC_ENEMYDRAGON2_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_BLUE_SKILL1,	//떠도는 영혼29
	TEXT_SKILLDESC_ENEMYGHOST_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLUE_SKILL1,	//무혼의 기사30
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_BLUE_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈31		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_BLUE_SKILL1,	//공허한 갑주	//큰 기사32
	TEXT_SKILLDESC_ENEMYCASTLE2_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_BLUE_SKILL1,	//안드로볼33
	TEXT_SKILLDESC_ENEMYSPACE1_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_BLUE_SKILL1,	//메탈가우스34
	TEXT_SKILLDESC_ENEMYSPACE2_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_BLUE_SKILL1,	//토드뮤턴트35
	TEXT_SKILLDESC_ENEMYFROG_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_BLUE_SKILL1,	//아르곤36
	TEXT_SKILLDESC_ENEMYLARVA_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLUE_SKILL1,	//카툼37
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_BLUE_SKILL1,	//고대의 수호자38
	TEXT_SKILLDESC_ENEMYGIANT_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_BLUE_SKILL1,	//이프리트39
	TEXT_SKILLDESC_ENEMYIFRIT_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLUE_SKILL1,	//프로스트40
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_BLUE_SKILL1,	//라이오너41					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_BLUE_SKILL1,	//호루스42
	TEXT_SKILLDESC_ENEMYANGEL_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_BLUE_SKILL1,	//마도합성수43
	TEXT_SKILLDESC_ENEMYKIMERA_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_BLUE_SKILL1,	//고대의 방주44
	TEXT_SKILLDESC_ENEMYSHIP_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_BLUE_SKILL1,	//아리만45
	TEXT_SKILLDESC_ENEMYFOGRA_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLUE_SKILL1,	//티어맷46
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_BLUE_SKILL1,	//사신47
	TEXT_SKILLDESC_ENEMYDEATH_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLUE_SKILL1,	//데브리온48
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLUE_SKILL1,	//엘케인맨티스49
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLUE_SKILL1,	//쉐도우 테트라쿤50 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLUE_SKILL1,	//다크나이트51						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_BLUE_SKILL1,	//라베스 보스52
	TEXT_SKILLDESC_ENEMYLABETH_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_BLUE_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_BLUE_SKILL1,	//엘케인 보스53				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_BLUE_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_BLUE_SKILL3,

	TEXT_SKILLDESC_ENEMYSNAIL_PURPLE_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_PURPLE_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_PURPLE_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_PURPLE_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_PURPLE_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_PURPLE_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_PURPLE_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_PURPLE_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_PURPLE_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_PURPLE_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_PURPLE_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_PURPLE_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_PURPLE_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_PURPLE_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_PURPLE_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_PURPLE_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_PURPLE_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_PURPLE_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_PURPLE_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLDESC_ENEMYFAIRY_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_PURPLE_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_PURPLE_SKILL1,	//스트라이더25
	TEXT_SKILLDESC_ENEMYSPIDER_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_PURPLE_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLDESC_ENEMYGOLEM_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_PURPLE_SKILL1,	//그레이트 아머27
	TEXT_SKILLDESC_ENEMYDARKGIANT_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_PURPLE_SKILL1,	//우로보로스28
	TEXT_SKILLDESC_ENEMYDARKDRAGON_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_PURPLE_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLDESC_ENEMYDRAGON1_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_PURPLE_SKILL1,	//드래곤 좀비30
	TEXT_SKILLDESC_ENEMYDRAGON2_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_PURPLE_SKILL1,	//떠도는 영혼31
	TEXT_SKILLDESC_ENEMYGHOST_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_PURPLE_SKILL1,	//무혼의 기사32
	TEXT_SKILLDESC_ENEMYPUMPKIN_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_PURPLE_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_PURPLE_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLDESC_ENEMYCASTLE2_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_PURPLE_SKILL1,	//안드로볼35
	TEXT_SKILLDESC_ENEMYSPACE1_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_PURPLE_SKILL1,	//메탈가우스36
	TEXT_SKILLDESC_ENEMYSPACE2_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_PURPLE_SKILL1,	//토드뮤턴트37
	TEXT_SKILLDESC_ENEMYFROG_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_PURPLE_SKILL1,	//아르곤38
	TEXT_SKILLDESC_ENEMYLARVA_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_PURPLE_SKILL1,	//카툼39
	TEXT_SKILLDESC_ENEMYSALAMANDER_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_PURPLE_SKILL1,	//고대의 수호자40
	TEXT_SKILLDESC_ENEMYGIANT_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_PURPLE_SKILL1,	//이프리트41
	TEXT_SKILLDESC_ENEMYIFRIT_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_PURPLE_SKILL1,	//프로스트42
	TEXT_SKILLDESC_ENEMYMAMMOTH_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_PURPLE_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_PURPLE_SKILL1,	//호루스44
	TEXT_SKILLDESC_ENEMYANGEL_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_PURPLE_SKILL1,	//마도합성수45
	TEXT_SKILLDESC_ENEMYKIMERA_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_PURPLE_SKILL1,	//고대의 방주46
	TEXT_SKILLDESC_ENEMYSHIP_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_PURPLE_SKILL1,	//아리만47
	TEXT_SKILLDESC_ENEMYFOGRA_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_PURPLE_SKILL1,	//티어맷48
	TEXT_SKILLDESC_ENEMYBAHAMUT_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_PURPLE_SKILL1,	//사신49
	TEXT_SKILLDESC_ENEMYDEATH_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_PURPLE_SKILL1,	//데브리온50
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_PURPLE_SKILL1,	//엘케인맨티스51
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_PURPLE_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_PURPLE_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_PURPLE_SKILL1,	//라베스 보스54
	TEXT_SKILLDESC_ENEMYLABETH_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_PURPLE_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_PURPLE_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_PURPLE_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_PURPLE_SKILL3,

	TEXT_SKILLDESC_ENEMYSNAIL_GREEN_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_GREEN_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_GREEN_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_GREEN_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_GREEN_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_GREEN_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_GREEN_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_GREEN_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_GREEN_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_GREEN_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_GREEN_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_GREEN_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_GREEN_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_GREEN_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_GREEN_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_GREEN_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_GREEN_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_GREEN_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_GREEN_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLDESC_ENEMYFAIRY_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_GREEN_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_GREEN_SKILL1,	//스트라이더25
	TEXT_SKILLDESC_ENEMYSPIDER_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_GREEN_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLDESC_ENEMYGOLEM_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_GREEN_SKILL1,	//그레이트 아머27
	TEXT_SKILLDESC_ENEMYDARKGIANT_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GREEN_SKILL1,	//우로보로스28
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_GREEN_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLDESC_ENEMYDRAGON1_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_GREEN_SKILL1,	//드래곤 좀비30
	TEXT_SKILLDESC_ENEMYDRAGON2_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_GREEN_SKILL1,	//떠도는 영혼31
	TEXT_SKILLDESC_ENEMYGHOST_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_GREEN_SKILL1,	//무혼의 기사32
	TEXT_SKILLDESC_ENEMYPUMPKIN_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_GREEN_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_GREEN_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLDESC_ENEMYCASTLE2_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_GREEN_SKILL1,	//안드로볼35
	TEXT_SKILLDESC_ENEMYSPACE1_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_GREEN_SKILL1,	//메탈가우스36
	TEXT_SKILLDESC_ENEMYSPACE2_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_GREEN_SKILL1,	//토드뮤턴트37
	TEXT_SKILLDESC_ENEMYFROG_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_GREEN_SKILL1,	//아르곤38
	TEXT_SKILLDESC_ENEMYLARVA_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_GREEN_SKILL1,	//카툼39
	TEXT_SKILLDESC_ENEMYSALAMANDER_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_GREEN_SKILL1,	//고대의 수호자40
	TEXT_SKILLDESC_ENEMYGIANT_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_GREEN_SKILL1,	//이프리트41
	TEXT_SKILLDESC_ENEMYIFRIT_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_GREEN_SKILL1,	//프로스트42
	TEXT_SKILLDESC_ENEMYMAMMOTH_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_GREEN_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_GREEN_SKILL1,	//호루스44
	TEXT_SKILLDESC_ENEMYANGEL_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_GREEN_SKILL1,	//마도합성수45
	TEXT_SKILLDESC_ENEMYKIMERA_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_GREEN_SKILL1,	//고대의 방주46
	TEXT_SKILLDESC_ENEMYSHIP_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_GREEN_SKILL1,	//아리만47
	TEXT_SKILLDESC_ENEMYFOGRA_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_GREEN_SKILL1,	//티어맷48
	TEXT_SKILLDESC_ENEMYBAHAMUT_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_GREEN_SKILL1,	//사신49
	TEXT_SKILLDESC_ENEMYDEATH_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GREEN_SKILL1,	//데브리온50
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GREEN_SKILL1,	//엘케인맨티스51
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GREEN_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GREEN_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_GREEN_SKILL1,	//라베스 보스54
	TEXT_SKILLDESC_ENEMYLABETH_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_GREEN_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_GREEN_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_GREEN_SKILL3,
	TEXT_SKILLDESC_ENEMYSNAIL_GOLD_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_GOLD_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_GOLD_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_GOLD_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_GOLD_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_GOLD_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_GOLD_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_GOLD_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_GOLD_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_GOLD_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_GOLD_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_GOLD_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_GOLD_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_GOLD_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_GOLD_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_GOLD_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_GOLD_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_GOLD_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_GOLD_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLDESC_ENEMYFAIRY_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_GOLD_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_GOLD_SKILL1,	//스트라이더25
	TEXT_SKILLDESC_ENEMYSPIDER_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_GOLD_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLDESC_ENEMYGOLEM_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_GOLD_SKILL1,	//그레이트 아머27
	TEXT_SKILLDESC_ENEMYDARKGIANT_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GOLD_SKILL1,	//우로보로스28
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_GOLD_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLDESC_ENEMYDRAGON1_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_GOLD_SKILL1,	//드래곤 좀비30
	TEXT_SKILLDESC_ENEMYDRAGON2_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_GOLD_SKILL1,	//떠도는 영혼31
	TEXT_SKILLDESC_ENEMYGHOST_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_GOLD_SKILL1,	//무혼의 기사32
	TEXT_SKILLDESC_ENEMYPUMPKIN_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_GOLD_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_GOLD_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLDESC_ENEMYCASTLE2_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_GOLD_SKILL1,	//안드로볼35
	TEXT_SKILLDESC_ENEMYSPACE1_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_GOLD_SKILL1,	//메탈가우스36
	TEXT_SKILLDESC_ENEMYSPACE2_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_GOLD_SKILL1,	//토드뮤턴트37
	TEXT_SKILLDESC_ENEMYFROG_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_GOLD_SKILL1,	//아르곤38
	TEXT_SKILLDESC_ENEMYLARVA_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_GOLD_SKILL1,	//카툼39
	TEXT_SKILLDESC_ENEMYSALAMANDER_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_GOLD_SKILL1,	//고대의 수호자40
	TEXT_SKILLDESC_ENEMYGIANT_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_GOLD_SKILL1,	//이프리트41
	TEXT_SKILLDESC_ENEMYIFRIT_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_GOLD_SKILL1,	//프로스트42
	TEXT_SKILLDESC_ENEMYMAMMOTH_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_GOLD_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_GOLD_SKILL1,	//호루스44
	TEXT_SKILLDESC_ENEMYANGEL_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_GOLD_SKILL1,	//마도합성수45
	TEXT_SKILLDESC_ENEMYKIMERA_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_GOLD_SKILL1,	//고대의 방주46
	TEXT_SKILLDESC_ENEMYSHIP_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_GOLD_SKILL1,	//아리만47
	TEXT_SKILLDESC_ENEMYFOGRA_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_GOLD_SKILL1,	//티어맷48
	TEXT_SKILLDESC_ENEMYBAHAMUT_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_GOLD_SKILL1,	//사신49
	TEXT_SKILLDESC_ENEMYDEATH_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GOLD_SKILL1,	//데브리온50
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GOLD_SKILL1,	//엘케인맨티스51
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GOLD_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GOLD_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_GOLD_SKILL1,	//라베스 보스54
	TEXT_SKILLDESC_ENEMYLABETH_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_GOLD_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_GOLD_SKILL1,	//엘케인 보스55				//문제 여기서부터 4개가 어딘가 화면을 깨지게 함
	TEXT_SKILLDESC_ENEMYELKEIN_GOLD_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_GOLD_SKILL3,

	TEXT_SKILLDESC_ENEMYSNAIL_BLACK_SKILL1,	//가시껍질 달팽이
	TEXT_SKILLDESC_ENEMYSNAIL_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSNAIL_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYTREE_BLACK_SKILL1,	//늪의 주인 4
	TEXT_SKILLDESC_ENEMYTREE_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYTREE_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYONEEYE_BLACK_SKILL1,	//아이볼 5
	TEXT_SKILLDESC_ENEMYONEEYE_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYONEEYE_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSKELETON_BLACK_SKILL1,	//칠흑의 기사 6 
	TEXT_SKILLDESC_ENEMYSKELETON_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSKELETON_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYLIZARD_BLACK_SKILL1,	//사하긴 병사 7
	TEXT_SKILLDESC_ENEMYLIZARD_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYLIZARD_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLACK_SKILL1,	//맹독 해파리8
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYJELLYFISH_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYKNIGHT_BLACK_SKILL1,	//타락한 기사 9
	TEXT_SKILLDESC_ENEMYKNIGHT_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYKNIGHT_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSLIME_BLACK_SKILL1,	//슬라임 10
	TEXT_SKILLDESC_ENEMYSLIME_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSLIME_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSLING_BLACK_SKILL1,	//평원의 도적 11
	TEXT_SKILLDESC_ENEMYSLING_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSLING_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYBOAR_BLACK_SKILL1,	//거친발 멧돼지 12
	TEXT_SKILLDESC_ENEMYBOAR_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYBOAR_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYFLAME_BLACK_SKILL1,	//분노의 정령 13
	TEXT_SKILLDESC_ENEMYFLAME_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYFLAME_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYPHOENIX_BLACK_SKILL1,	//마성의 불새14
	TEXT_SKILLDESC_ENEMYPHOENIX_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYPHOENIX_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYFACE_BLACK_SKILL1,	//결빙의 석상15
	TEXT_SKILLDESC_ENEMYFACE_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYFACE_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLACK_SKILL1,	//스노우맨16
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSNOWMAN_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYICESUN_BLACK_SKILL1,	//아이스마스크17
	TEXT_SKILLDESC_ENEMYICESUN_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYICESUN_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLACK_SKILL1,	//스파크18
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYLIGHTNING_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYTHUNDER_BLACK_SKILL1,	//다크미스트19
	TEXT_SKILLDESC_ENEMYTHUNDER_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYTHUNDER_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLACK_SKILL1,	//스파크 플랜트20
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCRYSTAL_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYFAIRY_BLACK_SKILL1,	//라이트 스피릿2     1
	TEXT_SKILLDESC_ENEMYFAIRY_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYFAIRY_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCIRCLE_BLACK_SKILL1,	//딜루젼 소울22
	TEXT_SKILLDESC_ENEMYCIRCLE_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCIRCLE_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSPIDER_BLACK_SKILL1,	//스트라이더25
	TEXT_SKILLDESC_ENEMYSPIDER_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSPIDER_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYGOLEM_BLACK_SKILL1,	//주인잃은 골렘26
	TEXT_SKILLDESC_ENEMYGOLEM_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYGOLEM_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLACK_SKILL1,	//그레이트 아머27
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKGIANT_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLACK_SKILL1,	//우로보로스28
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYDARKDRAGON_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON1_BLACK_SKILL1,	//탐욕의 살육자29
	TEXT_SKILLDESC_ENEMYDRAGON1_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON1_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYDRAGON2_BLACK_SKILL1,	//드래곤 좀비30
	TEXT_SKILLDESC_ENEMYDRAGON2_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYDRAGON2_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYGHOST_BLACK_SKILL1,	//떠도는 영혼31
	TEXT_SKILLDESC_ENEMYGHOST_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYGHOST_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLACK_SKILL1,	//무혼의 기사32
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYPUMPKIN_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE1_BLACK_SKILL1,	//어둠의 마도사	//텔레포트공격하는놈33		//문제 : 사라지면 안돌아옴
	TEXT_SKILLDESC_ENEMYCASTLE1_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE1_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE2_BLACK_SKILL1,	//공허한 갑주	//큰 기사34
	TEXT_SKILLDESC_ENEMYCASTLE2_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE2_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE1_BLACK_SKILL1,	//안드로볼35
	TEXT_SKILLDESC_ENEMYSPACE1_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE1_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSPACE2_BLACK_SKILL1,	//메탈가우스36
	TEXT_SKILLDESC_ENEMYSPACE2_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSPACE2_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYFROG_BLACK_SKILL1,	//토드뮤턴트37
	TEXT_SKILLDESC_ENEMYFROG_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYFROG_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYLARVA_BLACK_SKILL1,	//아르곤38
	TEXT_SKILLDESC_ENEMYLARVA_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYLARVA_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLACK_SKILL1,	//카툼39
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSALAMANDER_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYGIANT_BLACK_SKILL1,	//고대의 수호자40
	TEXT_SKILLDESC_ENEMYGIANT_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYGIANT_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYIFRIT_BLACK_SKILL1,	//이프리트41
	TEXT_SKILLDESC_ENEMYIFRIT_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYIFRIT_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLACK_SKILL1,	//프로스트42
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYMAMMOTH_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYMACHINE_BLACK_SKILL1,	//라이오너43					//문제 : 모션이 기계 모션이 나옴
	TEXT_SKILLDESC_ENEMYMACHINE_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYMACHINE_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYANGEL_BLACK_SKILL1,	//호루스44
	TEXT_SKILLDESC_ENEMYANGEL_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYANGEL_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYKIMERA_BLACK_SKILL1,	//마도합성수45
	TEXT_SKILLDESC_ENEMYKIMERA_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYKIMERA_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYSHIP_BLACK_SKILL1,	//고대의 방주46
	TEXT_SKILLDESC_ENEMYSHIP_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYSHIP_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYFOGRA_BLACK_SKILL1,	//아리만47
	TEXT_SKILLDESC_ENEMYFOGRA_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYFOGRA_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLACK_SKILL1,	//티어맷48
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYBAHAMUT_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYDEATH_BLACK_SKILL1,	//사신49
	TEXT_SKILLDESC_ENEMYDEATH_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYDEATH_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLACK_SKILL1,	//데브리온50
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS1_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLACK_SKILL1,	//엘케인맨티스51
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS2_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLACK_SKILL1,	//쉐도우 테트라쿤52 -> 제외
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS3_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLACK_SKILL1,	//다크나이트53						//문제 위에 떠서 나옴
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYCASTLE_BOSS4_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYLABETH_BLACK_SKILL1,	//라베스 보스54
	TEXT_SKILLDESC_ENEMYLABETH_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYLABETH_BLACK_SKILL3,
	TEXT_SKILLDESC_ENEMYELKEIN_BLACK_SKILL1,	//엘케인 보스55
	TEXT_SKILLDESC_ENEMYELKEIN_BLACK_SKILL2,
	TEXT_SKILLDESC_ENEMYELKEIN_BLACK_SKILL3,

	TEXT_SKILLDESC_NPC_CAPTAIN_SKILL1,//c52//잭스패너//x
	TEXT_SKILLDESC_NPC_CAPTAIN_SKILL2,
	TEXT_SKILLDESC_NPC_CAPTAIN_SKILL3,
	TEXT_SKILLDESC_NPC_CREW_SKILL1,//c53//선원//x
	TEXT_SKILLDESC_NPC_CREW_SKILL2,
	TEXT_SKILLDESC_NPC_CREW_SKILL3,
	TEXT_SKILLDESC_NPC_GRANDFA_SKILL1,//c54//촌장//x
	TEXT_SKILLDESC_NPC_GRANDFA_SKILL2,
	TEXT_SKILLDESC_NPC_GRANDFA_SKILL3,
	TEXT_SKILLDESC_NPC_UNCLE_SKILL1,//c55//아저씨
	TEXT_SKILLDESC_NPC_UNCLE_SKILL2,
	TEXT_SKILLDESC_NPC_UNCLE_SKILL3,
	TEXT_SKILLDESC_NPC_AUNT_SKILL1,//c56//아줌마//x
	TEXT_SKILLDESC_NPC_AUNT_SKILL2,
	TEXT_SKILLDESC_NPC_AUNT_SKILL3,
	TEXT_SKILLDESC_NPC_MAN_SKILL1,//c57//자경단청년//x
	TEXT_SKILLDESC_NPC_MAN_SKILL2,
	TEXT_SKILLDESC_NPC_MAN_SKILL3,
	TEXT_SKILLDESC_NPC_WOMAN_SKILL1,//c58//처녀//x
	TEXT_SKILLDESC_NPC_WOMAN_SKILL2,
	TEXT_SKILLDESC_NPC_WOMAN_SKILL3,
	TEXT_SKILLDESC_NPC_BOY_SKILL1,//c59//꼬마남//x
	TEXT_SKILLDESC_NPC_BOY_SKILL2,
	TEXT_SKILLDESC_NPC_BOY_SKILL3,
	TEXT_SKILLDESC_NPC_GIRL_SKILL1,//c60//꼬마녀//x
	TEXT_SKILLDESC_NPC_GIRL_SKILL2,
	TEXT_SKILLDESC_NPC_GIRL_SKILL3,
	TEXT_SKILLDESC_NPC_ALMA_SKILL1,//c61//알마//x
	TEXT_SKILLDESC_NPC_ALMA_SKILL2,
	TEXT_SKILLDESC_NPC_ALMA_SKILL3,
	TEXT_SKILLDESC_NPC_ITEM_SKILL1,//c62//터번//x
	TEXT_SKILLDESC_NPC_ITEM_SKILL2,
	TEXT_SKILLDESC_NPC_ITEM_SKILL3,
	TEXT_SKILLDESC_NPC_FATMAN_SKILL1,//c63//x
	TEXT_SKILLDESC_NPC_FATMAN_SKILL2,
	TEXT_SKILLDESC_NPC_FATMAN_SKILL3,
	TEXT_SKILLDESC_NPC_BUNNYGIRL_SKILL1,//c64//x
	TEXT_SKILLDESC_NPC_BUNNYGIRL_SKILL2,
	TEXT_SKILLDESC_NPC_BUNNYGIRL_SKILL3,
	TEXT_SKILLDESC_NPC_KNIGHT_SKILL1,//c65//플레타//x
	TEXT_SKILLDESC_NPC_KNIGHT_SKILL2,
	TEXT_SKILLDESC_NPC_KNIGHT_SKILL3,
	TEXT_SKILLDESC_NPC_DOG_SKILL1,//c66//x
	TEXT_SKILLDESC_NPC_DOG_SKILL2,
	TEXT_SKILLDESC_NPC_DOG_SKILL3,
	TEXT_SKILLDESC_NPC_MERCHANT_SKILL1,//c67
	TEXT_SKILLDESC_NPC_MERCHANT_SKILL2,
	TEXT_SKILLDESC_NPC_MERCHANT_SKILL3,
	TEXT_SKILLDESC_NPC_CRAFTMAN_SKILL1,//c68//x
	TEXT_SKILLDESC_NPC_CRAFTMAN_SKILL2,
	TEXT_SKILLDESC_NPC_CRAFTMAN_SKILL3,
	TEXT_SKILLDESC_NPC_MAP_SKILL1,//c69//x
	TEXT_SKILLDESC_NPC_MAP_SKILL2,
	TEXT_SKILLDESC_NPC_MAP_SKILL3,
	TEXT_SKILLDESC_NPC_USERQUEST_SKILL1,//c70//스튜어디스//x
	TEXT_SKILLDESC_NPC_USERQUEST_SKILL2,
	TEXT_SKILLDESC_NPC_USERQUEST_SKILL3,
	TEXT_SKILLDESC_NPC_TRAVEL_SKILL1,//c71//이국의여행자//x
	TEXT_SKILLDESC_NPC_TRAVEL_SKILL2,
	TEXT_SKILLDESC_NPC_TRAVEL_SKILL3,
	TEXT_SKILLDESC_NPC_GRANDMA_SKILL1,//c72//할머니//x
	TEXT_SKILLDESC_NPC_GRANDMA_SKILL2,
	TEXT_SKILLDESC_NPC_GRANDMA_SKILL3,
	TEXT_SKILLDESC_NPC_FISHING_SKILL1,//c73//라피//x
	TEXT_SKILLDESC_NPC_FISHING_SKILL2,
	TEXT_SKILLDESC_NPC_FISHING_SKILL3,
	TEXT_SKILLDESC_NPC_INN_SKILL1,//c74
	TEXT_SKILLDESC_NPC_INN_SKILL2,
	TEXT_SKILLDESC_NPC_INN_SKILL3,
	TEXT_SKILLDESC_NPC_NETITEM_SKILL1,//c75//x
	TEXT_SKILLDESC_NPC_NETITEM_SKILL2,
	TEXT_SKILLDESC_NPC_NETITEM_SKILL3,
	TEXT_SKILLDESC_NPC_MILESE_SKILL1,//c76//x
	TEXT_SKILLDESC_NPC_MILESE_SKILL2,
	TEXT_SKILLDESC_NPC_MILESE_SKILL3,
	TEXT_SKILLDESC_NPC_DOBEL_SKILL1,//c77//x
	TEXT_SKILLDESC_NPC_DOBEL_SKILL2,
	TEXT_SKILLDESC_NPC_DOBEL_SKILL3,
	TEXT_SKILLDESC_NPC_GAGEL_SKILL1,//c78//x
	TEXT_SKILLDESC_NPC_GAGEL_SKILL2,
	TEXT_SKILLDESC_NPC_GAGEL_SKILL3,
	TEXT_SKILLDESC_NPC_MONICA_SKILL1,//c79//x
	TEXT_SKILLDESC_NPC_MONICA_SKILL2,
	TEXT_SKILLDESC_NPC_MONICA_SKILL3,
	TEXT_SKILLDESC_NPC_SHIP_SKILL1,//c80
	TEXT_SKILLDESC_NPC_SHIP_SKILL2,
	TEXT_SKILLDESC_NPC_SHIP_SKILL3,
	TEXT_SKILLDESC_NPC_SEASOLDIER_SKILL1,//c81//아틀란병사//x
	TEXT_SKILLDESC_NPC_SEASOLDIER_SKILL2,
	TEXT_SKILLDESC_NPC_SEASOLDIER_SKILL3,
	TEXT_SKILLDESC_NPC_FRAUD_SKILL1,//c82//x
	TEXT_SKILLDESC_NPC_FRAUD_SKILL2,
	TEXT_SKILLDESC_NPC_FRAUD_SKILL3,
	TEXT_SKILLDESC_NPC_DARIAN_SKILL1,//c83//x
	TEXT_SKILLDESC_NPC_DARIAN_SKILL2,
	TEXT_SKILLDESC_NPC_DARIAN_SKILL3,
	TEXT_SKILLDESC_NPC_LUISE_SKILL1,//c84//x
	TEXT_SKILLDESC_NPC_LUISE_SKILL2,
	TEXT_SKILLDESC_NPC_LUISE_SKILL3,
	TEXT_SKILLDESC_NPC_SEAUNCLE_SKILL1,//c85//아틀란아저씨//x
	TEXT_SKILLDESC_NPC_SEAUNCLE_SKILL2,
	TEXT_SKILLDESC_NPC_SEAUNCLE_SKILL3,
	TEXT_SKILLDESC_NPC_SEABOY_SKILL1,//c86//아틀란소년//x
	TEXT_SKILLDESC_NPC_SEABOY_SKILL2,
	TEXT_SKILLDESC_NPC_SEABOY_SKILL3,
	TEXT_SKILLDESC_NPC_DONALD_SKILL1,//c87//이소룡//x
	TEXT_SKILLDESC_NPC_DONALD_SKILL2,
	TEXT_SKILLDESC_NPC_DONALD_SKILL3,
	TEXT_SKILLDESC_NPC_SCHOLAR_SKILL1,//c88//학자//x
	TEXT_SKILLDESC_NPC_SCHOLAR_SKILL2,
	TEXT_SKILLDESC_NPC_SCHOLAR_SKILL3,
	TEXT_SKILLDESC_NPC_CHEF_SKILL1,//c89//요리대가//x
	TEXT_SKILLDESC_NPC_CHEF_SKILL2,
	TEXT_SKILLDESC_NPC_CHEF_SKILL3,
	TEXT_SKILLDESC_NPC_BISTRO_SKILL1,//c90//비스트로//x
	TEXT_SKILLDESC_NPC_BISTRO_SKILL2,
	TEXT_SKILLDESC_NPC_BISTRO_SKILL3,
	TEXT_SKILLDESC_NPC_MAID_SKILL1,//c91//시녀//x
	TEXT_SKILLDESC_NPC_MAID_SKILL2,
	TEXT_SKILLDESC_NPC_MAID_SKILL3,
	TEXT_SKILLDESC_NPC_ADELKNIGHT_SKILL1,//c92//기사//x
	TEXT_SKILLDESC_NPC_ADELKNIGHT_SKILL2,
	TEXT_SKILLDESC_NPC_ADELKNIGHT_SKILL3,
	TEXT_SKILLDESC_NPC_SEBASTIAN_SKILL1,//c93//세바스찬//x
	TEXT_SKILLDESC_NPC_SEBASTIAN_SKILL2,
	TEXT_SKILLDESC_NPC_SEBASTIAN_SKILL3,
	TEXT_SKILLDESC_NPC_NOBLEMAN_SKILL1,//c94//귀족아저씨//x
	TEXT_SKILLDESC_NPC_NOBLEMAN_SKILL2,
	TEXT_SKILLDESC_NPC_NOBLEMAN_SKILL3,
	TEXT_SKILLDESC_NPC_DELPIOS_SKILL1,//c95//델피오스//x
	TEXT_SKILLDESC_NPC_DELPIOS_SKILL2,
	TEXT_SKILLDESC_NPC_DELPIOS_SKILL3,
	TEXT_SKILLDESC_NPC_LORA_SKILL1,//c96//로라//x
	TEXT_SKILLDESC_NPC_LORA_SKILL2,
	TEXT_SKILLDESC_NPC_LORA_SKILL3,
	TEXT_SKILLDESC_NPC_WITCH_SKILL1,//c97//마녀//x
	TEXT_SKILLDESC_NPC_WITCH_SKILL2,
	TEXT_SKILLDESC_NPC_WITCH_SKILL3,
	TEXT_SKILLDESC_NPC_ELFGRANDFA_SKILL1,//c98//엘프할아버지//x
	TEXT_SKILLDESC_NPC_ELFGRANDFA_SKILL2,
	TEXT_SKILLDESC_NPC_ELFGRANDFA_SKILL3,
	TEXT_SKILLDESC_NPC_ELFUNCLE_SKILL1,//c99//엘프아저씨//x
	TEXT_SKILLDESC_NPC_ELFUNCLE_SKILL2,
	TEXT_SKILLDESC_NPC_ELFUNCLE_SKILL3,
	TEXT_SKILLDESC_NPC_ELFAUNT_SKILL1,//c100//엘프아줌마//x
	TEXT_SKILLDESC_NPC_ELFAUNT_SKILL2,
	TEXT_SKILLDESC_NPC_ELFAUNT_SKILL3,
	TEXT_SKILLDESC_NPC_ELFMAN_SKILL1,//c101//엘프청년//x
	TEXT_SKILLDESC_NPC_ELFMAN_SKILL2,
	TEXT_SKILLDESC_NPC_ELFMAN_SKILL3,
	TEXT_SKILLDESC_NPC_ELFWOMAN_SKILL1,//c102//엘프처녀//x
	TEXT_SKILLDESC_NPC_ELFWOMAN_SKILL2,
	TEXT_SKILLDESC_NPC_ELFWOMAN_SKILL3,
	TEXT_SKILLDESC_NPC_ELFBOY_SKILL1,//c103//엘프꼬마남//x
	TEXT_SKILLDESC_NPC_ELFBOY_SKILL2,
	TEXT_SKILLDESC_NPC_ELFBOY_SKILL3,
	TEXT_SKILLDESC_NPC_ELFGIRL_SKILL1,//c104//엘프꼬마녀//x
	TEXT_SKILLDESC_NPC_ELFGIRL_SKILL2,
	TEXT_SKILLDESC_NPC_ELFGIRL_SKILL3,
	TEXT_SKILLDESC_NPC_ELFDARK_SKILL1,//c105//엘프다크//x
	TEXT_SKILLDESC_NPC_ELFDARK_SKILL2,
	TEXT_SKILLDESC_NPC_ELFDARK_SKILL3,
	TEXT_SKILLDESC_NPC_ELFMAGIC_SKILL1,//c106//엘프마법사//x
	TEXT_SKILLDESC_NPC_ELFMAGIC_SKILL2,
	TEXT_SKILLDESC_NPC_ELFMAGIC_SKILL3,
	TEXT_SKILLDESC_NPC_ELFDANCER_SKILL1,//c107//엘프무희//x
	TEXT_SKILLDESC_NPC_ELFDANCER_SKILL2,
	TEXT_SKILLDESC_NPC_ELFDANCER_SKILL3,
	TEXT_SKILLDESC_NPC_OWL_SKILL1,//c108//부엉이//x
	TEXT_SKILLDESC_NPC_OWL_SKILL2,
	TEXT_SKILLDESC_NPC_OWL_SKILL3,
	TEXT_SKILLDESC_NPC_LABETH_SKILL1,//c109//라베스//x
	TEXT_SKILLDESC_NPC_LABETH_SKILL2,
	TEXT_SKILLDESC_NPC_LABETH_SKILL3,
	TEXT_SKILLDESC_NPC_ELKEIN_SKILL1,//c110//엘케인//x
	TEXT_SKILLDESC_NPC_ELKEIN_SKILL2,
	TEXT_SKILLDESC_NPC_ELKEIN_SKILL3,
	TEXT_SKILLDESC_NPC_ELEIN_SKILL1,//c111//엘레인//x
	TEXT_SKILLDESC_NPC_ELEIN_SKILL2,
	TEXT_SKILLDESC_NPC_ELEIN_SKILL3,
	TEXT_SKILLDESC_NPC_EVAN_SKILL1,//c112//에번//x
	TEXT_SKILLDESC_NPC_EVAN_SKILL2,
	TEXT_SKILLDESC_NPC_EVAN_SKILL3,
	TEXT_SKILLDESC_NPC_BEAD_SKILL1,//c113//테이블//x
	TEXT_SKILLDESC_NPC_BEAD_SKILL2,
	TEXT_SKILLDESC_NPC_BEAD_SKILL3,
	TEXT_SKILLDESC_NPC_FOUNTAIN_SKILL1,//c114//샘물//x
	TEXT_SKILLDESC_NPC_FOUNTAIN_SKILL2,
	TEXT_SKILLDESC_NPC_FOUNTAIN_SKILL3,
	TEXT_SKILLDESC_NPC_NEZAR_SKILL1,//c115//네자르//x
	TEXT_SKILLDESC_NPC_NEZAR_SKILL2,
	TEXT_SKILLDESC_NPC_NEZAR_SKILL3,
	TEXT_SKILLDESC_NPC_GALLAND_SKILL1,//c116//갈란드//x
	TEXT_SKILLDESC_NPC_GALLAND_SKILL2,
	TEXT_SKILLDESC_NPC_GALLAND_SKILL3,
	TEXT_SKILLDESC_NPC_DURAK_SKILL1,//c117//듀라크//x
	TEXT_SKILLDESC_NPC_DURAK_SKILL2,
	TEXT_SKILLDESC_NPC_DURAK_SKILL3,
	TEXT_SKILLDESC_NPC_KING_SKILL1,//c118//에드몬드//x
	TEXT_SKILLDESC_NPC_KING_SKILL2,
	TEXT_SKILLDESC_NPC_KING_SKILL3,
	TEXT_SKILLDESC_NPC_WOMANGHOST_SKILL1,//c119//여자유령//x
	TEXT_SKILLDESC_NPC_WOMANGHOST_SKILL2,
	TEXT_SKILLDESC_NPC_WOMANGHOST_SKILL3,
	TEXT_SKILLDESC_NPC_MANGHOST_SKILL1,//c120//남자유령//x
	TEXT_SKILLDESC_NPC_MANGHOST_SKILL2,
	TEXT_SKILLDESC_NPC_MANGHOST_SKILL3,
	TEXT_SKILLDESC_NPC_AUSTIN_SKILL1,//c121//오스틴(유령)//x
	TEXT_SKILLDESC_NPC_AUSTIN_SKILL2,
	TEXT_SKILLDESC_NPC_AUSTIN_SKILL3,
	TEXT_SKILLDESC_NPC_SOUL_SKILL1,//c122//마왕의 심장//x
	TEXT_SKILLDESC_NPC_SOUL_SKILL2,
	TEXT_SKILLDESC_NPC_SOUL_SKILL3,

	TEXT_SKILLEFFECTDESC_COMMON_ROBIN1,//힘단련 : STR 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN2,//체력단련 : VIT 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN3,//민첩단련 : AGI 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN4,//정신단련 : INT 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN6,//기력강화 : MP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN7,//무기숙련 : 공격력 증가
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN8,//방어구숙련: 방어력 증가
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN11,//뚝심 : 데미지 경감
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN12,//정조준 : 명중 증가
	TEXT_SKILLEFFECTDESC_COMMON_ROBIN13,//신속회피 : 회피 증가

	TEXT_SKILLEFFECTDESC_ROBIN1,//검술숙련 : 관통 발생 확률 상승
	TEXT_SKILLEFFECTDESC_ROBIN2,//긴급방어 : 방어 발동 확률이 올라감(1레벨이면 방어 발동이 시작, 점점 확률 상승)
	TEXT_SKILLEFFECTDESC_ROBIN3,//방어숙련 : 방어 발동시 경감되는 데미지 퍼센트 상승
	TEXT_SKILLEFFECTDESC_ROBIN4,//면역력 : 상태이상에 대한 저항력 상승
	TEXT_SKILLEFFECTDESC_ROBIN5,//지구전 : INT가 높을수록 VIT 상승
	TEXT_SKILLEFFECTDESC_ROBIN6,//에어크래쉬 : 몹 뛰우기
	TEXT_SKILLEFFECTDESC_ROBIN7,//마구찌르기 : 난타
	TEXT_SKILLEFFECTDESC_ROBIN8,//부스트슬래쉬 : 가로로 크게 배기, 기절공격
	TEXT_SKILLEFFECTDESC_ROBIN9,//하이퍼차지 : 돌격공격, 적을 뒤로 날려버림
	TEXT_SKILLEFFECTDESC_ROBIN10,//소울크래쉬 : 기절
	TEXT_SKILLEFFECTDESC_ROBIN11,//앱솔루트피어스 : 찔러서회전
	TEXT_SKILLEFFECTDESC_ROBIN12,//멸살연참 : 연속기
	TEXT_SKILLEFFECTDESC_ROBIN13,//방어태세 : 일정시간 VIT 상승
	TEXT_SKILLEFFECTDESC_ROBIN14,//정신소모 : MP 소모하여 데미지 경감
	TEXT_SKILLEFFECTDESC_ROBIN15,//여유포착 : 적 공격 회피시 HP 상승
	TEXT_SKILLEFFECTDESC_ROBIN16,//냉정침착 : 데미지 입으면 MP 회복
	TEXT_SKILLEFFECTDESC_ROBIN17,//리플렉터 : 확률로데미지 반사

	TEXT_SKILLEFFECTDESC_COMMON_DIANA1,//힘단련 : STR 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA2,//체력단련 : VIT 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA3,//민첩단련 : AGI 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA4,//정신단련 : INT 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA6,//기력강화 : MP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA7,//무기숙련 : 공격력 증가
	TEXT_SKILLEFFECTDESC_COMMON_DIANA8,//방어구숙련: 방어력 증가
	TEXT_SKILLEFFECTDESC_COMMON_DIANA9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLEFFECTDESC_COMMON_DIANA11,//뚝심 : 데미지 경감
	TEXT_SKILLEFFECTDESC_COMMON_DIANA12,//정조준 : 명중 증가
	TEXT_SKILLEFFECTDESC_COMMON_DIANA13,//신속회피 : 회피 증가

	TEXT_SKILLEFFECTDESC_DIANA1,//매의눈 : 공격 거리 상승
	TEXT_SKILLEFFECTDESC_DIANA2,//사격숙련 : 기절공격이 발생할 확률이 상승
	TEXT_SKILLEFFECTDESC_DIANA3,//아드레날린 : 기절공격 성공시 MP 회복량 상승
	TEXT_SKILLEFFECTDESC_DIANA4,//활성화 : 스킬 재사용 시간 감소
	TEXT_SKILLEFFECTDESC_DIANA5,//집중력유지 : STR이 높을수록 INT 상승
	TEXT_SKILLEFFECTDESC_DIANA6,//3way : 3방향으로 총 발사
	TEXT_SKILLEFFECTDESC_DIANA7,//리플렉션빔 : 레이져가 벽에 튕김
	TEXT_SKILLEFFECTDESC_DIANA8,//헬파이어 : 화염 방사기
	TEXT_SKILLEFFECTDESC_DIANA9,//로켓런쳐 : 로켓 발사되어 폭발
	TEXT_SKILLEFFECTDESC_DIANA10,//호밍미사일 : 유도탄 3개
	TEXT_SKILLEFFECTDESC_DIANA11,//킬링존 : 난사
	TEXT_SKILLEFFECTDESC_DIANA12,//오비탈레이져 : 인공위성
	TEXT_SKILLEFFECTDESC_DIANA13,//리커버리 : 회복탄
	TEXT_SKILLEFFECTDESC_DIANA14,//흥분고조 : 방어력 저하 공격력 상승
	TEXT_SKILLEFFECTDESC_DIANA15,//흡마의마탄 : 공격시 MP 흡수
	TEXT_SKILLEFFECTDESC_DIANA16,//필살집중 : 크리 상승
	TEXT_SKILLEFFECTDESC_DIANA17,//파마의직격 : 일정시간 적 방어 무시

	TEXT_SKILLEFFECTDESC_COMMON_MAXX1,//힘단련 : STR 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX2,//체력단련 : VIT 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX3,//민첩단련 : AGI 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX4,//정신단련 : INT 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX5,//생명력강화 : HP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX6,//기력강화 : MP 최대치 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX7,//무기숙련 : 공격력 증가
	TEXT_SKILLEFFECTDESC_COMMON_MAXX8,//방어구숙련: 방어력 증가
	TEXT_SKILLEFFECTDESC_COMMON_MAXX9,//약점파악 : 크리티컬 확률 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX10,//약점공격 : 크리티컬 데미지 상승
	TEXT_SKILLEFFECTDESC_COMMON_MAXX11,//뚝심 : 데미지 경감
	TEXT_SKILLEFFECTDESC_COMMON_MAXX12,//정조준 : 명중 증가
	TEXT_SKILLEFFECTDESC_COMMON_MAXX13,//신속회피 : 회피 증가

	TEXT_SKILLEFFECTDESC_MAXX1,//관통력숙련 : 적을 공격했을 때 부메랑의 판정이 남아있을 확률이 상승한다.
	TEXT_SKILLEFFECTDESC_MAXX2,//투척숙련 : 부메랑 속도 상승
	TEXT_SKILLEFFECTDESC_MAXX3,//연속공격 : 추가 공격 확률 증가
	TEXT_SKILLEFFECTDESC_MAXX4,//회전력상승 : 추가 공격 성공시 해당 공격에 대해서 데미지 상승
	TEXT_SKILLEFFECTDESC_MAXX5,//탄력성 : VIT 높을수록 AGI 상승
	TEXT_SKILLEFFECTDESC_MAXX6,//효율적사고 : INT가 높을수록 AGI가 올라감
	TEXT_SKILLEFFECTDESC_MAXX7,//돌려차기 : 회전, 기절공격
	TEXT_SKILLEFFECTDESC_MAXX8,//숏헌트 : 관통, 사거리 짧음
	TEXT_SKILLEFFECTDESC_MAXX9,//에어헌트 : 수직 상승 공격
	TEXT_SKILLEFFECTDESC_MAXX10,//캠핑헌트 : 앞으로 날라가서 제자리회전
	TEXT_SKILLEFFECTDESC_MAXX11,//호밍헌트 : 가장 가까운 적 때리고 되돌아옴
	TEXT_SKILLEFFECTDESC_MAXX12,//써클헌트 : 주인공 주변 보호
	TEXT_SKILLEFFECTDESC_MAXX13,//메가헌트 : 관통후 뒤에서 돌아옴
	TEXT_SKILLEFFECTDESC_MAXX14,//블러드헌트 : 적 공격시 HP 회복
	TEXT_SKILLEFFECTDESC_MAXX15,//현란무도 : 일정시간 회피율 증가
	TEXT_SKILLEFFECTDESC_MAXX16,//안도의한숨 : 적 공격 회피시 MP 회복
	TEXT_SKILLEFFECTDESC_MAXX17,//혼신분리 : 기절 확률 상승

	TEXT_SKILL_ETC0,	//기본 공격력의 |r%d%%|b의 위력을 지니며, %s
	TEXT_SKILL_ETC1,	//MP를 |i%d%%|b만큼 소비한다. %s
	TEXT_SKILL_ETC2,	//(재사용 대기시간:|j%d초|b)
	TEXT_SKILL_ETC3,	//|e%d%%초 |b동안

	TEXT_SKILL_DEFAULTATK,	//기본 공격력의
	TEXT_SKILL_POWER,//의 위력을 지니며,
	TEXT_SKILL_COOLTIME,//(재사용 대기시간:|j
	TEXT_SKILL_SECONDS,//초|b)
	TEXT_SKILL_SECONDS_WHILE,//|b초 동안

	TEXT_SKILL_ROBIN13_SEP1,
	TEXT_SKILL_ROBIN13_SEP2,
	TEXT_SKILL_ROBIN14_SEP1,
	TEXT_SKILL_ROBIN14_SEP2,
	TEXT_SKILL_ROBIN15_SEP1,
	TEXT_SKILL_ROBIN15_SEP2,
	TEXT_SKILL_ROBIN16_SEP1,
	TEXT_SKILL_ROBIN16_SEP2,
	TEXT_SKILL_ROBIN17_SEP1,
	TEXT_SKILL_ROBIN17_SEP2,

	TEXT_SKILL_DIANA13_SEP1,
	TEXT_SKILL_DIANA13_SEP2,
	TEXT_SKILL_DIANA14_SEP1,
	TEXT_SKILL_DIANA14_SEP2,
	TEXT_SKILL_DIANA15_SEP1,
	TEXT_SKILL_DIANA15_SEP2,
	TEXT_SKILL_DIANA16_SEP1,
	TEXT_SKILL_DIANA16_SEP2,
	TEXT_SKILL_DIANA17_SEP1,
	TEXT_SKILL_DIANA17_SEP2,

	TEXT_SKILL_MAXX14_SEP1,
	TEXT_SKILL_MAXX14_SEP2,
	TEXT_SKILL_MAXX15_SEP1,
	TEXT_SKILL_MAXX15_SEP2,
	TEXT_SKILL_MAXX16_SEP1,
	TEXT_SKILL_MAXX16_SEP2,
	TEXT_SKILL_MAXX17_SEP1,
	TEXT_SKILL_MAXX17_SEP2,

	TEXT_SKILLDESC_ETC0,// 

	TEXT_GUN0,	//총 사정거리 : |r64
	TEXT_BOOMERANG0,	//부메랑 사정거리 : |r71

	TEXT_ACTIONCARD_ATTACK_NORMAL,
	TEXT_ACTIONCARD_ATTACK_CRITICAL,
	TEXT_ACTIONCARD_ATTACK_PIERCE,
	TEXT_ACTIONCARD_ATTACK_EXTRA,
	TEXT_ACTIONCARD_ATTACK_FIRE,
	TEXT_ACTIONCARD_ATTACK_FROST,
	TEXT_ACTIONCARD_ATTACK_THUNDER,
	TEXT_ACTIONCARD_ATTACK_HOLY,
	TEXT_ACTIONCARD_ATTACK_DARK,
	TEXT_ACTIONCARD_ATTACK_SLOW,
	TEXT_ACTIONCARD_ATTACK_BLIND,
	TEXT_ACTIONCARD_ATTACK_POISON,
	TEXT_ACTIONCARD_ATTACK_STUN,
	TEXT_ACTIONCARD_ATTACK_CURSE,
	TEXT_ACTIONCARD_HEART,
	TEXT_ACTIONCARD_QUEST,
	TEXT_ACTIONCARD_BATTLE,
	TEXT_ACTIONCARD_RAID,
	TEXT_ACTIONCARD_SHIELD,
	TEXT_ACTIONCARD_SKILL_ROBIN_AIRCRASH,
	TEXT_ACTIONCARD_SKILL_ROBIN_STAB,
	TEXT_ACTIONCARD_SKILL_ROBIN_BOOSTSLASH,
	TEXT_ACTIONCARD_SKILL_ROBIN_HYPERCHARGE,
	TEXT_ACTIONCARD_SKILL_ROBIN_SOULCRASH,
	TEXT_ACTIONCARD_SKILL_ROBIN_ABSOLUTEPIERCE,
	TEXT_ACTIONCARD_SKILL_ROBIN_KILLALL,
	TEXT_ACTIONCARD_SKILL_ROBIN_DEFENSE,
	TEXT_ACTIONCARD_SKILL_ROBIN_BARRIER,
	TEXT_ACTIONCARD_SKILL_ROBIN_HPRESTORE,
	TEXT_ACTIONCARD_SKILL_ROBIN_MPRESTORE,
	TEXT_ACTIONCARD_SKILL_ROBIN_REFLECTOR,
	TEXT_ACTIONCARD_SKILL_DIANA_3WAY,
	TEXT_ACTIONCARD_SKILL_DIANA_LASER,
	TEXT_ACTIONCARD_SKILL_DIANA_FLAMER,
	TEXT_ACTIONCARD_SKILL_DIANA_BOMBSHOT,
	TEXT_ACTIONCARD_SKILL_DIANA_GUIDESHOT,
	TEXT_ACTIONCARD_SKILL_DIANA_SPRAYSHOT,
	TEXT_ACTIONCARD_SKILL_DIANA_SATELLITESHOT,
	TEXT_ACTIONCARD_SKILL_DIANA_HEALSHOT,
	TEXT_ACTIONCARD_SKILL_DIANA_FEELUP,
	TEXT_ACTIONCARD_SKILL_DIANA_VAMPIRE,
	TEXT_ACTIONCARD_SKILL_DIANA_FOCUS,
	TEXT_ACTIONCARD_SKILL_DIANA_FAMAS,
	TEXT_ACTIONCARD_SKILL_MAXX_KICK,
	TEXT_ACTIONCARD_SKILL_MAXX_SHORT,
	TEXT_ACTIONCARD_SKILL_MAXX_AIR,
	TEXT_ACTIONCARD_SKILL_MAXX_CAMPING,
	TEXT_ACTIONCARD_SKILL_MAXX_HORMING,
	TEXT_ACTIONCARD_SKILL_MAXX_CIRCLE,
	TEXT_ACTIONCARD_SKILL_MAXX_MEGA,
	TEXT_ACTIONCARD_SKILL_MAXX_BLOOD,
	TEXT_ACTIONCARD_SKILL_MAXX_DAZZLE,
	TEXT_ACTIONCARD_SKILL_MAXX_SIGH,
	TEXT_ACTIONCARD_SKILL_MAXX_SPLIT,
	TEXT_ACTIONCARD_SUMMON_DIANA,
	TEXT_ACTIONCARD_SUMMON_MAXX,
	TEXT_ACTIONCARD_SUMMON_SNAIL,
	TEXT_ACTIONCARD_SUMMON_TREE,
	TEXT_ACTIONCARD_SUMMON_ONEEYE,
	TEXT_ACTIONCARD_SUMMON_SKELETON,
	TEXT_ACTIONCARD_SUMMON_LIZARD,
	TEXT_ACTIONCARD_SUMMON_JELLYFISH,
	TEXT_ACTIONCARD_SUMMON_KNIGHT,
	TEXT_ACTIONCARD_SUMMON_SLIME,
	TEXT_ACTIONCARD_SUMMON_SLING,
	TEXT_ACTIONCARD_SUMMON_BOAR,
	TEXT_ACTIONCARD_SUMMON_FLAME,
	TEXT_ACTIONCARD_SUMMON_PHOENIX,
	TEXT_ACTIONCARD_SUMMON_FACE,
	TEXT_ACTIONCARD_SUMMON_SNOWMAN,
	TEXT_ACTIONCARD_SUMMON_ICESUN,
	TEXT_ACTIONCARD_SUMMON_LIGHTNING,
	TEXT_ACTIONCARD_SUMMON_THUNDER,
	TEXT_ACTIONCARD_SUMMON_CRYSTAL,
	TEXT_ACTIONCARD_SUMMON_FAIRY,
	TEXT_ACTIONCARD_SUMMON_CIRCLE,
	TEXT_ACTIONCARD_SUMMON_SPIDER,
	TEXT_ACTIONCARD_SUMMON_GOLEM,
	TEXT_ACTIONCARD_SUMMON_DARKGIANT,
	TEXT_ACTIONCARD_SUMMON_DARKDRAGON,
	TEXT_ACTIONCARD_SUMMON_DRAGON1,
	TEXT_ACTIONCARD_SUMMON_DRAGON2,
	TEXT_ACTIONCARD_SUMMON_GHOST,
	TEXT_ACTIONCARD_SUMMON_PUMPKIN,
	TEXT_ACTIONCARD_SUMMON_CASTLE1,
	TEXT_ACTIONCARD_SUMMON_CASTLE2,
	TEXT_ACTIONCARD_SUMMON_SPACE1,
	TEXT_ACTIONCARD_SUMMON_SPACE2,
	TEXT_ACTIONCARD_SUMMON_FROG,
	TEXT_ACTIONCARD_SUMMON_LARVA,
	TEXT_ACTIONCARD_SUMMON_SALAMANDER,
	TEXT_ACTIONCARD_SUMMON_GIANT,
	TEXT_ACTIONCARD_SUMMON_IFRIT,
	TEXT_ACTIONCARD_SUMMON_MAMMOTH,
	TEXT_ACTIONCARD_SUMMON_MACHINE,
	TEXT_ACTIONCARD_SUMMON_ANGEL,
	TEXT_ACTIONCARD_SUMMON_KIMERA,
	TEXT_ACTIONCARD_SUMMON_SHIP,
	TEXT_ACTIONCARD_SUMMON_FOGRA,
	TEXT_ACTIONCARD_SUMMON_BAHAMUT,
	TEXT_ACTIONCARD_SUMMON_DEATH,
	TEXT_ACTIONCARD_SUMMON_CASTLE_BOSS1,
	TEXT_ACTIONCARD_SUMMON_CASTLE_BOSS2,
	TEXT_ACTIONCARD_SUMMON_CASTLE_BOSS3,
	TEXT_ACTIONCARD_SUMMON_CASTLE_BOSS4,
	TEXT_ACTIONCARD_SUMMON_LABETH,
	TEXT_ACTIONCARD_SUMMON_ELKEIN,

	TEXT_HELP_TITLE0,//"|h옛날 옛적에"
	TEXT_HELP_TITLE1,//"|h게임목적"
	TEXT_HELP_TITLE2,//"|h플레이방법"
	TEXT_HELP_TITLE3,//"|h화면설명"
	TEXT_HELP_TITLE4,//"|h히어로들"
	TEXT_HELP_TITLE5,//"|h능력치"
	TEXT_HELP_TITLE6,//"|h상태이상"
	TEXT_HELP_TITLE7,//"|h게임종료와보상"
	TEXT_HELP_TITLE8,//"|h장비"
	TEXT_HELP_TITLE9,//"|h강화/진화/소켓"
	TEXT_HELP_TITLE10,//"|h소비아이템"
	TEXT_HELP_TITLE11,//"|h서포터"
	TEXT_HELP_TITLE12,//"|h용병단"

	//TEXT_HELP_SUBTITLE1_1,//
	//TEXT_HELP_SUBTITLE1_2,//
	//TEXT_HELP_SUBTITLE1_3,//
	//TEXT_HELP_SUBTITLE1_4,//

	//TEXT_HELP_SUBTITLE1_1,//
	//TEXT_HELP_SUBTITLE1_2,//
	//TEXT_HELP_SUBTITLE1_3,//
	//TEXT_HELP_SUBTITLE1_4,//
	/*
	TEXT_SUPPORT_CATEGORY1,
	TEXT_SUPPORT_CATEGORY2,
	TEXT_SUPPORT_CATEGORY3,
	TEXT_SUPPORT_CATEGORY4,
	TEXT_SUPPORT_CATEGORY5,

	TEXT_HELP_TITLE1,
	TEXT_HELP_TITLE2,
	TEXT_HELP_TITLE3,
	TEXT_HELP_TITLE4,

	TEXT_HELP_TITLE5,
	TEXT_HELP_TITLE6,
	TEXT_HELP_TITLE7,

	TEXT_HELP_TITLE8,
	TEXT_HELP_TITLE9,
	TEXT_HELP_TITLE10,

	TEXT_HELP_TITLE11,

	TEXT_HELP_TITLE12,

	TEXT_HELP_BODY1,
	TEXT_HELP_BODY2,
	TEXT_HELP_BODY3,
	TEXT_HELP_BODY4,

	TEXT_HELP_BODY5,
	TEXT_HELP_BODY6,
	TEXT_HELP_BODY7,

	TEXT_HELP_BODY8,
	TEXT_HELP_BODY9,
	TEXT_HELP_BODY10,

	TEXT_HELP_BODY11,

	TEXT_HELP_BODY12,
	*/

	TEXT_MONSTER_ETC0,
	TEXT_MONSTER_ETC0_1,
	TEXT_MONSTER_ETC0_2,
	TEXT_MONSTER_ETC0_3,
	TEXT_MONSTER_ETC1,
	TEXT_MONSTER_ETC2,
	TEXT_MONSTER_DESC,
	TEXT_MONSTER_DESC2 = TEXT_MONSTER_DESC + CAP_ENEMY,
	TEXT_MONSTER_GOOD = TEXT_MONSTER_DESC2 + CAP_ENEMY,
	TEXT_MONSTER_BAD = TEXT_MONSTER_GOOD + CAP_ENEMY,

	TEXT_RA1_SWORD = TEXT_MONSTER_BAD + CAP_ENEMY,				//로빈//흐룬팅8311
	TEXT_RB1_SWORD,					  //그람
	TEXT_RC1_SWORD,					  //아슈겔론
	TEXT_RD1_SWORD,					  //스톰브링거
	TEXT_DA1_GUN,					  //가에보르그
	TEXT_DB1_GUN,					  //게이볼그
	TEXT_DC1_GUN,					  //롱기누스
	TEXT_DD1_GUN,					  //마탄 타흘룸
	TEXT_MA1_BOOMERANG,				  //칼라드볼그
	TEXT_MB1_BOOMERANG,				  //궁니르
	TEXT_MC1_BOOMERANG,				  //프라가라흐
	TEXT_MD1_BOOMERANG,				  //묠니르

	TEXT_RA1_HELM,					  //아케론 헬름 8323
	TEXT_RB1_HELM,					  //세이렌 헬름
	TEXT_RC1_HELM,					  //타이탄 헬름
	TEXT_RD1_HELM,					  //티폰 헬름
	TEXT_DA1_HAT,					  //네메시스 헷
	TEXT_DB1_HAT,					  //프시케 헷
	TEXT_DC1_HAT,					  //아탈란타 헷
	TEXT_DD1_HAT,					  //레테 크라운
	TEXT_MA1_CAP,					  //플레케톤 캡
	TEXT_MB1_CAP,					  //타나토스 캡
	TEXT_MC1_CAP,					  //미다스 캡
	TEXT_MD1_CAP,					  //에레보스 캡

	TEXT_RA1_ARMOR,					  //아케론 아머 8335
	TEXT_RB1_ARMOR,					  //세이렌 아머
	TEXT_RC1_ARMOR,					  //타이탄 아머
	TEXT_RD1_ARMOR,					  //티폰 아머
	TEXT_DA1_VEST,					  //네메시스 로브
	TEXT_DB1_VEST,					  //프시케 드레스
	TEXT_DC1_VEST,					  //아탈란타 로브
	TEXT_DD1_VEST,					  //레테 로브
	TEXT_MA1_COAT,					  //플레케톤 코트
	TEXT_MB1_COAT,					  //타나토스 코트
	TEXT_MC1_COAT,					  //미다스 코트
	TEXT_MD1_COAT,					  //에레보스 코트

	TEXT_RA1_GUNTLET,				  //아케론 건틀렛 8347
	TEXT_RB1_GUNTLET,				  //세이렌 건틀렛
	TEXT_RC1_GUNTLET,				  //타이탄 건틀렛
	TEXT_RD1_GUNTLET,				  //티폰 건틀렛
	TEXT_DA1_ARMLET,				  //네메시스 암렛
	TEXT_DB1_ARMLET,				  //프시케 암렛
	TEXT_DC1_ARMLET,				  //아탈란타 암렛
	TEXT_DD1_ARMLET,				  //레트 암렛
	TEXT_MA1_GLOVE,					  //플레케톤 핸드
	TEXT_MB1_GLOVE,					  //타나토스 핸드
	TEXT_MC1_GLOVE,					  //미다스 글러브
	TEXT_MD1_GLOVE,					  //에레보스 핸드

	TEXT_RA1_KILT,					  //아케론 킬트 8359
	TEXT_RB1_KILT,					  //세이렌 킬트
	TEXT_RC1_KILT,					  //타이탄 킬트
	TEXT_RD1_KILT,					  //티폰 킬트
	TEXT_DA1_SKIRT,					  //네메시스 치마
	TEXT_DB1_SKIRT,					  //프시케 스커트
	TEXT_DC1_SKIRT,					  //아탈란타 치마
	TEXT_DD1_SKIRT,					  //레테 스커트
	TEXT_MA1_PANTS,					  //플레케톤 팬츠
	TEXT_MB1_PANTS,					  //타나토스 팬츠
	TEXT_MC1_PANTS,					  //미다스 팬츠
	TEXT_MD1_PANTS,					  //에레보스 팬츠

	TEXT_RA1_GREAVES,				  //아케론 그리브 8371
	TEXT_RB1_GREAVES,				  //세이렌 그리브
	TEXT_RC1_GREAVES,				  //타이탄 그리브
	TEXT_RD1_GREAVES,				  //티폰 그리브
	TEXT_DA1_SHOES,					  //네메시스 슈즈
	TEXT_DB1_SHOES,					  //프시케 슈즈
	TEXT_DC1_SHOES,					  //아탈란타 슈즈
	TEXT_DD1_SHOES,					  //레테 슈즈
	TEXT_MA1_BOOTS,					  //플레케톤 부츠
	TEXT_MB1_BOOTS,					  //타나토스 부츠
	TEXT_MC1_BOOTS,					  //미다스 부츠
	TEXT_MD1_BOOTS,					  //에레보스 부츠

	TEXT_RA1_NECK,					  //키비시스 자루 8383
	TEXT_RB1_NECK,					  //세이렌의 피리
	TEXT_RC1_NECK,					  //죽음의 올가미
	TEXT_RD1_NECK,					  //재앙의 거울
	TEXT_DA1_NECK,					  //영웅의 서사시 
	TEXT_DB1_NECK,					  //로젤린의 꽃
	TEXT_DC1_NECK,					  //천사의 날개
	TEXT_DD1_NECK,					  //황혼의 성배
	TEXT_MA1_NECK,					  //유니콘의 뿔
	TEXT_MB1_NECK,					  //금단의 과실
	TEXT_MC1_NECK,					  //황금 조개
	TEXT_MD1_NECK,					  //조각난 영혼

	TEXT_RA1_RING,					  //충성의 반지 8395
	TEXT_RB1_RING,					  //황제의 반지
	TEXT_RC1_RING,					  //절대 반지
	TEXT_RD1_RING,					  //니벨룽겐 반지
	TEXT_DA1_RING,					  //은하수 반지
	TEXT_DB1_RING,					  //약속의 반지
	TEXT_DC1_RING,					  //요정의 반지
	TEXT_DD1_RING,					  //흡마 반지	
	TEXT_MA1_RING,					  //번뇌의 반지
	TEXT_MB1_RING,					  //불사의 반지
	TEXT_MC1_RING,					  //황금 반지
	TEXT_MD1_RING,					  //봉인된 반지

	//TEXT_TOTALCAVE_ITEM = 96,

	//TEXT_ALPHA_HP = TEXT_MD1_RING + TEXT_TOTALCAVE_ITEM,
	TEXT_ALPHA_HP,
	TEXT_ALPHA_MP,
	TEXT_ALPHA_EXP,
	TEXT_ALPHA_STR,
	TEXT_ALPHA_VIT,
	TEXT_ALPHA_AGI,
	TEXT_ALPHA_INT,
	TEXT_ALPHA_POINT,
	TEXT_ALPHA_POISON,
	TEXT_ALPHA_SLOW,
	TEXT_ALPHA_BLIND,
	TEXT_ALPHA_STUN,
	TEXT_ALPHA_CURSE,
	TEXT_ALPHA_PHYSICAL,
	TEXT_ALPHA_FLAME,
	TEXT_ALPHA_ICE,
	TEXT_ALPHA_LIGHTNING,
	TEXT_ALPHA_HOLY,
	TEXT_ALPHA_DARKNESS,
	TEXT_ALPHA_SELECT,
	TEXT_ALPHA_BACK,
	TEXT_ALPHA_CLR,
	TEXT_ALPHA_BUY,
	TEXT_ALPHA_SELL,
	TEXT_ALPHA_EXIT,
	TEXT_ALPHA_ENCHANT,
	TEXT_ALPHA_SOCKET,
	TEXT_ALPHA_DAILY,
	TEXT_ALPHA_EXITARENA,

	TEXT_ALPHA_VDOT,
	TEXT_ALPHA_STATUE,
	TEXT_ALPHA_KEYITEM,
	TEXT_ALPHA_ITEM,
	TEXT_ALPHA_REGIST,

	TEXT_ALPHA_PLUS,
	TEXT_ALPHA_MINUS,
	TEXT_ALPHA_PER,
	TEXT_ALPHA_PERCENT,
	TEXT_ALPHA_COLON,
	TEXT_ALPHA_QUICK,
	TEXT_ALPHA_ACTIVE,
	TEXT_ALPHA_PASSIVE,

	TEXT_ALPHA_OK,
	TEXT_ALPHA_DMG,
	TEXT_ALPHA_LV,
	TEXT_ALPHA_MAIN,
	TEXT_ALPHA_SUB,

	TEXT_ALPHA_STATUS,
	TEXT_ALPHA_INVENTORY,
	TEXT_ALPHA_SKILL,
	TEXT_ALPHA_OPTION,
	TEXT_ALPHA_VIEWRANKING,
	TEXT_ALPHA_SHOP,
	TEXT_ALPHA_PLAYERTITLE,
	TEXT_ALPHA_REPORTS,
	TEXT_ALPHA_CREWS,
	TEXT_ALPHA_ON,
	TEXT_ALPHA_OFF,
	TEXT_ALPHA_DAMAGE,
	TEXT_ALPHA_DEFENSE,
	TEXT_ALPHA_USE,
	TEXT_ALPHA_REWARD,
	TEXT_ALPHA_REQUIRE,
	TEXT_ALPHA_QUEST,

	TEXT_ALPHA_SWORD,
	TEXT_ALPHA_GUN,
	TEXT_ALPHA_BOOMERANG,
	TEXT_ALPHA_HELM,
	TEXT_ALPHA_HAT,
	TEXT_ALPHA_CAP,
	TEXT_ALPHA_ARMOR,
	TEXT_ALPHA_VEST,
	TEXT_ALPHA_COAT,
	TEXT_ALPHA_GUNTLET,
	TEXT_ALPHA_ARMLET,
	TEXT_ALPHA_GLOVE,
	TEXT_ALPHA_KILT,
	TEXT_ALPHA_SKIRT,
	TEXT_ALPHA_PANTS,
	TEXT_ALPHA_GREAVES,
	TEXT_ALPHA_SHOES,
	TEXT_ALPHA_BOOTS,
	TEXT_ALPHA_NECK,
	TEXT_ALPHA_RING,

	TEXT_ALPHA_GEM,
	TEXT_ALPHA_WASTES,
	TEXT_ALPHA_IRON,
	TEXT_ALPHA_LEATHER,
	TEXT_ALPHA_CLOTH,
	TEXT_ALPHA_WOOD,
	TEXT_ALPHA_ESSENCE,
	TEXT_ALPHA_RECIPE,
	TEXT_ALPHA_PRICE,
	TEXT_ALPHA_EQUIP,
	TEXT_ALPHA_HELP,
	TEXT_ALPHA_SETUP,
	TEXT_ALPHA_QUIT,
	TEXT_ALPHA_ROBIN,
	TEXT_ALPHA_DIANA,
	TEXT_ALPHA_MAXX,
	TEXT_ALPHA_DATARESET,
	TEXT_ALPHA_GAMEOVER,
	TEXT_ALPHA_TABSCREEN,
	TEXT_ALPHA_NO,
	TEXT_ALPHA_GOLD,
	TEXT_ALPHA_TIME,
	TEXT_ALPHA_GIVE,
	TEXT_ALPHA_GET,
	TEXT_ALPHA_RESULT,
	TEXT_ALPHA_FROM,
	TEXT_ALPHA_TO,
	TEXT_ALPHA_LOADING,
	TEXT_ALPHA_NOW,
	TEXT_ALPHA_TIMELEFT,
	TEXT_ALPHA_MENU,
	TEXT_ALPHA_ORDER,
	TEXT_ALPHA_TOTAL,
	TEXT_ALPHA_ARENA,
	TEXT_ALPHA_RANK,
	TEXT_ALPHA_SCORE,
	TEXT_ALPHA_MASTER,
	TEXT_ALPHA_GIFT,
	TEXT_ALPHA_COUPON,
	TEXT_ALPHA_TOP,
	TEXT_ALPHA_MAX,
	TEXT_ALPHA_PLAYER,
	TEXT_ALPHA_COINSWORD,
	TEXT_ALPHA_EMPTY,
	TEXT_ALPHA_AUTO,
	TEXT_ALPHA_RESCUE,
	TEXT_ALPHA_HEROES,
	TEXT_ALPHA_MONSTERS,
	TEXT_ALPHA_BET,
	TEXT_ALPHA_STAGECLEARED,

	TEXT_SKILL_START,
	TEXT_SKILL_LEVELUP,
	TEXT_SKILL_GET,
	TEXT_GET_ITEM,
	TEXT_GET_ITEM_COUNT,
	TEXT_GET_GOLD,
	TEXT_SPACE_GOLD,
	TEXT_SPACE_GOLD_COUNT,
	TEXT_SHOP_COUNT,
	TEXT_COUPON_COUNT,
	TEXT_PRICE_WON,
	TEXT_PRICE_GOLD,
	TEXT_NOMORE_UPGRADE,
	TEXT_TOTAL_USEDTIME,
	TEXT_ARENAFLOOR,
	TEXT_MONSTERKILL,
	TEXT_ANIMALCOUNT,
	TEXT_NPCCOUNT,
	TEXT_HUMANCOUNT,

	TEXT_WELCOME,
	TEXT_AREYOUREADY,
	TEXT_SILENT,
	TEXT_CONGRATULATION,
	TEXT_THANKYOU,
	TEXT_WELL,
	TEXT_NOTENOUGH,

	TEXT_ASKSELL,
	TEXT_ASKBUY,

	TEXT_DEVILCASTLE,
	TEXT_BOSSRAID,

	TEXT_FILL_ENCHANTSLOT_FOR_ENCHNAT,
	TEXT_FILL_ENCHANTSLOT_FOR_RECIPE,

	TEXT_SOCKET,
	TEXT_EQUIP,
	TEXT_EQUIPALL,
	TEXT_DISASSEMBLE,

	TEXT_ENCHANTSUCCEED,
	TEXT_RECIPESUCCEED,
	TEXT_SOCKETSUCCEED,

	TEXT_SELECTRECIPE,
	TEXT_SOCKETING,

	TEXT_CURRENCY_MEDAL,
	TEXT_CURRENCY_GOLD,
	TEXT_CURRENCY_COIN,
	TEXT_CURRENCY_HEART,

	TEXT_SHOP_BOX,
	TEXT_SHOP_GEM,
	TEXT_SHOP_BUFF,
	TEXT_SHOP_BIGCOIN,
	TEXT_SHOP_GOLD,

	TEXT_ALPHA_BOSSINFO,

	TEXT_GOLDPOSSETION,
	TEXT_RAIDGOLD,
	TEXT_HOSTAGE,

	TEXT_FREEPASS,
	TEXT_SHOP_PASS_TITLE,
	TEXT_SHOP_PASS_BODY,
	TEXT_SHOP_GACHA_TITLE,
	TEXT_SHOP_GACHA_BODY,
	TEXT_SHOP_CURRENCY_TITLE,
	TEXT_SHOP_COIN_TITLE,
	TEXT_SHOP_COIN_BODY,
	TEXT_SHOP_GOLD_TITLE,
	TEXT_SHOP_GOLD_BODY,
	TEXT_SHOP_MEDAL_TITLE,
	TEXT_SHOP_MEDAL_BODY,
	TEXT_SHOP_HEART_TITLE,
	TEXT_SHOP_HEART_BODY,
	TEXT_SHOP_BUFF_TITLE,
	TEXT_SHOP_MEDALSHOP_TITLE,
	TEXT_SHOP_MEDALSHOP_BODY,

	TEXT_HERO,
	TEXT_HERO_SELECT,
	TEXT_BORDERGUARD,
	TEXT_BORDERGUARD_DESC,
	TEXT_NOTOPENED_TIER,
	TEXT_CLEAR_PREVIOUS_TIER,
	TEXT_GET_MEDAL,
	TEXT_HEART_EMPTY,

	TEXT_GAMESTART,

	TEXT_ARBEIT,
	TEXT_GETREWARD,
	TEXT_JOYSTICKGOLD,

	TEXT_QUESTION,

	TEXT_CANNOTUSE_DEAD,//전투불능상태여서 스킬을 사용하실 수 없습니다.
	TEXT_CANNOTUSE_COOLTIME,//사용하려는 스킬의 쿨타임이 남아서 사용하실 수 없습니다.
	TEXT_CANNOTUSE_KNOCKBACK,//넉백상태여서 스킬을 사용하실 수 없습니다.
	TEXT_CANNOTUSE_CURSE,//저주에 걸려서 스킬을 사용하실 수 없습니다.
	TEXT_CANNOTUSE_STUN,//스턴에 걸려서 스킬을 사용하실 수 없습니다.
	TEXT_CANNOTUSE_SKILL,//다른 스킬을 시전중이어서 스킬을 사용하실 수 없습니다.

	TEXT_CLASS,
	TEXT_GETCONDITION,
	TEXT_REWARD,

	TEXT_NICKNAME,

	TEXT_MAILSAMPLE_TITLE1 = TEXT_NICKNAME + 100,
	TEXT_MAILSAMPLE_TITLE2,
	TEXT_MAILSAMPLE_TITLE3,

	TEXT_MAILSAMPLE_BODY1,
	TEXT_MAILSAMPLE_BODY2,
	TEXT_MAILSAMPLE_BODY3,

	TEXT_OPENING_0_0,//
	TEXT_OPENING_0_1,
	TEXT_OPENING_0_2,

	TEXT_OPENING_1_0,
	TEXT_OPENING_1_1,
	TEXT_OPENING_1_2,

	TEXT_OPENING_2_0,
	TEXT_OPENING_2_1,
	TEXT_OPENING_2_2,

	TEXT_OPENING_3_0,
	TEXT_OPENING_3_1,
	TEXT_OPENING_3_2,

	TEXT_OPENING_4_0,
	TEXT_OPENING_4_1,
	TEXT_OPENING_4_2,

	TEXT_OPENING_5_0,
	TEXT_OPENING_5_1,

	TEXT_OPENING_6_0,
	TEXT_OPENING_6_1,

	TEXT_OPENING_7_0,
	TEXT_OPENING_7_1,
	TEXT_OPENING_7_2,

	TEXT_BUY_CASTLE,
	TEXT_BASEGOLD,
	TEXT_RANKINGBONUS,
	TEXT_INTEREST,

	TEXT_SOLDIERITEMMINE,
	TEXT_RECIPEGRADE,

	TEXT_ERASEFROMSLOT,
	TEXT_ALREADYSETTING,
	TEXT_SELECTGEM,

	TEXT_RINGSLOTEMPTY,

	TEXT_CAPTAIN_WELCOME,
	TEXT_CAPTAIN_SOLDIER,
	TEXT_CAPTAIN_ARBEIT,

	TEXT_YES,
	TEXT_NO,

	TEXT_NOTICETIP,
	//TEXT_BOSSRAIDTIP,

	TEXT_LOGIN_FACEBOOK,
	TEXT_LOGIN_GOOGLE,
	TEXT_LOGIN_APPLE,
	TEXT_LOGIN_GUEST,

	TEXT_LOGIN_100,

	TEXT_BIGPIXEL,
	TEXT_DAMAGEBIGBANG,

	TEXT_BOSSOUT,

	TEXT_BRONZE_TIER,
	TEXT_SILVER_TIER,
	TEXT_GOLD_TIER,
	TEXT_PLATINUM_TIER,
	TEXT_DIAMOND_TIER,
	TEXT_CHALLENGER_TIER,
	TEXT_MASTER_TIER,
	TEXT_GRANDMASTER_TIER,
	TEXT_CHAMPION_TIER,
	TEXT_GRANDCHAMPION_TIER,

	TEXT_TIER,
	
	TEXT_CASTLE_TOLEM,//0
	TEXT_CASTLE_ARENA,//1
	TEXT_CASTLE_SWAMP,//2
	TEXT_CASTLE_VALLEY,//3
	TEXT_CASTLE_ATLANTICE,//4
	TEXT_CASTLE_SEWAGE,//5
	TEXT_CASTLE_ADELINE,//6
	TEXT_CASTLE_PLAIN,//7
	TEXT_CASTLE_ELF,//8
	TEXT_CASTLE_FLAME,//9
	TEXT_CASTLE_FROST,//10
	TEXT_CASTLE_THUNDER,//11
	TEXT_CASTLE_LIGHT,//12
	TEXT_CASTLE_GOLEMVALLEY,//13
	TEXT_CASTLE_DARKNESS,//14
	TEXT_CASTLE_DRAGON,//15
	TEXT_CASTLE_GHOST,//16
	TEXT_CASTLE_DEVILCASTLE,//17
	TEXT_CASTLE_SPACE,//18

	TEXT_CONGRATULATIONS,
	TEXT_TIEROPEN,

	TEXT_ATK,//"공격력"
	TEXT_SATK,//"스킬공격력"
	TEXT_DEF,//"방어력"
	TEXT_ASPD,//"공격속도"
	TEXT_VIT,//"생명력"
	TEXT_SPD,//"이동속도"
	TEXT_MRS,//"마법방어"
	TEXT_USERING,//"반지사용"
	TEXT_ATTRREGIST,//"속성저항"

	TEXT_ENEMYUSER_STARDOWN,//"님의 캐릭터의 별이 감소되었습니다!"
	TEXT_ENEMYUSER_GOLDDOWN,//"님의 골드를 획득했습니다!"
	TEXT_CASTLEOWNER,//

	TEXT_ME,//"나"
	TEXT_PHASE,//"PHASE"

	TEXT_MENU_PLAY,//"플레이"
	TEXT_MENU_COLLECTIONS,//"컬렉션"
	TEXT_MENU_FRIENDS,//"친구"
	TEXT_MENU_SHOP,//"상점"
	TEXT_MENU_STARSHOP,//"스타상점"
	TEXT_MENU_NEWS,//"뉴스"
	TEXT_MENU_GIFTS,//"선물함"
	TEXT_MENU_LEADERBOARD,//"리더보드"
	TEXT_MENU_INVITEFREINDS,//"친구초대"
	TEXT_MENU_CALENDAR,//"보상달력"
	TEXT_MENU_SETTING,//"세팅"

	TEXT_NEWITEM,//"신규획득"
	TEXT_EQUIPPEDITEM,//"현재장비"

	TEXT_LOG_TIER,//"티어"
	TEXT_LOG_STAGE,//"층"
	TEXT_LOG_HP,//"적HP"
	TEXT_LOG_SKILLCNT,//"스킬수"
	TEXT_LOG_CHARLV,//"캐릭Lv"
	TEXT_LOG_WEAPONLV,//"무기Lv"
	TEXT_LOG_TRY,//"회차"
	TEXT_LOG_CLEARTIME,//"클리어"

	TEXT_GAMETITLE,//"용병키우기"
	TEXT_ONLINE,//"-Online-"

	TEXT_RENT,

	TEXT_MILLIONAIRE,//"단장님을 위해 돈벌 준비가 되었나!"

	TEXT_OUTOFINVENITEM,//"사용하려면 기존 아이템을 팔아 인벤토리를 비워주세요."

	TEXT_NICKNAME_WRITE,//"그런데 단장님 이름은 어떻게 되시나요? 앞으로 단장님을 부를 이름을 입력해 주세요."

	TEXT_SOLDIER_RANKING,//"단장님, 알바비의 책정과 호칭에 대해 이야기 해 드릴게.@[알바비]는 단장님의 종신용병의 장비들의 세기의 합으로 장비의 별, 등급, 레벨이 높을수록 올라가네.@[호칭]은 전체 용병을 알바비 순으로 순위를 먹여 비율대로 획득하게 되네.@호칭이 높으면 알바비가 배수로 올라가니 정말 대단한 효과가 있지!"
	TEXT_SOLDIER_TOP100,//"현재 상위 100위 안에 드는 레전드 용병들의 알바비와 총 획득 황금열쇠 입니다. 대단합니다!"

	TEXT_HERO_PARAM_DMG,//"데미지"
	TEXT_HERO_PARAM_SKILLDMG,//"스킬데미지"
	TEXT_HERO_PARAM_ASPD,//"공격속도"
	TEXT_HERO_PARAM_MSPD,//"이동속도"
	TEXT_HERO_PARAM_HP,//"체력"
	TEXT_HERO_PARAM_DEF,//"방어력"

	TEXT_RING_RECOVERY,//"회복"
	TEXT_RING_STATUS_RECOVERY_SUCCESS,//"상태이상회복!"
	TEXT_RING_STATUS_RECOVERY_FAILED,//"상태이상회복실패!"
	TEXT_RING_EXTRA,//"추가타확률+"
	TEXT_RING_MISS,//"방어확률+"
	TEXT_RING_PIERCE,//"관통확률+"
	TEXT_RING_ENEMYDEFENSE,//"적방어감소+"

	TEXT_IDLEHELP_PLAY,//"오른쪽으로 스와이프해서 오토모드로 전환하세요."
	TEXT_IDLEHELP_HIT,//"선택장비와 같은 아이콘이 하나라도 나오면 파괴!"
	TEXT_IDLEHELP_RAID,//"4명의 캐릭터 중에 하나는 대박! 하나는 꽝!!"

	TEXT_DUNGEON_CLEAR,//"던전 클리어!"

	TEXT_ARENABOX,//"획득보물함"
	TEXT_USERINFO,//"유저상세정보"

	TEXT_ARAWDS,//"시상식"

	TEXT_ARENABOXINFO,//"모든 히어로가 획득한 장비는 보물함에 모여있다가, 게임이 종료되면 순위별로 좋은것부터 배분하게 됩니다!"

	TEXT_BOSSAPPEAR,

	TEXT_HIREING,
	TEXT_HIRE,

	TEXT_SEASON,
	TEXT_SEASON_END,
	TEXT_STAGE_END,

	TEXT_DAY,
	TEXT_HOUR,
	TEXT_MINUTE,
	TEXT_SECONDS,

	TEXT_SHIELD,
	TEXT_FREE,
	TEXT_TODAYFREE,
	TEXT_MERCENARYTIP,
	TEXT_HALLOFHONOR,
	TEXT_EVAN,
	TEXT_TOP100,
	TEXT_GETPAY,
	TEXT_UNTILGET,
	TEXT_NEWSOLDIER,
	TEXT_GROSSING,

	TEXT_CLEARREWARDS,
	TEXT_SKILL,
	TEXT_RECEIVECOMPLETE,

	TEXT_NICKNAMEINPUT,


	TEXT_NONE,//"없음"
	TEXT_GETEQUIP,//"장비를 획득하면 메뉴가 오픈되고, 장비를 처음 획득했을 때 보상을 받을 수 있습니다."
	TEXT_DETAILINFO,//"상세정보",
	TEXT_EXAM,//"승급시험"

	TEXT_LEVELUP_EFFECT,//"레벨업효과"

	TEXT_HOW_TO_GET_GUNNER,
	TEXT_HOW_TO_GET_HUNTER,

	TEXT_GOTOBATTLE,

	TEXT_CATEGORY_ITEM_SWORD,//"도검류 Sword"
	TEXT_CATEGORY_ITEM_GUN,//"총기류 Gun"
	TEXT_CATEGORY_ITEM_BOOMERANG,//"부메랑류 Boomerang"
	TEXT_CATEGORY_ITEM_HELM,//"투구류 Helmet"
	TEXT_CATEGORY_ITEM_HAT,//"모자류 Hat"
	TEXT_CATEGORY_ITEM_CAP,//"모자류 Cat"
	TEXT_CATEGORY_ITEM_ARMOR,//"갑옷류 Armor"
	TEXT_CATEGORY_ITEM_VEST,//"조끼류 Vest"
	TEXT_CATEGORY_ITEM_COAT,//"코트류 Coat"
	TEXT_CATEGORY_ITEM_GUNTLET,//"목장갑류 Gunlet"
	TEXT_CATEGORY_ITEM_ARMLET,//"팔찌류 Armlet"
	TEXT_CATEGORY_ITEM_GLOVE,//"장갑류 Glove"
	TEXT_CATEGORY_ITEM_KILT,///"킬트류 Kilt"
	TEXT_CATEGORY_ITEM_SKIRT,//"치마류 Skirt"
	TEXT_CATEGORY_ITEM_PANTS,//"바지류 Pants"
	TEXT_CATEGORY_ITEM_GREAVES,//"그리브류 Greave"
	TEXT_CATEGORY_ITEM_SHOES,//"신발류 Shoes"
	TEXT_CATEGORY_ITEM_BOOTS,//"부츠류 Boots"
	TEXT_CATEGORY_ITEM_NECK,//"목걸이류 Necklace"
	TEXT_CATEGORY_ITEM_RING,//"반지류 Ring"
	TEXT_CATEGORY_ITEM_GEM,//"보석류 Gem"
	TEXT_CATEGORY_ITEM_WASTE,//"소모품류 Consumables"
	TEXT_CATEGORY_ITEM_IRON,//"철광석류 Iron"
	TEXT_CATEGORY_ITEM_LEATHER,//"가죽류 Leather"
	TEXT_CATEGORY_ITEM_CLOTH,//"천류 Cloth"
	TEXT_CATEGORY_ITEM_WOOD,//"목재류 Wood"
	TEXT_CATEGORY_ITEM_ESSENCE,//"에센스류 Essence"
	TEXT_CATEGORY_ITEM_RECIPE,//"레시피류 Recipe"
	TEXT_CATEGORY_ITEM_QUEST,//"퀘스트아이템류 Quest"
	TEXT_CATEGORY_ITEM_NETITEM,//"스페셜아이템류 NetItem"
	TEXT_CATEGORY_ITEM_GOLD,//"골드 Gold"
	TEXT_CATEGORY_ITEM_KEY,//"열쇠 Key"
	TEXT_CATEGORY_ITEM_STATUE,//"조각상 Statue"
	TEXT_CATEGORY_ITEM_HEART,//"하트 Heart"
	TEXT_CATEGORY_ITEM_MEDAL,//"메달 Medal"
	TEXT_CATEGORY_ITEM_STAR,//"별 Star"
	TEXT_CATEGORY_ITEM_HAMMER,//"해머 Stone"
	TEXT_CATEGORY_ITEM_SHIELD,//"방패 Shield"
	TEXT_CATEGORY_ITEM_BOX,//"상자 Box"


	TEXT_MINDMG,//"최소@데미지"
	TEXT_GOLDREWARD,//"코인보상"

	TEXT_STAGE,//"스테이지"
	TEXT_ADVENTURE,//"모험"
	TEXT_OPEN,//"오픈"
	TEXT_STEALGOLD,//"상대방동전획득"

	TEXT_HELP_BATTLEMODE,//"다른 유저의 장비를 부수고, 배틀 아이템을 획득하세요!"
	TEXT_HELP_RAIDMODE,//"유저의 동료 4명중 코인을 가진 3명을 공격하세요!"
	TEXT_HELP_BOSSMODE,//"코인을 사용해서 데미지를 주세요! "

	TEXT_QUESTNAME0,

	TEXT_QUESTDESC0 = TEXT_QUESTNAME0 + TOTALQUEST,

	TEXT_PVPQUESTNAME0 = TEXT_QUESTDESC0 + TOTALQUEST,

	TEXT_PVPQUESTDESC0 = TEXT_PVPQUESTNAME0 + TOTALPVPQUEST,

	TEXT_COLLECT = TEXT_PVPQUESTDESC0 + TOTALPVPQUEST,
	TEXT_REMAINTIME,
	TEXT_TABFOREQUIP,
	TEXT_5ITEM,

	TEXT_UPGRADE,
	TEXT_GOTOUPGRADE,
	TEXT_HAMMER,

	TEXT_MAXUPGRADED,
	TEXT_5CARDNEED,

	TEXT_DOUPGRADEUNTILMAX,

	TEXT_IGOTIT,

	TEXT_HEARTAMOUNT,

	TEXT_TIP_MENU_SWORD,
	TEXT_TIP_MENU_GLOVE,
	TEXT_TIP_MENU_HELM,
	TEXT_TIP_MENU_ARMOR,
	TEXT_TIP_MENU_PANTS,
	TEXT_TIP_MENU_BOOTS,

	TEXT_AFTER,
	TEXT_SLASH,

	TEXT_LOADING_1,
	TEXT_LOADING_2,
	TEXT_LOADING_3,
	TEXT_LOADING_4,
	TEXT_LOADING_5,

	TEXT_TARGETING,
	TEXT_TARGETING_RAID,

	TEXT_TENANT_DISABLED,

	TEXT_HEARTISFULL,

	TEXT_CONTINUOUSATTACK,

	TEXT_BATTLEMODE_TITLE,
	TEXT_RAIDMODE_TITLE,
	TEXT_BOSSMODE_TITLE,

	TEXT_BATTLEMODE_START,
	TEXT_RAIDMODE_START,

	TEXT_BATTLEMODE_FAIL,
	TEXT_BATTLEMODE_SUCCEED,

	TEXT_LORD_RAIDATTACK,
	TEXT_LORD_BATTLEATTACK,

	TEXT_LORD_GETCOIN,
	TEXT_LORD_DUEL,

	TEXT_NEWSKILL,

	TEXT_JOKBO_COIN,
	TEXT_JOKBO_COINBAG,
	TEXT_JOKBO_HEART,
	TEXT_JOKBO_QUEST,
	TEXT_JOKBO_HIT,
	TEXT_JOKBO_RAID,

	TEXT_DAILYQUEST,

	TEXT_DAILYQUEST_OPEN_BOX_GETEQUIP,//상자를 열어 장비를 획득하세요!
	TEXT_DAILYQUEST_UPGRADE_CREW,//국경수비대를 업그레이드 하세요!
	TEXT_DAILYQUEST_ATTACK_OTHERUSER,//다른 마스터오브소드를 공격하세요!
	TEXT_DAILYQUEST_COLLECT_GOLD,//골드를 모으세요!
	TEXT_DAILYQUEST_STAGE_TRY,//몬스터의 공격을 방어하세요!

	TEXT_CALENDAR_DAILYREWARD,
	TEXT_CALENDAR_DAY1,
	TEXT_CALENDAR_DAY2,
	TEXT_CALENDAR_DAY3,
	TEXT_CALENDAR_DAY4,
	TEXT_CALENDAR_DAY5,
	TEXT_CALENDAR_DAY6,
	TEXT_CALENDAR_DAY7,

	TEXT_GRANDPRIZE,

	TEXT_EQUAL,

	TEXT_BATTLE_JOKBO_DESC,
	TEXT_RAID_JOKBO_DESC,

	TEXT_EVENT_DISCOUNT,

	TEXT_DEFAULTSTAT,
	TEXT_OPTIONSTAT,

	TEXT_COINDEFENSE,
	TEXT_ACTIONCARDINFO,

	TEXT_COLLECTIONS,

	TEXT_MYKING = TEXT_COLLECTIONS + TOTAL_COLLECTIONS,

	TEXT_MINUS,

	TEXT_LVUPREWARD_AUTOROLL,
	TEXT_LVUPREWARD_COLLECTIONS,
	TEXT_LVUPREWARD_DAILYREWARDS,
	TEXT_LVUPREWARD_DAILYQUEST,
	TEXT_LVUPREWARD_HEARTMAX,
	TEXT_LVUPREWARD_HEARTPERHOUR,
	TEXT_LVUPREWARD_SHILED,
	TEXT_LVUPREWARD_GETHERO,
	TEXT_LVUPREWARD_GETSKILL,
	TEXT_LVUPREWARD_STARBOX,
	TEXT_LVUPREWARD_HEART,

	TEXT_COLLECTIONSKILL,

	TEXT_COLLECTIONCOMPLETED,
	TEXT_COLLECTIONREWARD,
	TEXT_NEWCARDGETREWARD,

	TEXT_UNTILATTACK,
	TEXT_REMAIN,

	TEXT_PULL,
	TEXT_AUTO,
	TEXT_RESCUE,

	TEXT_LV,
	TEXT_NOTACQUIRED,

	TEXT_MEALONE,
	TEXT_SIEGE,

	TEXT_I,

	TEXT_FLOOR,
	TEXT_LOANSHARK,

	TEXT_ALPHA_HOLD,
	TEXT_BET,
	TEXT_STOP,
	TEXT_BET_EXPLAIN,
	TEXT_BETCOIN_USING,
	TEXT_BETCOIN_RESULT,

	TEXT_AUTOEQUIP,

	TEXT_BUYCOMPLETE,

	TEXT_STAGECLEAROPEN,//스테이지 20 클리어 시 오픈 

	TEXT_FULLCOLLECTIONSNEED,//모든 장비를 모아야 스킬이 활성화 됩니다.

	TEXT_HITCONTROL_DESC,

	TEXT_HOWTOPLAY_CREWRESCUE,

	TEXT_BEHINDSTORY,

	TEXT_ALPHA_SPIN,
	TEXT_ALPHA_STOP,
	TEXT_ALPHA_CREW,
	TEXT_ALPHA_BEFORE,
	TEXT_ALPHA_AFTER,

	TEXT_SELECTCONTROL_HELP,
	TEXT_INCOME,

	TEXT_STAGECLEARCREWGET,

	TEXT_MAINQUESTSTART,
	TEXT_PVPQUESTSTART,

	TEXT_HELPME,

	TEXT_MADA,
	TEXT_BOXOPEN,
	TEXT_BOXINFO,
	TEXT_DOT,

	TEXT_MAXLEVEL,
	TEXT_GUILD,
	TEXT_GUILDEVENT,
	TEXT_GUILDNUM,

	TEXT_CREW_LISTEDIT,
	TEXT_CREW_CURRENTLIST,
	TEXT_SLOTSETTING,
	TEXT_SLOTSETALLEADY,
	TEXT_EQUIP_LISTEDIT,
	TEXT_SHOP_BUY,
	TEXT_CASTLE,
	TEXT_CASTLE_LISTSELECT,

	TEXT_MAPNAME,

	TEXT_ALPHA_WAVE = TEXT_MAPNAME + CAP_MAP,
	TEXT_ALPHA_A,
	TEXT_ALPHA_B,
	TEXT_ALPHA_C,
	TEXT_ALPHA_D,
	TEXT_ALPHA_E,
	TEXT_ALPHA_F,
	TEXT_ALPHA_G,
	TEXT_ALPHA_H,
	TEXT_ALPHA_I,
	TEXT_ALPHA_J,
	TEXT_ALPHA_K,
	TEXT_ALPHA_L,
	TEXT_ALPHA_M,
	TEXT_ALPHA_N,
	TEXT_ALPHA_O,
	TEXT_ALPHA_P,
	TEXT_ALPHA_Q,
	TEXT_ALPHA_R,
	TEXT_ALPHA_S,
	TEXT_ALPHA_T,
	TEXT_ALPHA_U,
	TEXT_ALPHA_V,
	TEXT_ALPHA_W,
	TEXT_ALPHA_X,
	TEXT_ALPHA_Y,
	TEXT_ALPHA_Z,

	TEXT_AT,

	//Interactive combat tutorial narration
	TEXT_TUTORIAL_ATTACK,
	TEXT_TUTORIAL_FIRSTKILL,
	TEXT_TUTORIAL_CREWMENU,
	TEXT_TUTORIAL_SECONDKILL,
	TEXT_TUTORIAL_EQUIP,
	//하트베팅 안내 3줄. DEMO_TUTORIAL_HEARTBET 블록의 EFFECT_TALK가 movie.text를 하나씩
	//올리며 읽으므로 이 셋은 반드시 이 순서로 붙어 있어야 한다.
	TEXT_TUTORIAL_HEARTBET,
	TEXT_TUTORIAL_HEARTBET2,
	TEXT_TUTORIAL_HEARTBET3,
	//룰렛 개방 안내 2줄. DEMO_TUTORIAL_ROULETTE 블록이 같은 방식으로 둘을 이어 읽는다.
	TEXT_TUTORIAL_ROULETTE,
	TEXT_TUTORIAL_ROULETTE_LIVE,
	TEXT_TUTORIAL_BOSS,
	TEXT_TUTORIAL_CREWSET,
	TEXT_TUTORIAL_CREWJOIN,
	TEXT_TUTORIAL_EQUIPSET,
	TEXT_TUTORIAL_EQUIPWEAR,
	TEXT_TUTORIAL_BETUP,

	//상자를 열고 나오는 보상 요약창의 리본 제목
	TEXT_GACHAREWARD_TITLE,

	//---- 동료 상세보기 ----
	//제목/구획
	TEXT_CREW_DETAIL_TITLE,
	TEXT_CREW_SLOTEFFECT,
	TEXT_CREW_NEEDCURRENCY,
	TEXT_CREW_LEVELCUR,
	TEXT_CREW_LEVELNEXT,
	TEXT_CREW_MAXLEVEL,
	TEXT_CREW_PIECE,
	//슬롯에 몇 명 뜨느냐에 따라 나오는 효능 이름.
	//동료마다 3번째 스킬의 종류가 달라서(총탄/소환/히어로스킬/버프) 이름을
	//스킬 종류(SKILLDATA_ACTIVEPASSIVE)로 골라 쓴다.
	TEXT_CREW_SKILL_ATTACK,
	TEXT_CREW_SKILL_STRONG,
	TEXT_CREW_SKILL_ULTIMATE,
	TEXT_CREW_SKILL_SUMMON,
	TEXT_CREW_SKILL_HERO,
	TEXT_CREW_SKILL_BUFF,
	//효능 설명. 수치는 현재 레벨의 SKILLDATA_VALUE_LV*를 그대로 쓴다.
	TEXT_CREW_DESC_DAMAGE,
	TEXT_CREW_DESC_SUMMON,
	TEXT_CREW_DESC_HERO,
	TEXT_CREW_DESC_BUFF,
	//이미 편성표에 들어가 있는 동료의 장착 버튼에 적는 말
	TEXT_CREW_EQUIPPED,

	TEXT_LENGTH,

	MAXLABELCNT = TEXT_LENGTH,

	MAXFONTLABELCNT = TEXT_LENGTH,

	MAXNICKLABEL = 100,
} TEXTDEF;

#endif